Totuin/Flprog_Utilites/src/selectCore/flprogSelectCore_stm32.h
#pragma once
#include <Arduino.h>
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_C031C4TX) 
#define FLPROG_CORE_NAME "GENERIC C031C4TX"
#define FLPROG_CORE_CODE 375
#define FLPROG_CORE_GENERIC_C031C4TX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_C0

#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_C031C4UX) 
#define FLPROG_CORE_NAME "GENERIC C031C4UX"
#define FLPROG_CORE_CODE 376
#define FLPROG_CORE_GENERIC_C031C4UX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_C0

#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_C031C6TX) 
#define FLPROG_CORE_NAME "GENERIC C031C6TX"
#define FLPROG_CORE_CODE 377
#define FLPROG_CORE_GENERIC_C031C6TX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_C0

#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_C031C6UX) 
#define FLPROG_CORE_NAME "GENERIC C031C6UX"
#define FLPROG_CORE_CODE 378
#define FLPROG_CORE_GENERIC_C031C6UX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_C0

#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_NUCLEO_C031C6) 
#define FLPROG_CORE_NAME "NUCLEO C031C6"
#define FLPROG_CORE_CODE 1375
#define FLPROG_CORE_NUCLEO_C031C6
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_C0

#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_STM32C0316_DK) 
#define FLPROG_CORE_NAME "STM32C0316 DK"
#define FLPROG_CORE_CODE 1444
#define FLPROG_CORE_STM32C0316_DK
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_C0

#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_DEMO_F030F4) 
#define FLPROG_CORE_NAME "DEMO F030F4"
#define FLPROG_CORE_CODE 350
#define FLPROG_CORE_DEMO_F030F4
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F0
#define FLPROG_CORE_STM32_F030
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_DEMO_F030F4_16M) 
#define FLPROG_CORE_NAME "DEMO F030F4 16M"
#define FLPROG_CORE_CODE 351
#define FLPROG_CORE_DEMO_F030F4_16M
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F0
#define FLPROG_CORE_STM32_F030
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_DEMO_F030F4_HSI) 
#define FLPROG_CORE_NAME "DEMO F030F4 HSI"
#define FLPROG_CORE_CODE 352
#define FLPROG_CORE_DEMO_F030F4_HSI
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F0
#define FLPROG_CORE_STM32_F030
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_DISCO_F030R8) 
#define FLPROG_CORE_NAME "DISCO F030R8"
#define FLPROG_CORE_CODE 353
#define FLPROG_CORE_DISCO_F030R8
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F0
#define FLPROG_CORE_STM32_F030
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_EEXTR_F030_V1) 
#define FLPROG_CORE_NAME "EEXTR F030 V1"
#define FLPROG_CORE_CODE 366
#define FLPROG_CORE_EEXTR_F030_V1
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F0
#define FLPROG_CORE_STM32_F030
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F030C6TX) 
#define FLPROG_CORE_NAME "GENERIC F030C6TX"
#define FLPROG_CORE_CODE 379
#define FLPROG_CORE_GENERIC_F030C6TX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F0
#define FLPROG_CORE_STM32_F030
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F030C8TX) 
#define FLPROG_CORE_NAME "GENERIC F030C8TX"
#define FLPROG_CORE_CODE 380
#define FLPROG_CORE_GENERIC_F030C8TX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F0
#define FLPROG_CORE_STM32_F030
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F030F4PX) 
#define FLPROG_CORE_NAME "GENERIC F030F4PX"
#define FLPROG_CORE_CODE 381
#define FLPROG_CORE_GENERIC_F030F4PX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F0
#define FLPROG_CORE_STM32_F030
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F030K6TX) 
#define FLPROG_CORE_NAME "GENERIC F030K6TX"
#define FLPROG_CORE_CODE 382
#define FLPROG_CORE_GENERIC_F030K6TX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F0
#define FLPROG_CORE_STM32_F030
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F030R8TX) 
#define FLPROG_CORE_NAME "GENERIC F030R8TX"
#define FLPROG_CORE_CODE 383
#define FLPROG_CORE_GENERIC_F030R8TX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F0
#define FLPROG_CORE_STM32_F030
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_NUCLEO_F030R8) 
#define FLPROG_CORE_NAME "NUCLEO F030R8"
#define FLPROG_CORE_CODE 1376
#define FLPROG_CORE_NUCLEO_F030R8
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F0
#define FLPROG_CORE_STM32_F030
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F031C4TX) 
#define FLPROG_CORE_NAME "GENERIC F031C4TX"
#define FLPROG_CORE_CODE 384
#define FLPROG_CORE_GENERIC_F031C4TX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F0
#define FLPROG_CORE_STM32_F031
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F031C6TX) 
#define FLPROG_CORE_NAME "GENERIC F031C6TX"
#define FLPROG_CORE_CODE 385
#define FLPROG_CORE_GENERIC_F031C6TX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F0
#define FLPROG_CORE_STM32_F031
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F031E6YX) 
#define FLPROG_CORE_NAME "GENERIC F031E6YX"
#define FLPROG_CORE_CODE 386
#define FLPROG_CORE_GENERIC_F031E6YX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F0
#define FLPROG_CORE_STM32_F031
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F031F4PX) 
#define FLPROG_CORE_NAME "GENERIC F031F4PX"
#define FLPROG_CORE_CODE 387
#define FLPROG_CORE_GENERIC_F031F4PX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F0
#define FLPROG_CORE_STM32_F031
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F031F6PX) 
#define FLPROG_CORE_NAME "GENERIC F031F6PX"
#define FLPROG_CORE_CODE 388
#define FLPROG_CORE_GENERIC_F031F6PX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F0
#define FLPROG_CORE_STM32_F031
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F031G4UX) 
#define FLPROG_CORE_NAME "GENERIC F031G4UX"
#define FLPROG_CORE_CODE 389
#define FLPROG_CORE_GENERIC_F031G4UX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F0
#define FLPROG_CORE_STM32_F031
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F031G6UX) 
#define FLPROG_CORE_NAME "GENERIC F031G6UX"
#define FLPROG_CORE_CODE 390
#define FLPROG_CORE_GENERIC_F031G6UX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F0
#define FLPROG_CORE_STM32_F031
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F031K4UX) 
#define FLPROG_CORE_NAME "GENERIC F031K4UX"
#define FLPROG_CORE_CODE 391
#define FLPROG_CORE_GENERIC_F031K4UX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F0
#define FLPROG_CORE_STM32_F031
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F031K6TX) 
#define FLPROG_CORE_NAME "GENERIC F031K6TX"
#define FLPROG_CORE_CODE 392
#define FLPROG_CORE_GENERIC_F031K6TX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F0
#define FLPROG_CORE_STM32_F031
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F031K6UX) 
#define FLPROG_CORE_NAME "GENERIC F031K6UX"
#define FLPROG_CORE_CODE 393
#define FLPROG_CORE_GENERIC_F031K6UX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F0
#define FLPROG_CORE_STM32_F031
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_NUCLEO_F031K6) 
#define FLPROG_CORE_NAME "NUCLEO F031K6"
#define FLPROG_CORE_CODE 1377
#define FLPROG_CORE_NUCLEO_F031K6
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F0
#define FLPROG_CORE_STM32_F031
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F038C6TX) 
#define FLPROG_CORE_NAME "GENERIC F038C6TX"
#define FLPROG_CORE_CODE 394
#define FLPROG_CORE_GENERIC_F038C6TX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F0
#define FLPROG_CORE_STM32_F038
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F038E6YX) 
#define FLPROG_CORE_NAME "GENERIC F038E6YX"
#define FLPROG_CORE_CODE 395
#define FLPROG_CORE_GENERIC_F038E6YX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F0
#define FLPROG_CORE_STM32_F038
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F038F6PX) 
#define FLPROG_CORE_NAME "GENERIC F038F6PX"
#define FLPROG_CORE_CODE 396
#define FLPROG_CORE_GENERIC_F038F6PX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F0
#define FLPROG_CORE_STM32_F038
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F038G6UX) 
#define FLPROG_CORE_NAME "GENERIC F038G6UX"
#define FLPROG_CORE_CODE 397
#define FLPROG_CORE_GENERIC_F038G6UX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F0
#define FLPROG_CORE_STM32_F038
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F038K6UX) 
#define FLPROG_CORE_NAME "GENERIC F038K6UX"
#define FLPROG_CORE_CODE 398
#define FLPROG_CORE_GENERIC_F038K6UX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F0
#define FLPROG_CORE_STM32_F038
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F042C4TX) 
#define FLPROG_CORE_NAME "GENERIC F042C4TX"
#define FLPROG_CORE_CODE 399
#define FLPROG_CORE_GENERIC_F042C4TX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F0
#define FLPROG_CORE_STM32_F042
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F042C4UX) 
#define FLPROG_CORE_NAME "GENERIC F042C4UX"
#define FLPROG_CORE_CODE 400
#define FLPROG_CORE_GENERIC_F042C4UX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F0
#define FLPROG_CORE_STM32_F042
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F042C6TX) 
#define FLPROG_CORE_NAME "GENERIC F042C6TX"
#define FLPROG_CORE_CODE 401
#define FLPROG_CORE_GENERIC_F042C6TX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F0
#define FLPROG_CORE_STM32_F042
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F042C6UX) 
#define FLPROG_CORE_NAME "GENERIC F042C6UX"
#define FLPROG_CORE_CODE 402
#define FLPROG_CORE_GENERIC_F042C6UX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F0
#define FLPROG_CORE_STM32_F042
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F042F4PX) 
#define FLPROG_CORE_NAME "GENERIC F042F4PX"
#define FLPROG_CORE_CODE 403
#define FLPROG_CORE_GENERIC_F042F4PX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F0
#define FLPROG_CORE_STM32_F042
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F042F6PX) 
#define FLPROG_CORE_NAME "GENERIC F042F6PX"
#define FLPROG_CORE_CODE 404
#define FLPROG_CORE_GENERIC_F042F6PX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F0
#define FLPROG_CORE_STM32_F042
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F042G4UX) 
#define FLPROG_CORE_NAME "GENERIC F042G4UX"
#define FLPROG_CORE_CODE 405
#define FLPROG_CORE_GENERIC_F042G4UX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F0
#define FLPROG_CORE_STM32_F042
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F042G6UX) 
#define FLPROG_CORE_NAME "GENERIC F042G6UX"
#define FLPROG_CORE_CODE 406
#define FLPROG_CORE_GENERIC_F042G6UX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
