Totuin/Flprog_Utilites/src/selectCore/flprogSelectCore_stm32.h
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F0
#define FLPROG_CORE_STM32_F042
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F042K4TX) 
#define FLPROG_CORE_NAME "GENERIC F042K4TX"
#define FLPROG_CORE_CODE 407
#define FLPROG_CORE_GENERIC_F042K4TX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F0
#define FLPROG_CORE_STM32_F042
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F042K6TX) 
#define FLPROG_CORE_NAME "GENERIC F042K6TX"
#define FLPROG_CORE_CODE 408
#define FLPROG_CORE_GENERIC_F042K6TX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F0
#define FLPROG_CORE_STM32_F042
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F042T6YX) 
#define FLPROG_CORE_NAME "GENERIC F042T6YX"
#define FLPROG_CORE_CODE 409
#define FLPROG_CORE_GENERIC_F042T6YX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F0
#define FLPROG_CORE_STM32_F042
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_NUCLEO_F042K6) 
#define FLPROG_CORE_NAME "NUCLEO F042K6"
#define FLPROG_CORE_CODE 1378
#define FLPROG_CORE_NUCLEO_F042K6
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F0
#define FLPROG_CORE_STM32_F042
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F048G6UX) 
#define FLPROG_CORE_NAME "GENERIC F048G6UX"
#define FLPROG_CORE_CODE 410
#define FLPROG_CORE_GENERIC_F048G6UX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F0
#define FLPROG_CORE_STM32_F048
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F048T6YX) 
#define FLPROG_CORE_NAME "GENERIC F048T6YX"
#define FLPROG_CORE_CODE 411
#define FLPROG_CORE_GENERIC_F048T6YX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F0
#define FLPROG_CORE_STM32_F048
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F051C4TX) 
#define FLPROG_CORE_NAME "GENERIC F051C4TX"
#define FLPROG_CORE_CODE 412
#define FLPROG_CORE_GENERIC_F051C4TX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F0
#define FLPROG_CORE_STM32_F051
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F051C4UX) 
#define FLPROG_CORE_NAME "GENERIC F051C4UX"
#define FLPROG_CORE_CODE 413
#define FLPROG_CORE_GENERIC_F051C4UX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F0
#define FLPROG_CORE_STM32_F051
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F051K4TX) 
#define FLPROG_CORE_NAME "GENERIC F051K4TX"
#define FLPROG_CORE_CODE 414
#define FLPROG_CORE_GENERIC_F051K4TX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F0
#define FLPROG_CORE_STM32_F051
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F051K6UX) 
#define FLPROG_CORE_NAME "GENERIC F051K6UX"
#define FLPROG_CORE_CODE 415
#define FLPROG_CORE_GENERIC_F051K6UX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F0
#define FLPROG_CORE_STM32_F051
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F051K8UX) 
#define FLPROG_CORE_NAME "GENERIC F051K8UX"
#define FLPROG_CORE_CODE 416
#define FLPROG_CORE_GENERIC_F051K8UX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F0
#define FLPROG_CORE_STM32_F051
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F051R4TX) 
#define FLPROG_CORE_NAME "GENERIC F051R4TX"
#define FLPROG_CORE_CODE 417
#define FLPROG_CORE_GENERIC_F051R4TX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F0
#define FLPROG_CORE_STM32_F051
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F051T8YX) 
#define FLPROG_CORE_NAME "GENERIC F051T8YX"
#define FLPROG_CORE_CODE 418
#define FLPROG_CORE_GENERIC_F051T8YX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F0
#define FLPROG_CORE_STM32_F051
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_WRAITH32_V1) 
#define FLPROG_CORE_NAME "WRAITH32 V1"
#define FLPROG_CORE_CODE 1457
#define FLPROG_CORE_WRAITH32_V1
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F0
#define FLPROG_CORE_STM32_F051
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F058C8UX) 
#define FLPROG_CORE_NAME "GENERIC F058C8UX"
#define FLPROG_CORE_CODE 419
#define FLPROG_CORE_GENERIC_F058C8UX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F0
#define FLPROG_CORE_STM32_F058
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F058R8HX) 
#define FLPROG_CORE_NAME "GENERIC F058R8HX"
#define FLPROG_CORE_CODE 420
#define FLPROG_CORE_GENERIC_F058R8HX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F0
#define FLPROG_CORE_STM32_F058
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F058R8TX) 
#define FLPROG_CORE_NAME "GENERIC F058R8TX"
#define FLPROG_CORE_CODE 421
#define FLPROG_CORE_GENERIC_F058R8TX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F0
#define FLPROG_CORE_STM32_F058
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F058T8YX) 
#define FLPROG_CORE_NAME "GENERIC F058T8YX"
#define FLPROG_CORE_CODE 422
#define FLPROG_CORE_GENERIC_F058T8YX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F0
#define FLPROG_CORE_STM32_F058
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F070CBTX) 
#define FLPROG_CORE_NAME "GENERIC F070CBTX"
#define FLPROG_CORE_CODE 423
#define FLPROG_CORE_GENERIC_F070CBTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F0
#define FLPROG_CORE_STM32_F070
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F070RBTX) 
#define FLPROG_CORE_NAME "GENERIC F070RBTX"
#define FLPROG_CORE_CODE 424
#define FLPROG_CORE_GENERIC_F070RBTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F0
#define FLPROG_CORE_STM32_F070
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F078CBTX) 
#define FLPROG_CORE_NAME "GENERIC F078CBTX"
#define FLPROG_CORE_CODE 448
#define FLPROG_CORE_GENERIC_F078CBTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F0
#define FLPROG_CORE_STM32_F070
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_MALYANM200_F070CB) 
#define FLPROG_CORE_NAME "MALYANM200 F070CB"
#define FLPROG_CORE_CODE 1369
#define FLPROG_CORE_MALYANM200_F070CB
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F0
#define FLPROG_CORE_STM32_F070
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_MALYANM300_F070CB) 
#define FLPROG_CORE_NAME "MALYANM300 F070CB"
#define FLPROG_CORE_CODE 1371
#define FLPROG_CORE_MALYANM300_F070CB
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F0
#define FLPROG_CORE_STM32_F070
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_NUCLEO_F070RB) 
#define FLPROG_CORE_NAME "NUCLEO F070RB"
#define FLPROG_CORE_CODE 1379
#define FLPROG_CORE_NUCLEO_F070RB
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F0
#define FLPROG_CORE_STM32_F070
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F071C8TX) 
#define FLPROG_CORE_NAME "GENERIC F071C8TX"
#define FLPROG_CORE_CODE 425
#define FLPROG_CORE_GENERIC_F071C8TX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F0
#define FLPROG_CORE_STM32_F071
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F071C8UX) 
#define FLPROG_CORE_NAME "GENERIC F071C8UX"
#define FLPROG_CORE_CODE 426
#define FLPROG_CORE_GENERIC_F071C8UX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F0
#define FLPROG_CORE_STM32_F071
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F071CBTX) 
#define FLPROG_CORE_NAME "GENERIC F071CBTX"
#define FLPROG_CORE_CODE 427
#define FLPROG_CORE_GENERIC_F071CBTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F0
#define FLPROG_CORE_STM32_F071
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F071CBUX) 
#define FLPROG_CORE_NAME "GENERIC F071CBUX"
#define FLPROG_CORE_CODE 428
#define FLPROG_CORE_GENERIC_F071CBUX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F0
#define FLPROG_CORE_STM32_F071
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F071CBYX) 
#define FLPROG_CORE_NAME "GENERIC F071CBYX"
#define FLPROG_CORE_CODE 429
#define FLPROG_CORE_GENERIC_F071CBYX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F0
#define FLPROG_CORE_STM32_F071
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F071RBTX) 
#define FLPROG_CORE_NAME "GENERIC F071RBTX"
#define FLPROG_CORE_CODE 430
#define FLPROG_CORE_GENERIC_F071RBTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F0
#define FLPROG_CORE_STM32_F071
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F071V8HX) 
#define FLPROG_CORE_NAME "GENERIC F071V8HX"
#define FLPROG_CORE_CODE 431
#define FLPROG_CORE_GENERIC_F071V8HX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F0
#define FLPROG_CORE_STM32_F071
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F071V8TX) 
#define FLPROG_CORE_NAME "GENERIC F071V8TX"
#define FLPROG_CORE_CODE 432
#define FLPROG_CORE_GENERIC_F071V8TX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F0
#define FLPROG_CORE_STM32_F071
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F071VBHX) 
#define FLPROG_CORE_NAME "GENERIC F071VBHX"
#define FLPROG_CORE_CODE 433
#define FLPROG_CORE_GENERIC_F071VBHX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F0
#define FLPROG_CORE_STM32_F071
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F071VBTX) 
#define FLPROG_CORE_NAME "GENERIC F071VBTX"
#define FLPROG_CORE_CODE 434
#define FLPROG_CORE_GENERIC_F071VBTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F0
#define FLPROG_CORE_STM32_F071
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_DISCO_F072RB) 
#define FLPROG_CORE_NAME "DISCO F072RB"
#define FLPROG_CORE_CODE 354
#define FLPROG_CORE_DISCO_F072RB
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F0
#define FLPROG_CORE_STM32_F072
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_ELEKTOR_F072C8) 
#define FLPROG_CORE_NAME "ELEKTOR F072C8"
#define FLPROG_CORE_CODE 367
#define FLPROG_CORE_ELEKTOR_F072C8
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F0
#define FLPROG_CORE_STM32_F072
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_ELEKTOR_F072CB) 
#define FLPROG_CORE_NAME "ELEKTOR F072CB"
#define FLPROG_CORE_CODE 368
#define FLPROG_CORE_ELEKTOR_F072CB
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F0
#define FLPROG_CORE_STM32_F072
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F072C8TX) 
#define FLPROG_CORE_NAME "GENERIC F072C8TX"
#define FLPROG_CORE_CODE 435
#define FLPROG_CORE_GENERIC_F072C8TX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F0
#define FLPROG_CORE_STM32_F072
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F072C8UX) 
#define FLPROG_CORE_NAME "GENERIC F072C8UX"
#define FLPROG_CORE_CODE 436
#define FLPROG_CORE_GENERIC_F072C8UX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F0
#define FLPROG_CORE_STM32_F072
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F072CBTX) 
#define FLPROG_CORE_NAME "GENERIC F072CBTX"
#define FLPROG_CORE_CODE 437
#define FLPROG_CORE_GENERIC_F072CBTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F0
