Totuin/Flprog_Utilites/src/selectCore/flprogSelectCore_stm32.h
#define FLPROG_CORE_STM32_F072
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F072CBUX) 
#define FLPROG_CORE_NAME "GENERIC F072CBUX"
#define FLPROG_CORE_CODE 438
#define FLPROG_CORE_GENERIC_F072CBUX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F0
#define FLPROG_CORE_STM32_F072
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F072CBYX) 
#define FLPROG_CORE_NAME "GENERIC F072CBYX"
#define FLPROG_CORE_CODE 439
#define FLPROG_CORE_GENERIC_F072CBYX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F0
#define FLPROG_CORE_STM32_F072
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F072R8TX) 
#define FLPROG_CORE_NAME "GENERIC F072R8TX"
#define FLPROG_CORE_CODE 440
#define FLPROG_CORE_GENERIC_F072R8TX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F0
#define FLPROG_CORE_STM32_F072
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F072RBHX) 
#define FLPROG_CORE_NAME "GENERIC F072RBHX"
#define FLPROG_CORE_CODE 441
#define FLPROG_CORE_GENERIC_F072RBHX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F0
#define FLPROG_CORE_STM32_F072
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F072RBIX) 
#define FLPROG_CORE_NAME "GENERIC F072RBIX"
#define FLPROG_CORE_CODE 442
#define FLPROG_CORE_GENERIC_F072RBIX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F0
#define FLPROG_CORE_STM32_F072
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F072RBTX) 
#define FLPROG_CORE_NAME "GENERIC F072RBTX"
#define FLPROG_CORE_CODE 443
#define FLPROG_CORE_GENERIC_F072RBTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F0
#define FLPROG_CORE_STM32_F072
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F072V8HX) 
#define FLPROG_CORE_NAME "GENERIC F072V8HX"
#define FLPROG_CORE_CODE 444
#define FLPROG_CORE_GENERIC_F072V8HX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F0
#define FLPROG_CORE_STM32_F072
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F072V8TX) 
#define FLPROG_CORE_NAME "GENERIC F072V8TX"
#define FLPROG_CORE_CODE 445
#define FLPROG_CORE_GENERIC_F072V8TX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F0
#define FLPROG_CORE_STM32_F072
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F072VBHX) 
#define FLPROG_CORE_NAME "GENERIC F072VBHX"
#define FLPROG_CORE_CODE 446
#define FLPROG_CORE_GENERIC_F072VBHX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F0
#define FLPROG_CORE_STM32_F072
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F072VBTX) 
#define FLPROG_CORE_NAME "GENERIC F072VBTX"
#define FLPROG_CORE_CODE 447
#define FLPROG_CORE_GENERIC_F072VBTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F0
#define FLPROG_CORE_STM32_F072
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_NUCLEO_F072RB) 
#define FLPROG_CORE_NAME "NUCLEO F072RB"
#define FLPROG_CORE_CODE 1380
#define FLPROG_CORE_NUCLEO_F072RB
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F0
#define FLPROG_CORE_STM32_F072
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_PYBSTICK26_DUINO) 
#define FLPROG_CORE_NAME "PYBSTICK26 DUINO"
#define FLPROG_CORE_CODE 1431
#define FLPROG_CORE_PYBSTICK26_DUINO
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F0
#define FLPROG_CORE_STM32_F072
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F078CBUX) 
#define FLPROG_CORE_NAME "GENERIC F078CBUX"
#define FLPROG_CORE_CODE 449
#define FLPROG_CORE_GENERIC_F078CBUX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F0
#define FLPROG_CORE_STM32_F078
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F078CBYX) 
#define FLPROG_CORE_NAME "GENERIC F078CBYX"
#define FLPROG_CORE_CODE 450
#define FLPROG_CORE_GENERIC_F078CBYX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F0
#define FLPROG_CORE_STM32_F078
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F078RBHX) 
#define FLPROG_CORE_NAME "GENERIC F078RBHX"
#define FLPROG_CORE_CODE 451
#define FLPROG_CORE_GENERIC_F078RBHX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F0
#define FLPROG_CORE_STM32_F078
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F078RBTX) 
#define FLPROG_CORE_NAME "GENERIC F078RBTX"
#define FLPROG_CORE_CODE 452
#define FLPROG_CORE_GENERIC_F078RBTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F0
#define FLPROG_CORE_STM32_F078
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F078VBHX) 
#define FLPROG_CORE_NAME "GENERIC F078VBHX"
#define FLPROG_CORE_CODE 453
#define FLPROG_CORE_GENERIC_F078VBHX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F0
#define FLPROG_CORE_STM32_F078
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F078VBTX) 
#define FLPROG_CORE_NAME "GENERIC F078VBTX"
#define FLPROG_CORE_CODE 454
#define FLPROG_CORE_GENERIC_F078VBTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F0
#define FLPROG_CORE_STM32_F078
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F091CBTX) 
#define FLPROG_CORE_NAME "GENERIC F091CBTX"
#define FLPROG_CORE_CODE 455
#define FLPROG_CORE_GENERIC_F091CBTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F0
#define FLPROG_CORE_STM32_F091
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F091CBUX) 
#define FLPROG_CORE_NAME "GENERIC F091CBUX"
#define FLPROG_CORE_CODE 456
#define FLPROG_CORE_GENERIC_F091CBUX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F0
#define FLPROG_CORE_STM32_F091
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F091CCTX) 
#define FLPROG_CORE_NAME "GENERIC F091CCTX"
#define FLPROG_CORE_CODE 457
#define FLPROG_CORE_GENERIC_F091CCTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F0
#define FLPROG_CORE_STM32_F091
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F091CCUX) 
#define FLPROG_CORE_NAME "GENERIC F091CCUX"
#define FLPROG_CORE_CODE 458
#define FLPROG_CORE_GENERIC_F091CCUX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F0
#define FLPROG_CORE_STM32_F091
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F091RBTX) 
#define FLPROG_CORE_NAME "GENERIC F091RBTX"
#define FLPROG_CORE_CODE 459
#define FLPROG_CORE_GENERIC_F091RBTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F0
#define FLPROG_CORE_STM32_F091
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F091RCHX) 
#define FLPROG_CORE_NAME "GENERIC F091RCHX"
#define FLPROG_CORE_CODE 460
#define FLPROG_CORE_GENERIC_F091RCHX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F0
#define FLPROG_CORE_STM32_F091
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F091RCTX) 
#define FLPROG_CORE_NAME "GENERIC F091RCTX"
#define FLPROG_CORE_CODE 461
#define FLPROG_CORE_GENERIC_F091RCTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F0
#define FLPROG_CORE_STM32_F091
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F091RCYX) 
#define FLPROG_CORE_NAME "GENERIC F091RCYX"
#define FLPROG_CORE_CODE 462
#define FLPROG_CORE_GENERIC_F091RCYX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F0
#define FLPROG_CORE_STM32_F091
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F091VBTX) 
#define FLPROG_CORE_NAME "GENERIC F091VBTX"
#define FLPROG_CORE_CODE 463
#define FLPROG_CORE_GENERIC_F091VBTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F0
#define FLPROG_CORE_STM32_F091
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F091VCHX) 
#define FLPROG_CORE_NAME "GENERIC F091VCHX"
#define FLPROG_CORE_CODE 464
#define FLPROG_CORE_GENERIC_F091VCHX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F0
#define FLPROG_CORE_STM32_F091
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F091VCTX) 
#define FLPROG_CORE_NAME "GENERIC F091VCTX"
#define FLPROG_CORE_CODE 465
#define FLPROG_CORE_GENERIC_F091VCTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F0
#define FLPROG_CORE_STM32_F091
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_NUCLEO_F091RC) 
#define FLPROG_CORE_NAME "NUCLEO F091RC"
#define FLPROG_CORE_CODE 1381
#define FLPROG_CORE_NUCLEO_F091RC
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F0
#define FLPROG_CORE_STM32_F091
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F098CCTX) 
#define FLPROG_CORE_NAME "GENERIC F098CCTX"
#define FLPROG_CORE_CODE 466
#define FLPROG_CORE_GENERIC_F098CCTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F0
#define FLPROG_CORE_STM32_F098
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F098CCUX) 
#define FLPROG_CORE_NAME "GENERIC F098CCUX"
#define FLPROG_CORE_CODE 467
#define FLPROG_CORE_GENERIC_F098CCUX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F0
#define FLPROG_CORE_STM32_F098
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F098RCHX) 
#define FLPROG_CORE_NAME "GENERIC F098RCHX"
#define FLPROG_CORE_CODE 468
#define FLPROG_CORE_GENERIC_F098RCHX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F0
#define FLPROG_CORE_STM32_F098
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F098RCTX) 
#define FLPROG_CORE_NAME "GENERIC F098RCTX"
#define FLPROG_CORE_CODE 469
#define FLPROG_CORE_GENERIC_F098RCTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F0
#define FLPROG_CORE_STM32_F098
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F098RCYX) 
#define FLPROG_CORE_NAME "GENERIC F098RCYX"
#define FLPROG_CORE_CODE 470
#define FLPROG_CORE_GENERIC_F098RCYX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F0
#define FLPROG_CORE_STM32_F098
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F098VCHX) 
#define FLPROG_CORE_NAME "GENERIC F098VCHX"
#define FLPROG_CORE_CODE 471
#define FLPROG_CORE_GENERIC_F098VCHX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F0
#define FLPROG_CORE_STM32_F098
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F098VCTX) 
#define FLPROG_CORE_NAME "GENERIC F098VCTX"
#define FLPROG_CORE_CODE 472
#define FLPROG_CORE_GENERIC_F098VCTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F0
#define FLPROG_CORE_STM32_F098
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_DISCO_F100RB) 
#define FLPROG_CORE_NAME "DISCO F100RB"
#define FLPROG_CORE_CODE 355
#define FLPROG_CORE_DISCO_F100RB
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F1
#define FLPROG_CORE_STM32_F100
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F100C4TX) 
#define FLPROG_CORE_NAME "GENERIC F100C4TX"
#define FLPROG_CORE_CODE 473
#define FLPROG_CORE_GENERIC_F100C4TX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F1
#define FLPROG_CORE_STM32_F100
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F100C6TX) 
#define FLPROG_CORE_NAME "GENERIC F100C6TX"
#define FLPROG_CORE_CODE 474
#define FLPROG_CORE_GENERIC_F100C6TX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F1
#define FLPROG_CORE_STM32_F100
#endif
