Totuin/Flprog_Utilites/src/selectCore/flprogSelectCore_stm32.h
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F100C8TX) 
#define FLPROG_CORE_NAME "GENERIC F100C8TX"
#define FLPROG_CORE_CODE 475
#define FLPROG_CORE_GENERIC_F100C8TX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F1
#define FLPROG_CORE_STM32_F100
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F100CBTX) 
#define FLPROG_CORE_NAME "GENERIC F100CBTX"
#define FLPROG_CORE_CODE 476
#define FLPROG_CORE_GENERIC_F100CBTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F1
#define FLPROG_CORE_STM32_F100
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F100R4HX) 
#define FLPROG_CORE_NAME "GENERIC F100R4HX"
#define FLPROG_CORE_CODE 477
#define FLPROG_CORE_GENERIC_F100R4HX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F1
#define FLPROG_CORE_STM32_F100
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F100R6HX) 
#define FLPROG_CORE_NAME "GENERIC F100R6HX"
#define FLPROG_CORE_CODE 478
#define FLPROG_CORE_GENERIC_F100R6HX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F1
#define FLPROG_CORE_STM32_F100
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F100R8TX) 
#define FLPROG_CORE_NAME "GENERIC F100R8TX"
#define FLPROG_CORE_CODE 479
#define FLPROG_CORE_GENERIC_F100R8TX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F1
#define FLPROG_CORE_STM32_F100
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F100RBTX) 
#define FLPROG_CORE_NAME "GENERIC F100RBTX"
#define FLPROG_CORE_CODE 480
#define FLPROG_CORE_GENERIC_F100RBTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F1
#define FLPROG_CORE_STM32_F100
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F100V8TX) 
#define FLPROG_CORE_NAME "GENERIC F100V8TX"
#define FLPROG_CORE_CODE 481
#define FLPROG_CORE_GENERIC_F100V8TX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F1
#define FLPROG_CORE_STM32_F100
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F100VBTX) 
#define FLPROG_CORE_NAME "GENERIC F100VBTX"
#define FLPROG_CORE_CODE 482
#define FLPROG_CORE_GENERIC_F100VBTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F1
#define FLPROG_CORE_STM32_F100
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F100ZCTX) 
#define FLPROG_CORE_NAME "GENERIC F100ZCTX"
#define FLPROG_CORE_CODE 483
#define FLPROG_CORE_GENERIC_F100ZCTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F1
#define FLPROG_CORE_STM32_F100
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F100ZDTX) 
#define FLPROG_CORE_NAME "GENERIC F100ZDTX"
#define FLPROG_CORE_CODE 484
#define FLPROG_CORE_GENERIC_F100ZDTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F1
#define FLPROG_CORE_STM32_F100
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F100ZETX) 
#define FLPROG_CORE_NAME "GENERIC F100ZETX"
#define FLPROG_CORE_CODE 485
#define FLPROG_CORE_GENERIC_F100ZETX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F1
#define FLPROG_CORE_STM32_F100
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F101C4TX) 
#define FLPROG_CORE_NAME "GENERIC F101C4TX"
#define FLPROG_CORE_CODE 486
#define FLPROG_CORE_GENERIC_F101C4TX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F1
#define FLPROG_CORE_STM32_F101
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F101C6TX) 
#define FLPROG_CORE_NAME "GENERIC F101C6TX"
#define FLPROG_CORE_CODE 487
#define FLPROG_CORE_GENERIC_F101C6TX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F1
#define FLPROG_CORE_STM32_F101
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F101R4TX) 
#define FLPROG_CORE_NAME "GENERIC F101R4TX"
#define FLPROG_CORE_CODE 488
#define FLPROG_CORE_GENERIC_F101R4TX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F1
#define FLPROG_CORE_STM32_F101
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F101R6TX) 
#define FLPROG_CORE_NAME "GENERIC F101R6TX"
#define FLPROG_CORE_CODE 489
#define FLPROG_CORE_GENERIC_F101R6TX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F1
#define FLPROG_CORE_STM32_F101
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F101T4UX) 
#define FLPROG_CORE_NAME "GENERIC F101T4UX"
#define FLPROG_CORE_CODE 490
#define FLPROG_CORE_GENERIC_F101T4UX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F1
#define FLPROG_CORE_STM32_F101
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F101T6UX) 
#define FLPROG_CORE_NAME "GENERIC F101T6UX"
#define FLPROG_CORE_CODE 491
#define FLPROG_CORE_GENERIC_F101T6UX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F1
#define FLPROG_CORE_STM32_F101
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F101V8TX) 
#define FLPROG_CORE_NAME "GENERIC F101V8TX"
#define FLPROG_CORE_CODE 492
#define FLPROG_CORE_GENERIC_F101V8TX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F1
#define FLPROG_CORE_STM32_F101
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F101VBTX) 
#define FLPROG_CORE_NAME "GENERIC F101VBTX"
#define FLPROG_CORE_CODE 493
#define FLPROG_CORE_GENERIC_F101VBTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F1
#define FLPROG_CORE_STM32_F101
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F101ZCTX) 
#define FLPROG_CORE_NAME "GENERIC F101ZCTX"
#define FLPROG_CORE_CODE 494
#define FLPROG_CORE_GENERIC_F101ZCTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F1
#define FLPROG_CORE_STM32_F101
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F101ZDTX) 
#define FLPROG_CORE_NAME "GENERIC F101ZDTX"
#define FLPROG_CORE_CODE 495
#define FLPROG_CORE_GENERIC_F101ZDTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F1
#define FLPROG_CORE_STM32_F101
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F101ZETX) 
#define FLPROG_CORE_NAME "GENERIC F101ZETX"
#define FLPROG_CORE_CODE 496
#define FLPROG_CORE_GENERIC_F101ZETX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F1
#define FLPROG_CORE_STM32_F101
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_AFROFLIGHT_F103CB) 
#define FLPROG_CORE_NAME "AFROFLIGHT F103CB"
#define FLPROG_CORE_CODE 320
#define FLPROG_CORE_AFROFLIGHT_F103CB
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F1
#define FLPROG_CORE_STM32_F103

#define FLPROG_I2CSPEED 400000UL
#define FLPROG_I2C1_SDA PB11
#define FLPROG_I2C1_SCL PB10

#define FLPROG_HAS_UART1

#define FLPROG_HAS_UART2
#define FLPROG_NEED_CREATE_UART2
#define FLPROG_UART2_RX PA3
#define FLPROG_UART2_TX PA2

#define FLPROG_HAS_UART3
#define FLPROG_NEED_CREATE_UART3
#define FLPROG_UART3_RX PA11
#define FLPROG_UART3_TX PA10
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_BLACKPILL_F103C8) 
#define FLPROG_CORE_NAME "BLACKPILL F103C8"
#define FLPROG_CORE_CODE 324
#define FLPROG_CORE_BLACKPILL_F103C8
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F1
#define FLPROG_CORE_STM32_F103

#define FLPROG_I2CSPEED 400000UL
#define FLPROG_I2C1_SDA PB11
#define FLPROG_I2C1_SCL PB10

#define FLPROG_HAS_UART1

#define FLPROG_HAS_UART2
#define FLPROG_NEED_CREATE_UART2
#define FLPROG_UART2_RX PA3
#define FLPROG_UART2_TX PA2

#define FLPROG_HAS_UART3
#define FLPROG_NEED_CREATE_UART3
#define FLPROG_UART3_RX PA11
#define FLPROG_UART3_TX PA10
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_BLUEBUTTON_F103R8T) 
#define FLPROG_CORE_NAME "BLUEBUTTON F103R8T"
#define FLPROG_CORE_CODE 333
#define FLPROG_CORE_BLUEBUTTON_F103R8T
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F1
#define FLPROG_CORE_STM32_F103

#define FLPROG_I2CSPEED 400000UL
#define FLPROG_I2C1_SDA PB11
#define FLPROG_I2C1_SCL PB10

#define FLPROG_HAS_UART1

#define FLPROG_HAS_UART2
#define FLPROG_NEED_CREATE_UART2
#define FLPROG_UART2_RX PA3
#define FLPROG_UART2_TX PA2

#define FLPROG_HAS_UART3
#define FLPROG_NEED_CREATE_UART3
#define FLPROG_UART3_RX PA11
#define FLPROG_UART3_TX PA10
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_BLUEBUTTON_F103RBT) 
#define FLPROG_CORE_NAME "BLUEBUTTON F103RBT"
#define FLPROG_CORE_CODE 334
#define FLPROG_CORE_BLUEBUTTON_F103RBT
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F1
#define FLPROG_CORE_STM32_F103

#define FLPROG_I2CSPEED 400000UL
#define FLPROG_I2C1_SDA PB11
#define FLPROG_I2C1_SCL PB10

#define FLPROG_HAS_UART1

#define FLPROG_HAS_UART2
#define FLPROG_NEED_CREATE_UART2
#define FLPROG_UART2_RX PA3
#define FLPROG_UART2_TX PA2

#define FLPROG_HAS_UART3
#define FLPROG_NEED_CREATE_UART3
#define FLPROG_UART3_RX PA11
#define FLPROG_UART3_TX PA10
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_BLUEBUTTON_F103RCT) 
#define FLPROG_CORE_NAME "BLUEBUTTON F103RCT"
#define FLPROG_CORE_CODE 335
#define FLPROG_CORE_BLUEBUTTON_F103RCT
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F1
#define FLPROG_CORE_STM32_F103

#define FLPROG_I2CSPEED 400000UL
#define FLPROG_I2C1_SDA PB11
#define FLPROG_I2C1_SCL PB10

#define FLPROG_HAS_UART1

#define FLPROG_HAS_UART2
#define FLPROG_NEED_CREATE_UART2
#define FLPROG_UART2_RX PA3
#define FLPROG_UART2_TX PA2

#define FLPROG_HAS_UART3
#define FLPROG_NEED_CREATE_UART3
#define FLPROG_UART3_RX PA11
#define FLPROG_UART3_TX PA10
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_BLUEBUTTON_F103RET) 
#define FLPROG_CORE_NAME "BLUEBUTTON F103RET"
#define FLPROG_CORE_CODE 336
#define FLPROG_CORE_BLUEBUTTON_F103RET
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F1
#define FLPROG_CORE_STM32_F103

#define FLPROG_I2CSPEED 400000UL
#define FLPROG_I2C1_SDA PB11
#define FLPROG_I2C1_SCL PB10

#define FLPROG_HAS_UART1

#define FLPROG_HAS_UART2
#define FLPROG_NEED_CREATE_UART2
#define FLPROG_UART2_RX PA3
#define FLPROG_UART2_TX PA2

#define FLPROG_HAS_UART3
#define FLPROG_NEED_CREATE_UART3
#define FLPROG_UART3_RX PA11
#define FLPROG_UART3_TX PA10
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_BLUEPILL_F103C6) 
#define FLPROG_CORE_NAME "BLUEPILL F103C6"
#define FLPROG_CORE_CODE 337
#define FLPROG_CORE_BLUEPILL_F103C6
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F1
#define FLPROG_CORE_STM32_F103

#define FLPROG_I2CSPEED 400000UL
#define FLPROG_I2C1_SDA PB11
#define FLPROG_I2C1_SCL PB10

#define FLPROG_HAS_UART1

#define FLPROG_HAS_UART2
#define FLPROG_NEED_CREATE_UART2
#define FLPROG_UART2_RX PA3
#define FLPROG_UART2_TX PA2

#define FLPROG_HAS_UART3
#define FLPROG_NEED_CREATE_UART3
#define FLPROG_UART3_RX PA11
#define FLPROG_UART3_TX PA10
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_BLUEPILL_F103C8) 
#define FLPROG_CORE_NAME "BLUEPILL F103C8"
#define FLPROG_CORE_CODE 338
#define FLPROG_CORE_BLUEPILL_F103C8
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F1
#define FLPROG_CORE_STM32_F103

#define FLPROG_I2CSPEED 400000UL
#define FLPROG_I2C1_SDA PB11
#define FLPROG_I2C1_SCL PB10

#define FLPROG_HAS_UART1

#define FLPROG_HAS_UART2
#define FLPROG_NEED_CREATE_UART2
#define FLPROG_UART2_RX PA3
#define FLPROG_UART2_TX PA2

#define FLPROG_HAS_UART3
#define FLPROG_NEED_CREATE_UART3
#define FLPROG_UART3_RX PA11
#define FLPROG_UART3_TX PA10
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F103C4TX) 
#define FLPROG_CORE_NAME "GENERIC F103C4TX"
#define FLPROG_CORE_CODE 497
#define FLPROG_CORE_GENERIC_F103C4TX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F1
#define FLPROG_CORE_STM32_F103

#define FLPROG_I2CSPEED 400000UL
#define FLPROG_I2C1_SDA PB11
#define FLPROG_I2C1_SCL PB10

#define FLPROG_HAS_UART1

#define FLPROG_HAS_UART2
#define FLPROG_NEED_CREATE_UART2
#define FLPROG_UART2_RX PA3
#define FLPROG_UART2_TX PA2

#define FLPROG_HAS_UART3
#define FLPROG_NEED_CREATE_UART3
#define FLPROG_UART3_RX PA11
#define FLPROG_UART3_TX PA10
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F103C6TX) 
#define FLPROG_CORE_NAME "GENERIC F103C6TX"
#define FLPROG_CORE_CODE 498
#define FLPROG_CORE_GENERIC_F103C6TX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F1
#define FLPROG_CORE_STM32_F103

#define FLPROG_I2CSPEED 400000UL
#define FLPROG_I2C1_SDA PB11
#define FLPROG_I2C1_SCL PB10

#define FLPROG_HAS_UART1

#define FLPROG_HAS_UART2
#define FLPROG_NEED_CREATE_UART2
#define FLPROG_UART2_RX PA3
#define FLPROG_UART2_TX PA2

#define FLPROG_HAS_UART3
#define FLPROG_NEED_CREATE_UART3
#define FLPROG_UART3_RX PA11
#define FLPROG_UART3_TX PA10
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F103C6UX) 
#define FLPROG_CORE_NAME "GENERIC F103C6UX"
#define FLPROG_CORE_CODE 499
#define FLPROG_CORE_GENERIC_F103C6UX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F1
#define FLPROG_CORE_STM32_F103

#define FLPROG_I2CSPEED 400000UL
#define FLPROG_I2C1_SDA PB11
#define FLPROG_I2C1_SCL PB10

#define FLPROG_HAS_UART1

#define FLPROG_HAS_UART2
#define FLPROG_NEED_CREATE_UART2
#define FLPROG_UART2_RX PA3
#define FLPROG_UART2_TX PA2

