Totuin/Flprog_Utilites/src/selectCore/flprogSelectCore_stm32.h
#define FLPROG_HAS_UART3
#define FLPROG_NEED_CREATE_UART3
#define FLPROG_UART3_RX PA11
#define FLPROG_UART3_TX PA10
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_STORM32_V1_31_RC) 
#define FLPROG_CORE_NAME "STORM32 V1 31 RC"
#define FLPROG_CORE_CODE 1449
#define FLPROG_CORE_STORM32_V1_31_RC
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F1
#define FLPROG_CORE_STM32_F103

#define FLPROG_I2CSPEED 400000UL
#define FLPROG_I2C1_SDA PB11
#define FLPROG_I2C1_SCL PB10

#define FLPROG_HAS_UART1

#define FLPROG_HAS_UART2
#define FLPROG_NEED_CREATE_UART2
#define FLPROG_UART2_RX PA3
#define FLPROG_UART2_TX PA2

#define FLPROG_HAS_UART3
#define FLPROG_NEED_CREATE_UART3
#define FLPROG_UART3_RX PA11
#define FLPROG_UART3_TX PA10
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_VCCGND_F103ZET6) 
#define FLPROG_CORE_NAME "VCCGND F103ZET6"
#define FLPROG_CORE_CODE 1454
#define FLPROG_CORE_VCCGND_F103ZET6
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F1
#define FLPROG_CORE_STM32_F103

#define FLPROG_I2CSPEED 400000UL
#define FLPROG_I2C1_SDA PB11
#define FLPROG_I2C1_SCL PB10

#define FLPROG_HAS_UART1

#define FLPROG_HAS_UART2
#define FLPROG_NEED_CREATE_UART2
#define FLPROG_UART2_RX PA3
#define FLPROG_UART2_TX PA2

#define FLPROG_HAS_UART3
#define FLPROG_NEED_CREATE_UART3
#define FLPROG_UART3_RX PA11
#define FLPROG_UART3_TX PA10
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_VCCGND_F103ZET6_MINI) 
#define FLPROG_CORE_NAME "VCCGND F103ZET6 MINI"
#define FLPROG_CORE_CODE 1455
#define FLPROG_CORE_VCCGND_F103ZET6_MINI
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F1
#define FLPROG_CORE_STM32_F103

#define FLPROG_I2CSPEED 400000UL
#define FLPROG_I2C1_SDA PB11
#define FLPROG_I2C1_SCL PB10

#define FLPROG_HAS_UART1

#define FLPROG_HAS_UART2
#define FLPROG_NEED_CREATE_UART2
#define FLPROG_UART2_RX PA3
#define FLPROG_UART2_TX PA2

#define FLPROG_HAS_UART3
#define FLPROG_NEED_CREATE_UART3
#define FLPROG_UART3_RX PA11
#define FLPROG_UART3_TX PA10
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F205RBTX) 
#define FLPROG_CORE_NAME "GENERIC F205RBTX"
#define FLPROG_CORE_CODE 546
#define FLPROG_CORE_GENERIC_F205RBTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F2
#define FLPROG_CORE_STM32_F205
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F205RCTX) 
#define FLPROG_CORE_NAME "GENERIC F205RCTX"
#define FLPROG_CORE_CODE 547
#define FLPROG_CORE_GENERIC_F205RCTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F2
#define FLPROG_CORE_STM32_F205
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F205RETX) 
#define FLPROG_CORE_NAME "GENERIC F205RETX"
#define FLPROG_CORE_CODE 548
#define FLPROG_CORE_GENERIC_F205RETX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F2
#define FLPROG_CORE_STM32_F205
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F205REYX) 
#define FLPROG_CORE_NAME "GENERIC F205REYX"
#define FLPROG_CORE_CODE 549
#define FLPROG_CORE_GENERIC_F205REYX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F2
#define FLPROG_CORE_STM32_F205
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F205RFTX) 
#define FLPROG_CORE_NAME "GENERIC F205RFTX"
#define FLPROG_CORE_CODE 550
#define FLPROG_CORE_GENERIC_F205RFTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F2
#define FLPROG_CORE_STM32_F205
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F205RGEX) 
#define FLPROG_CORE_NAME "GENERIC F205RGEX"
#define FLPROG_CORE_CODE 551
#define FLPROG_CORE_GENERIC_F205RGEX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F2
#define FLPROG_CORE_STM32_F205
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F205RGTX) 
#define FLPROG_CORE_NAME "GENERIC F205RGTX"
#define FLPROG_CORE_CODE 552
#define FLPROG_CORE_GENERIC_F205RGTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F2
#define FLPROG_CORE_STM32_F205
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F205RGYX) 
#define FLPROG_CORE_NAME "GENERIC F205RGYX"
#define FLPROG_CORE_CODE 553
#define FLPROG_CORE_GENERIC_F205RGYX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F2
#define FLPROG_CORE_STM32_F205
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F205VBTX) 
#define FLPROG_CORE_NAME "GENERIC F205VBTX"
#define FLPROG_CORE_CODE 554
#define FLPROG_CORE_GENERIC_F205VBTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F2
#define FLPROG_CORE_STM32_F205
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F205VCTX) 
#define FLPROG_CORE_NAME "GENERIC F205VCTX"
#define FLPROG_CORE_CODE 555
#define FLPROG_CORE_GENERIC_F205VCTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F2
#define FLPROG_CORE_STM32_F205
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F205VETX) 
#define FLPROG_CORE_NAME "GENERIC F205VETX"
#define FLPROG_CORE_CODE 556
#define FLPROG_CORE_GENERIC_F205VETX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F2
#define FLPROG_CORE_STM32_F205
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F205VFTX) 
#define FLPROG_CORE_NAME "GENERIC F205VFTX"
#define FLPROG_CORE_CODE 557
#define FLPROG_CORE_GENERIC_F205VFTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F2
#define FLPROG_CORE_STM32_F205
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F205VGTX) 
#define FLPROG_CORE_NAME "GENERIC F205VGTX"
#define FLPROG_CORE_CODE 558
#define FLPROG_CORE_GENERIC_F205VGTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F2
#define FLPROG_CORE_STM32_F205
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F205ZCTX) 
#define FLPROG_CORE_NAME "GENERIC F205ZCTX"
#define FLPROG_CORE_CODE 559
#define FLPROG_CORE_GENERIC_F205ZCTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F2
#define FLPROG_CORE_STM32_F205
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F205ZETX) 
#define FLPROG_CORE_NAME "GENERIC F205ZETX"
#define FLPROG_CORE_CODE 560
#define FLPROG_CORE_GENERIC_F205ZETX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F2
#define FLPROG_CORE_STM32_F205
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F205ZFTX) 
#define FLPROG_CORE_NAME "GENERIC F205ZFTX"
#define FLPROG_CORE_CODE 561
#define FLPROG_CORE_GENERIC_F205ZFTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F2
#define FLPROG_CORE_STM32_F205
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F205ZGTX) 
#define FLPROG_CORE_NAME "GENERIC F205ZGTX"
#define FLPROG_CORE_CODE 562
#define FLPROG_CORE_GENERIC_F205ZGTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F2
#define FLPROG_CORE_STM32_F205
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F207ICHX) 
#define FLPROG_CORE_NAME "GENERIC F207ICHX"
#define FLPROG_CORE_CODE 563
#define FLPROG_CORE_GENERIC_F207ICHX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F2
#define FLPROG_CORE_STM32_F207
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F207ICTX) 
#define FLPROG_CORE_NAME "GENERIC F207ICTX"
#define FLPROG_CORE_CODE 564
#define FLPROG_CORE_GENERIC_F207ICTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F2
#define FLPROG_CORE_STM32_F207
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F207IEHX) 
#define FLPROG_CORE_NAME "GENERIC F207IEHX"
#define FLPROG_CORE_CODE 565
#define FLPROG_CORE_GENERIC_F207IEHX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F2
#define FLPROG_CORE_STM32_F207
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F207IETX) 
#define FLPROG_CORE_NAME "GENERIC F207IETX"
#define FLPROG_CORE_CODE 566
#define FLPROG_CORE_GENERIC_F207IETX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F2
#define FLPROG_CORE_STM32_F207
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F207IFHX) 
#define FLPROG_CORE_NAME "GENERIC F207IFHX"
#define FLPROG_CORE_CODE 567
#define FLPROG_CORE_GENERIC_F207IFHX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F2
#define FLPROG_CORE_STM32_F207
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F207IFTX) 
#define FLPROG_CORE_NAME "GENERIC F207IFTX"
#define FLPROG_CORE_CODE 568
#define FLPROG_CORE_GENERIC_F207IFTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F2
#define FLPROG_CORE_STM32_F207
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F207IGHX) 
#define FLPROG_CORE_NAME "GENERIC F207IGHX"
#define FLPROG_CORE_CODE 569
#define FLPROG_CORE_GENERIC_F207IGHX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F2
#define FLPROG_CORE_STM32_F207
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F207IGTX) 
#define FLPROG_CORE_NAME "GENERIC F207IGTX"
#define FLPROG_CORE_CODE 570
#define FLPROG_CORE_GENERIC_F207IGTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F2
#define FLPROG_CORE_STM32_F207
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F207VCTX) 
#define FLPROG_CORE_NAME "GENERIC F207VCTX"
#define FLPROG_CORE_CODE 571
#define FLPROG_CORE_GENERIC_F207VCTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F2
#define FLPROG_CORE_STM32_F207
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F207VETX) 
#define FLPROG_CORE_NAME "GENERIC F207VETX"
#define FLPROG_CORE_CODE 572
#define FLPROG_CORE_GENERIC_F207VETX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F2
#define FLPROG_CORE_STM32_F207
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F207VFTX) 
#define FLPROG_CORE_NAME "GENERIC F207VFTX"
#define FLPROG_CORE_CODE 573
#define FLPROG_CORE_GENERIC_F207VFTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F2
#define FLPROG_CORE_STM32_F207
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F207VGTX) 
#define FLPROG_CORE_NAME "GENERIC F207VGTX"
#define FLPROG_CORE_CODE 574
#define FLPROG_CORE_GENERIC_F207VGTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F2
#define FLPROG_CORE_STM32_F207
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F207ZCTX) 
#define FLPROG_CORE_NAME "GENERIC F207ZCTX"
#define FLPROG_CORE_CODE 575
#define FLPROG_CORE_GENERIC_F207ZCTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F2
#define FLPROG_CORE_STM32_F207
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F207ZETX) 
#define FLPROG_CORE_NAME "GENERIC F207ZETX"
#define FLPROG_CORE_CODE 576
#define FLPROG_CORE_GENERIC_F207ZETX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F2
#define FLPROG_CORE_STM32_F207
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F207ZFTX) 
#define FLPROG_CORE_NAME "GENERIC F207ZFTX"
#define FLPROG_CORE_CODE 577
#define FLPROG_CORE_GENERIC_F207ZFTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F2
#define FLPROG_CORE_STM32_F207
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F207ZGTX) 
#define FLPROG_CORE_NAME "GENERIC F207ZGTX"
#define FLPROG_CORE_CODE 578
#define FLPROG_CORE_GENERIC_F207ZGTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F2
#define FLPROG_CORE_STM32_F207
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_NUCLEO_F207ZG) 
#define FLPROG_CORE_NAME "NUCLEO F207ZG"
#define FLPROG_CORE_CODE 1383
#define FLPROG_CORE_NUCLEO_F207ZG
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F2
#define FLPROG_CORE_STM32_F207
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F215RETX) 
#define FLPROG_CORE_NAME "GENERIC F215RETX"
#define FLPROG_CORE_CODE 579
#define FLPROG_CORE_GENERIC_F215RETX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F2
#define FLPROG_CORE_STM32_F215
#endif
