Totuin/Flprog_Utilites/src/selectCore/flprogSelectCore_stm32.h
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F215RGTX) 
#define FLPROG_CORE_NAME "GENERIC F215RGTX"
#define FLPROG_CORE_CODE 580
#define FLPROG_CORE_GENERIC_F215RGTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F2
#define FLPROG_CORE_STM32_F215
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F215VETX) 
#define FLPROG_CORE_NAME "GENERIC F215VETX"
#define FLPROG_CORE_CODE 581
#define FLPROG_CORE_GENERIC_F215VETX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F2
#define FLPROG_CORE_STM32_F215
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F215VGTX) 
#define FLPROG_CORE_NAME "GENERIC F215VGTX"
#define FLPROG_CORE_CODE 582
#define FLPROG_CORE_GENERIC_F215VGTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F2
#define FLPROG_CORE_STM32_F215
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F215ZETX) 
#define FLPROG_CORE_NAME "GENERIC F215ZETX"
#define FLPROG_CORE_CODE 583
#define FLPROG_CORE_GENERIC_F215ZETX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F2
#define FLPROG_CORE_STM32_F215
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F215ZGTX) 
#define FLPROG_CORE_NAME "GENERIC F215ZGTX"
#define FLPROG_CORE_CODE 584
#define FLPROG_CORE_GENERIC_F215ZGTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F2
#define FLPROG_CORE_STM32_F215
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F217IEHX) 
#define FLPROG_CORE_NAME "GENERIC F217IEHX"
#define FLPROG_CORE_CODE 585
#define FLPROG_CORE_GENERIC_F217IEHX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F2
#define FLPROG_CORE_STM32_F217
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F217IETX) 
#define FLPROG_CORE_NAME "GENERIC F217IETX"
#define FLPROG_CORE_CODE 586
#define FLPROG_CORE_GENERIC_F217IETX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F2
#define FLPROG_CORE_STM32_F217
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F217IGHX) 
#define FLPROG_CORE_NAME "GENERIC F217IGHX"
#define FLPROG_CORE_CODE 587
#define FLPROG_CORE_GENERIC_F217IGHX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F2
#define FLPROG_CORE_STM32_F217
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F217IGTX) 
#define FLPROG_CORE_NAME "GENERIC F217IGTX"
#define FLPROG_CORE_CODE 588
#define FLPROG_CORE_GENERIC_F217IGTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F2
#define FLPROG_CORE_STM32_F217
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F217VETX) 
#define FLPROG_CORE_NAME "GENERIC F217VETX"
#define FLPROG_CORE_CODE 589
#define FLPROG_CORE_GENERIC_F217VETX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F2
#define FLPROG_CORE_STM32_F217
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F217VGTX) 
#define FLPROG_CORE_NAME "GENERIC F217VGTX"
#define FLPROG_CORE_CODE 590
#define FLPROG_CORE_GENERIC_F217VGTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F2
#define FLPROG_CORE_STM32_F217
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F217ZETX) 
#define FLPROG_CORE_NAME "GENERIC F217ZETX"
#define FLPROG_CORE_CODE 591
#define FLPROG_CORE_GENERIC_F217ZETX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F2
#define FLPROG_CORE_STM32_F217
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F217ZGTX) 
#define FLPROG_CORE_NAME "GENERIC F217ZGTX"
#define FLPROG_CORE_CODE 592
#define FLPROG_CORE_GENERIC_F217ZGTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F2
#define FLPROG_CORE_STM32_F217
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F301C6TX) 
#define FLPROG_CORE_NAME "GENERIC F301C6TX"
#define FLPROG_CORE_CODE 593
#define FLPROG_CORE_GENERIC_F301C6TX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F3
#define FLPROG_CORE_STM32_F301
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F301C8TX) 
#define FLPROG_CORE_NAME "GENERIC F301C8TX"
#define FLPROG_CORE_CODE 594
#define FLPROG_CORE_GENERIC_F301C8TX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F3
#define FLPROG_CORE_STM32_F301
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F301C8YX) 
#define FLPROG_CORE_NAME "GENERIC F301C8YX"
#define FLPROG_CORE_CODE 595
#define FLPROG_CORE_GENERIC_F301C8YX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F3
#define FLPROG_CORE_STM32_F301
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F301K6TX) 
#define FLPROG_CORE_NAME "GENERIC F301K6TX"
#define FLPROG_CORE_CODE 596
#define FLPROG_CORE_GENERIC_F301K6TX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F3
#define FLPROG_CORE_STM32_F301
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F301K8TX) 
#define FLPROG_CORE_NAME "GENERIC F301K8TX"
#define FLPROG_CORE_CODE 597
#define FLPROG_CORE_GENERIC_F301K8TX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F3
#define FLPROG_CORE_STM32_F301
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F301R6TX) 
#define FLPROG_CORE_NAME "GENERIC F301R6TX"
#define FLPROG_CORE_CODE 598
#define FLPROG_CORE_GENERIC_F301R6TX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F3
#define FLPROG_CORE_STM32_F301
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F301R8TX) 
#define FLPROG_CORE_NAME "GENERIC F301R8TX"
#define FLPROG_CORE_CODE 599
#define FLPROG_CORE_GENERIC_F301R8TX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F3
#define FLPROG_CORE_STM32_F301
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F302R6TX) 
#define FLPROG_CORE_NAME "GENERIC F302R6TX"
#define FLPROG_CORE_CODE 600
#define FLPROG_CORE_GENERIC_F302R6TX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F3
#define FLPROG_CORE_STM32_F302
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F302R8TX) 
#define FLPROG_CORE_NAME "GENERIC F302R8TX"
#define FLPROG_CORE_CODE 601
#define FLPROG_CORE_GENERIC_F302R8TX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F3
#define FLPROG_CORE_STM32_F302
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_NUCLEO_F302R8) 
#define FLPROG_CORE_NAME "NUCLEO F302R8"
#define FLPROG_CORE_CODE 1384
#define FLPROG_CORE_NUCLEO_F302R8
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F3
#define FLPROG_CORE_STM32_F302
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_BLACKPILL_F303CC) 
#define FLPROG_CORE_NAME "BLACKPILL F303CC"
#define FLPROG_CORE_CODE 325
#define FLPROG_CORE_BLACKPILL_F303CC
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F3
#define FLPROG_CORE_STM32_F303
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_DISCO_F303VC) 
#define FLPROG_CORE_NAME "DISCO F303VC"
#define FLPROG_CORE_CODE 356
#define FLPROG_CORE_DISCO_F303VC
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F3
#define FLPROG_CORE_STM32_F303
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F303C6TX) 
#define FLPROG_CORE_NAME "GENERIC F303C6TX"
#define FLPROG_CORE_CODE 602
#define FLPROG_CORE_GENERIC_F303C6TX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F3
#define FLPROG_CORE_STM32_F303
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F303C8TX) 
#define FLPROG_CORE_NAME "GENERIC F303C8TX"
#define FLPROG_CORE_CODE 603
#define FLPROG_CORE_GENERIC_F303C8TX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F3
#define FLPROG_CORE_STM32_F303
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F303CBTX) 
#define FLPROG_CORE_NAME "GENERIC F303CBTX"
#define FLPROG_CORE_CODE 604
#define FLPROG_CORE_GENERIC_F303CBTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F3
#define FLPROG_CORE_STM32_F303
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F303CCTX) 
#define FLPROG_CORE_NAME "GENERIC F303CCTX"
#define FLPROG_CORE_CODE 605
#define FLPROG_CORE_GENERIC_F303CCTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F3
#define FLPROG_CORE_STM32_F303
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F303K6TX) 
#define FLPROG_CORE_NAME "GENERIC F303K6TX"
#define FLPROG_CORE_CODE 606
#define FLPROG_CORE_GENERIC_F303K6TX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F3
#define FLPROG_CORE_STM32_F303
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F303K8TX) 
#define FLPROG_CORE_NAME "GENERIC F303K8TX"
#define FLPROG_CORE_CODE 607
#define FLPROG_CORE_GENERIC_F303K8TX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F3
#define FLPROG_CORE_STM32_F303
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F303R6TX) 
#define FLPROG_CORE_NAME "GENERIC F303R6TX"
#define FLPROG_CORE_CODE 608
#define FLPROG_CORE_GENERIC_F303R6TX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F3
#define FLPROG_CORE_STM32_F303
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F303R8TX) 
#define FLPROG_CORE_NAME "GENERIC F303R8TX"
#define FLPROG_CORE_CODE 609
#define FLPROG_CORE_GENERIC_F303R8TX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F3
#define FLPROG_CORE_STM32_F303
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F303RBTX) 
#define FLPROG_CORE_NAME "GENERIC F303RBTX"
#define FLPROG_CORE_CODE 610
#define FLPROG_CORE_GENERIC_F303RBTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F3
#define FLPROG_CORE_STM32_F303
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F303RCTX) 
#define FLPROG_CORE_NAME "GENERIC F303RCTX"
#define FLPROG_CORE_CODE 611
#define FLPROG_CORE_GENERIC_F303RCTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F3
#define FLPROG_CORE_STM32_F303
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F303RDTX) 
#define FLPROG_CORE_NAME "GENERIC F303RDTX"
#define FLPROG_CORE_CODE 612
#define FLPROG_CORE_GENERIC_F303RDTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F3
#define FLPROG_CORE_STM32_F303
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F303RETX) 
#define FLPROG_CORE_NAME "GENERIC F303RETX"
#define FLPROG_CORE_CODE 613
#define FLPROG_CORE_GENERIC_F303RETX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F3
#define FLPROG_CORE_STM32_F303
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F303VBTX) 
#define FLPROG_CORE_NAME "GENERIC F303VBTX"
#define FLPROG_CORE_CODE 614
#define FLPROG_CORE_GENERIC_F303VBTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F3
#define FLPROG_CORE_STM32_F303
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F303VCTX) 
#define FLPROG_CORE_NAME "GENERIC F303VCTX"
#define FLPROG_CORE_CODE 615
#define FLPROG_CORE_GENERIC_F303VCTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F3
#define FLPROG_CORE_STM32_F303
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_NUCLEO_F303K8) 
#define FLPROG_CORE_NAME "NUCLEO F303K8"
#define FLPROG_CORE_CODE 1385
#define FLPROG_CORE_NUCLEO_F303K8
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F3
#define FLPROG_CORE_STM32_F303
#endif
