Totuin/Flprog_Utilites/src/selectCore/flprogSelectCore_stm32.h
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_NUCLEO_F303RE) 
#define FLPROG_CORE_NAME "NUCLEO F303RE"
#define FLPROG_CORE_CODE 1386
#define FLPROG_CORE_NUCLEO_F303RE
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F3
#define FLPROG_CORE_STM32_F303
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_OLIMEXINO_STM32F3) 
#define FLPROG_CORE_NAME "OLIMEXINO STM32F3"
#define FLPROG_CORE_CODE 1427
#define FLPROG_CORE_OLIMEXINO_STM32F3
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F3
#define FLPROG_CORE_STM32_F303
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_SPARKY_F303CC) 
#define FLPROG_CORE_NAME "SPARKY F303CC"
#define FLPROG_CORE_CODE 1441
#define FLPROG_CORE_SPARKY_F303CC
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F3
#define FLPROG_CORE_STM32_F303
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F318C8TX) 
#define FLPROG_CORE_NAME "GENERIC F318C8TX"
#define FLPROG_CORE_CODE 616
#define FLPROG_CORE_GENERIC_F318C8TX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F3
#define FLPROG_CORE_STM32_F318
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F318C8YX) 
#define FLPROG_CORE_NAME "GENERIC F318C8YX"
#define FLPROG_CORE_CODE 617
#define FLPROG_CORE_GENERIC_F318C8YX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F3
#define FLPROG_CORE_STM32_F318
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F318K8UX) 
#define FLPROG_CORE_NAME "GENERIC F318K8UX"
#define FLPROG_CORE_CODE 618
#define FLPROG_CORE_GENERIC_F318K8UX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F3
#define FLPROG_CORE_STM32_F318
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F328C8TX) 
#define FLPROG_CORE_NAME "GENERIC F328C8TX"
#define FLPROG_CORE_CODE 619
#define FLPROG_CORE_GENERIC_F328C8TX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F3
#define FLPROG_CORE_STM32_F328
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F334C4TX) 
#define FLPROG_CORE_NAME "GENERIC F334C4TX"
#define FLPROG_CORE_CODE 620
#define FLPROG_CORE_GENERIC_F334C4TX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F3
#define FLPROG_CORE_STM32_F334
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F334C6TX) 
#define FLPROG_CORE_NAME "GENERIC F334C6TX"
#define FLPROG_CORE_CODE 621
#define FLPROG_CORE_GENERIC_F334C6TX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F3
#define FLPROG_CORE_STM32_F334
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F334C8TX) 
#define FLPROG_CORE_NAME "GENERIC F334C8TX"
#define FLPROG_CORE_CODE 622
#define FLPROG_CORE_GENERIC_F334C8TX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F3
#define FLPROG_CORE_STM32_F334
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F334K4TX) 
#define FLPROG_CORE_NAME "GENERIC F334K4TX"
#define FLPROG_CORE_CODE 623
#define FLPROG_CORE_GENERIC_F334K4TX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F3
#define FLPROG_CORE_STM32_F334
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F334K6TX) 
#define FLPROG_CORE_NAME "GENERIC F334K6TX"
#define FLPROG_CORE_CODE 624
#define FLPROG_CORE_GENERIC_F334K6TX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F3
#define FLPROG_CORE_STM32_F334
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F334K8TX) 
#define FLPROG_CORE_NAME "GENERIC F334K8TX"
#define FLPROG_CORE_CODE 625
#define FLPROG_CORE_GENERIC_F334K8TX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F3
#define FLPROG_CORE_STM32_F334
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F334R6TX) 
#define FLPROG_CORE_NAME "GENERIC F334R6TX"
#define FLPROG_CORE_CODE 626
#define FLPROG_CORE_GENERIC_F334R6TX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F3
#define FLPROG_CORE_STM32_F334
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F334R8TX) 
#define FLPROG_CORE_NAME "GENERIC F334R8TX"
#define FLPROG_CORE_CODE 627
#define FLPROG_CORE_GENERIC_F334R8TX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F3
#define FLPROG_CORE_STM32_F334
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F358CCTX) 
#define FLPROG_CORE_NAME "GENERIC F358CCTX"
#define FLPROG_CORE_CODE 628
#define FLPROG_CORE_GENERIC_F358CCTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F3
#define FLPROG_CORE_STM32_F358
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F358RCTX) 
#define FLPROG_CORE_NAME "GENERIC F358RCTX"
#define FLPROG_CORE_CODE 629
#define FLPROG_CORE_GENERIC_F358RCTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F3
#define FLPROG_CORE_STM32_F358
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F358VCTX) 
#define FLPROG_CORE_NAME "GENERIC F358VCTX"
#define FLPROG_CORE_CODE 630
#define FLPROG_CORE_GENERIC_F358VCTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F3
#define FLPROG_CORE_STM32_F358
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F378CCTX) 
#define FLPROG_CORE_NAME "GENERIC F378CCTX"
#define FLPROG_CORE_CODE 631
#define FLPROG_CORE_GENERIC_F378CCTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F3
#define FLPROG_CORE_STM32_F378
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F378RCTX) 
#define FLPROG_CORE_NAME "GENERIC F378RCTX"
#define FLPROG_CORE_CODE 632
#define FLPROG_CORE_GENERIC_F378RCTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F3
#define FLPROG_CORE_STM32_F378
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F378RCYX) 
#define FLPROG_CORE_NAME "GENERIC F378RCYX"
#define FLPROG_CORE_CODE 633
#define FLPROG_CORE_GENERIC_F378RCYX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F3
#define FLPROG_CORE_STM32_F378
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F378VCHX) 
#define FLPROG_CORE_NAME "GENERIC F378VCHX"
#define FLPROG_CORE_CODE 634
#define FLPROG_CORE_GENERIC_F378VCHX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F3
#define FLPROG_CORE_STM32_F378
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F378VCTX) 
#define FLPROG_CORE_NAME "GENERIC F378VCTX"
#define FLPROG_CORE_CODE 635
#define FLPROG_CORE_GENERIC_F378VCTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F3
#define FLPROG_CORE_STM32_F378
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F398VETX) 
#define FLPROG_CORE_NAME "GENERIC F398VETX"
#define FLPROG_CORE_CODE 636
#define FLPROG_CORE_GENERIC_F398VETX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F3
#define FLPROG_CORE_STM32_F398
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_FEATHER_F405) 
#define FLPROG_CORE_NAME "FEATHER F405"
#define FLPROG_CORE_CODE 372
#define FLPROG_CORE_FEATHER_F405
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F4
#define FLPROG_I2C0_SDA PB8
#define FLPROG_I2C1_SCL PB9

#define FLPROG_HAS_I2C1
#define FLPROG_NEED_CREATE_I2C1
#define FLPROG_I2C1_SDA PB11
#define FLPROG_I2C1_SCL PB10
#define FLPROG_CORE_STM32_F405
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F405RGTX) 
#define FLPROG_CORE_NAME "GENERIC F405RGTX"
#define FLPROG_CORE_CODE 654
#define FLPROG_CORE_GENERIC_F405RGTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F4
#define FLPROG_I2C0_SDA PB8
#define FLPROG_I2C1_SCL PB9

#define FLPROG_HAS_I2C1
#define FLPROG_NEED_CREATE_I2C1
#define FLPROG_I2C1_SDA PB11
#define FLPROG_I2C1_SCL PB10
#define FLPROG_CORE_STM32_F405
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_ARMED_V1) 
#define FLPROG_CORE_NAME "ARMED V1"
#define FLPROG_CORE_CODE 322
#define FLPROG_CORE_ARMED_V1
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F4
#define FLPROG_I2C0_SDA PB8
#define FLPROG_I2C1_SCL PB9

#define FLPROG_HAS_I2C1
#define FLPROG_NEED_CREATE_I2C1
#define FLPROG_I2C1_SDA PB11
#define FLPROG_I2C1_SCL PB10
#define FLPROG_CORE_STM32_F407

#define FLPROG_HAS_UART1
#define FLPROG_NEED_CREATE_UART1
#define FLPROG_UART1_RX PA10
#define FLPROG_UART1_TX PA9

#define FLPROG_HAS_UART2
#define FLPROG_NEED_CREATE_UART2
#define FLPROG_UART2_RX PA3
#define FLPROG_UART2_TX PA2

#define FLPROG_HAS_UART3
#define FLPROG_NEED_CREATE_UART3
#define FLPROG_UART3_RX PD9
#define FLPROG_UART3_TX PD8

