Totuin/Flprog_Utilites/src/selectCore/flprogSelectCore_stm32.h
#define FLPROG_HAS_UART6
#define FLPROG_NEED_CREATE_UART6
#define FLPROG_UART6_RX PC7
#define FLPROG_UART6_TX PC6
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_PRNTR_V2) 
#define FLPROG_CORE_NAME "PRNTR V2"
#define FLPROG_CORE_CODE 1429
#define FLPROG_CORE_PRNTR_V2
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F4
#define FLPROG_I2C0_SDA PB8
#define FLPROG_I2C1_SCL PB9

#define FLPROG_HAS_I2C1
#define FLPROG_NEED_CREATE_I2C1
#define FLPROG_I2C1_SDA PB11
#define FLPROG_I2C1_SCL PB10
#define FLPROG_CORE_STM32_F407

#define FLPROG_HAS_UART1
#define FLPROG_NEED_CREATE_UART1
#define FLPROG_UART1_RX PA10
#define FLPROG_UART1_TX PA9

#define FLPROG_HAS_UART2
#define FLPROG_NEED_CREATE_UART2
#define FLPROG_UART2_RX PA3
#define FLPROG_UART2_TX PA2

#define FLPROG_HAS_UART3
#define FLPROG_NEED_CREATE_UART3
#define FLPROG_UART3_RX PD9
#define FLPROG_UART3_TX PD8

#define FLPROG_HAS_UART4
#define FLPROG_NEED_CREATE_UART4  
#define FLPROG_UART4_RX PC11
#define FLPROG_UART4_TX PC10

#define FLPROG_HAS_UART5
#define FLPROG_NEED_CREATE_UART5
#define FLPROG_UART5_RX PD2
#define FLPROG_UART5_TX PC12

#define FLPROG_HAS_UART6
#define FLPROG_NEED_CREATE_UART6
#define FLPROG_UART6_RX PC7
#define FLPROG_UART6_TX PC6
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_VCCGND_F407ZG_MINI) 
#define FLPROG_CORE_NAME "VCCGND F407ZG MINI"
#define FLPROG_CORE_CODE 1456
#define FLPROG_CORE_VCCGND_F407ZG_MINI
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F4
#define FLPROG_I2C0_SDA PB8
#define FLPROG_I2C1_SCL PB9

#define FLPROG_HAS_I2C1
#define FLPROG_NEED_CREATE_I2C1
#define FLPROG_I2C1_SDA PB11
#define FLPROG_I2C1_SCL PB10
#define FLPROG_CORE_STM32_F407

#define FLPROG_HAS_UART1
#define FLPROG_NEED_CREATE_UART1
#define FLPROG_UART1_RX PA10
#define FLPROG_UART1_TX PA9

#define FLPROG_HAS_UART2
#define FLPROG_NEED_CREATE_UART2
#define FLPROG_UART2_RX PA3
#define FLPROG_UART2_TX PA2

#define FLPROG_HAS_UART3
#define FLPROG_NEED_CREATE_UART3
#define FLPROG_UART3_RX PD9
#define FLPROG_UART3_TX PD8

#define FLPROG_HAS_UART4
#define FLPROG_NEED_CREATE_UART4  
#define FLPROG_UART4_RX PC11
#define FLPROG_UART4_TX PC10

#define FLPROG_HAS_UART5
#define FLPROG_NEED_CREATE_UART5
#define FLPROG_UART5_RX PD2
#define FLPROG_UART5_TX PC12

#define FLPROG_HAS_UART6
#define FLPROG_NEED_CREATE_UART6
#define FLPROG_UART6_RX PC7
#define FLPROG_UART6_TX PC6
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F410C8TX) 
#define FLPROG_CORE_NAME "GENERIC F410C8TX"
#define FLPROG_CORE_CODE 659
#define FLPROG_CORE_GENERIC_F410C8TX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F4
#define FLPROG_I2C0_SDA PB8
#define FLPROG_I2C1_SCL PB9

#define FLPROG_HAS_I2C1
#define FLPROG_NEED_CREATE_I2C1
#define FLPROG_I2C1_SDA PB11
#define FLPROG_I2C1_SCL PB10
#define FLPROG_CORE_STM32_F410
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F410C8UX) 
#define FLPROG_CORE_NAME "GENERIC F410C8UX"
#define FLPROG_CORE_CODE 660
#define FLPROG_CORE_GENERIC_F410C8UX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F4
#define FLPROG_I2C0_SDA PB8
#define FLPROG_I2C1_SCL PB9

#define FLPROG_HAS_I2C1
#define FLPROG_NEED_CREATE_I2C1
#define FLPROG_I2C1_SDA PB11
#define FLPROG_I2C1_SCL PB10
#define FLPROG_CORE_STM32_F410
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F410CBTX) 
#define FLPROG_CORE_NAME "GENERIC F410CBTX"
#define FLPROG_CORE_CODE 661
#define FLPROG_CORE_GENERIC_F410CBTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F4
#define FLPROG_I2C0_SDA PB8
#define FLPROG_I2C1_SCL PB9

#define FLPROG_HAS_I2C1
#define FLPROG_NEED_CREATE_I2C1
#define FLPROG_I2C1_SDA PB11
#define FLPROG_I2C1_SCL PB10
#define FLPROG_CORE_STM32_F410
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F410CBUX) 
#define FLPROG_CORE_NAME "GENERIC F410CBUX"
#define FLPROG_CORE_CODE 662
#define FLPROG_CORE_GENERIC_F410CBUX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F4
#define FLPROG_I2C0_SDA PB8
#define FLPROG_I2C1_SCL PB9

#define FLPROG_HAS_I2C1
#define FLPROG_NEED_CREATE_I2C1
#define FLPROG_I2C1_SDA PB11
#define FLPROG_I2C1_SCL PB10
#define FLPROG_CORE_STM32_F410
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F410R8IX) 
#define FLPROG_CORE_NAME "GENERIC F410R8IX"
#define FLPROG_CORE_CODE 663
#define FLPROG_CORE_GENERIC_F410R8IX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F4
#define FLPROG_I2C0_SDA PB8
#define FLPROG_I2C1_SCL PB9

#define FLPROG_HAS_I2C1
#define FLPROG_NEED_CREATE_I2C1
#define FLPROG_I2C1_SDA PB11
#define FLPROG_I2C1_SCL PB10
#define FLPROG_CORE_STM32_F410
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F410R8TX) 
#define FLPROG_CORE_NAME "GENERIC F410R8TX"
#define FLPROG_CORE_CODE 664
#define FLPROG_CORE_GENERIC_F410R8TX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F4
#define FLPROG_I2C0_SDA PB8
#define FLPROG_I2C1_SCL PB9

#define FLPROG_HAS_I2C1
#define FLPROG_NEED_CREATE_I2C1
#define FLPROG_I2C1_SDA PB11
#define FLPROG_I2C1_SCL PB10
#define FLPROG_CORE_STM32_F410
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F410RBIX) 
#define FLPROG_CORE_NAME "GENERIC F410RBIX"
#define FLPROG_CORE_CODE 665
#define FLPROG_CORE_GENERIC_F410RBIX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F4
#define FLPROG_I2C0_SDA PB8
#define FLPROG_I2C1_SCL PB9

#define FLPROG_HAS_I2C1
#define FLPROG_NEED_CREATE_I2C1
#define FLPROG_I2C1_SDA PB11
#define FLPROG_I2C1_SCL PB10
#define FLPROG_CORE_STM32_F410
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F410RBTX) 
#define FLPROG_CORE_NAME "GENERIC F410RBTX"
#define FLPROG_CORE_CODE 666
#define FLPROG_CORE_GENERIC_F410RBTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F4
#define FLPROG_I2C0_SDA PB8
#define FLPROG_I2C1_SCL PB9

#define FLPROG_HAS_I2C1
#define FLPROG_NEED_CREATE_I2C1
#define FLPROG_I2C1_SDA PB11
#define FLPROG_I2C1_SCL PB10
#define FLPROG_CORE_STM32_F410
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F410T8YX) 
#define FLPROG_CORE_NAME "GENERIC F410T8YX"
#define FLPROG_CORE_CODE 667
#define FLPROG_CORE_GENERIC_F410T8YX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F4
#define FLPROG_I2C0_SDA PB8
#define FLPROG_I2C1_SCL PB9

#define FLPROG_HAS_I2C1
#define FLPROG_NEED_CREATE_I2C1
#define FLPROG_I2C1_SDA PB11
#define FLPROG_I2C1_SCL PB10
#define FLPROG_CORE_STM32_F410
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F410TBYX) 
#define FLPROG_CORE_NAME "GENERIC F410TBYX"
#define FLPROG_CORE_CODE 668
#define FLPROG_CORE_GENERIC_F410TBYX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F4
#define FLPROG_I2C0_SDA PB8
#define FLPROG_I2C1_SCL PB9

#define FLPROG_HAS_I2C1
#define FLPROG_NEED_CREATE_I2C1
#define FLPROG_I2C1_SDA PB11
#define FLPROG_I2C1_SCL PB10
#define FLPROG_CORE_STM32_F410
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F412CEUX) 
#define FLPROG_CORE_NAME "GENERIC F412CEUX"
#define FLPROG_CORE_CODE 675
#define FLPROG_CORE_GENERIC_F412CEUX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F4
#define FLPROG_I2C0_SDA PB8
#define FLPROG_I2C1_SCL PB9

#define FLPROG_HAS_I2C1
#define FLPROG_NEED_CREATE_I2C1
#define FLPROG_I2C1_SDA PB11
#define FLPROG_I2C1_SCL PB10
#define FLPROG_CORE_STM32_F412
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F412CGUX) 
#define FLPROG_CORE_NAME "GENERIC F412CGUX"
#define FLPROG_CORE_CODE 676
#define FLPROG_CORE_GENERIC_F412CGUX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F4
#define FLPROG_I2C0_SDA PB8
#define FLPROG_I2C1_SCL PB9

#define FLPROG_HAS_I2C1
#define FLPROG_NEED_CREATE_I2C1
#define FLPROG_I2C1_SDA PB11
#define FLPROG_I2C1_SCL PB10
#define FLPROG_CORE_STM32_F412
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F412RETX) 
#define FLPROG_CORE_NAME "GENERIC F412RETX"
#define FLPROG_CORE_CODE 677
#define FLPROG_CORE_GENERIC_F412RETX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F4
#define FLPROG_I2C0_SDA PB8
#define FLPROG_I2C1_SCL PB9

#define FLPROG_HAS_I2C1
#define FLPROG_NEED_CREATE_I2C1
#define FLPROG_I2C1_SDA PB11
#define FLPROG_I2C1_SCL PB10
#define FLPROG_CORE_STM32_F412
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F412REYX) 
#define FLPROG_CORE_NAME "GENERIC F412REYX"
#define FLPROG_CORE_CODE 678
#define FLPROG_CORE_GENERIC_F412REYX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F4
#define FLPROG_I2C0_SDA PB8
#define FLPROG_I2C1_SCL PB9

#define FLPROG_HAS_I2C1
#define FLPROG_NEED_CREATE_I2C1
#define FLPROG_I2C1_SDA PB11
#define FLPROG_I2C1_SCL PB10
#define FLPROG_CORE_STM32_F412
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F412REYXP) 
#define FLPROG_CORE_NAME "GENERIC F412REYXP"
#define FLPROG_CORE_CODE 679
#define FLPROG_CORE_GENERIC_F412REYXP
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F4
#define FLPROG_I2C0_SDA PB8
#define FLPROG_I2C1_SCL PB9

#define FLPROG_HAS_I2C1
#define FLPROG_NEED_CREATE_I2C1
#define FLPROG_I2C1_SDA PB11
#define FLPROG_I2C1_SCL PB10
#define FLPROG_CORE_STM32_F412
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F412RGTX) 
#define FLPROG_CORE_NAME "GENERIC F412RGTX"
#define FLPROG_CORE_CODE 680
#define FLPROG_CORE_GENERIC_F412RGTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F4
#define FLPROG_I2C0_SDA PB8
#define FLPROG_I2C1_SCL PB9

#define FLPROG_HAS_I2C1
#define FLPROG_NEED_CREATE_I2C1
#define FLPROG_I2C1_SDA PB11
#define FLPROG_I2C1_SCL PB10
#define FLPROG_CORE_STM32_F412
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F412RGYX) 
#define FLPROG_CORE_NAME "GENERIC F412RGYX"
#define FLPROG_CORE_CODE 681
#define FLPROG_CORE_GENERIC_F412RGYX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F4
#define FLPROG_I2C0_SDA PB8
#define FLPROG_I2C1_SCL PB9

#define FLPROG_HAS_I2C1
#define FLPROG_NEED_CREATE_I2C1
#define FLPROG_I2C1_SDA PB11
#define FLPROG_I2C1_SCL PB10
#define FLPROG_CORE_STM32_F412
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F412RGYXP) 
#define FLPROG_CORE_NAME "GENERIC F412RGYXP"
#define FLPROG_CORE_CODE 682
#define FLPROG_CORE_GENERIC_F412RGYXP
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F4
#define FLPROG_I2C0_SDA PB8
#define FLPROG_I2C1_SCL PB9

#define FLPROG_HAS_I2C1
#define FLPROG_NEED_CREATE_I2C1
#define FLPROG_I2C1_SDA PB11
#define FLPROG_I2C1_SCL PB10
#define FLPROG_CORE_STM32_F412
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_PYBSTICK26_PRO) 
#define FLPROG_CORE_NAME "PYBSTICK26 PRO"
#define FLPROG_CORE_CODE 1433
#define FLPROG_CORE_PYBSTICK26_PRO
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F4
#define FLPROG_I2C0_SDA PB8
#define FLPROG_I2C1_SCL PB9

#define FLPROG_HAS_I2C1
#define FLPROG_NEED_CREATE_I2C1
#define FLPROG_I2C1_SDA PB11
#define FLPROG_I2C1_SCL PB10
#define FLPROG_CORE_STM32_F412
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_DISCO_F413ZH) 
#define FLPROG_CORE_NAME "DISCO F413ZH"
#define FLPROG_CORE_CODE 358
#define FLPROG_CORE_DISCO_F413ZH
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F4
#define FLPROG_I2C0_SDA PB8
#define FLPROG_I2C1_SCL PB9

#define FLPROG_HAS_I2C1
#define FLPROG_NEED_CREATE_I2C1
#define FLPROG_I2C1_SDA PB11
#define FLPROG_I2C1_SCL PB10
#define FLPROG_CORE_STM32_F413
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F413CGUX) 
#define FLPROG_CORE_NAME "GENERIC F413CGUX"
#define FLPROG_CORE_CODE 683
#define FLPROG_CORE_GENERIC_F413CGUX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F4
#define FLPROG_I2C0_SDA PB8
#define FLPROG_I2C1_SCL PB9

#define FLPROG_HAS_I2C1
#define FLPROG_NEED_CREATE_I2C1
#define FLPROG_I2C1_SDA PB11
#define FLPROG_I2C1_SCL PB10
#define FLPROG_CORE_STM32_F413
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F413CHUX) 
#define FLPROG_CORE_NAME "GENERIC F413CHUX"
#define FLPROG_CORE_CODE 684
#define FLPROG_CORE_GENERIC_F413CHUX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F4
#define FLPROG_I2C0_SDA PB8
#define FLPROG_I2C1_SCL PB9

#define FLPROG_HAS_I2C1
#define FLPROG_NEED_CREATE_I2C1
#define FLPROG_I2C1_SDA PB11
#define FLPROG_I2C1_SCL PB10
#define FLPROG_CORE_STM32_F413
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F413RGTX) 
#define FLPROG_CORE_NAME "GENERIC F413RGTX"
#define FLPROG_CORE_CODE 685
#define FLPROG_CORE_GENERIC_F413RGTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F4
#define FLPROG_I2C0_SDA PB8
#define FLPROG_I2C1_SCL PB9

#define FLPROG_HAS_I2C1
#define FLPROG_NEED_CREATE_I2C1
#define FLPROG_I2C1_SDA PB11
#define FLPROG_I2C1_SCL PB10
#define FLPROG_CORE_STM32_F413
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F413RHTX) 
#define FLPROG_CORE_NAME "GENERIC F413RHTX"
#define FLPROG_CORE_CODE 686
#define FLPROG_CORE_GENERIC_F413RHTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F4
#define FLPROG_I2C0_SDA PB8
#define FLPROG_I2C1_SCL PB9

#define FLPROG_HAS_I2C1
#define FLPROG_NEED_CREATE_I2C1
#define FLPROG_I2C1_SDA PB11
#define FLPROG_I2C1_SCL PB10
#define FLPROG_CORE_STM32_F413
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F413ZGJX) 
#define FLPROG_CORE_NAME "GENERIC F413ZGJX"
#define FLPROG_CORE_CODE 687
#define FLPROG_CORE_GENERIC_F413ZGJX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F4
#define FLPROG_I2C0_SDA PB8
#define FLPROG_I2C1_SCL PB9

#define FLPROG_HAS_I2C1
#define FLPROG_NEED_CREATE_I2C1
#define FLPROG_I2C1_SDA PB11
#define FLPROG_I2C1_SCL PB10
#define FLPROG_CORE_STM32_F413
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F413ZGTX) 
#define FLPROG_CORE_NAME "GENERIC F413ZGTX"
#define FLPROG_CORE_CODE 688
#define FLPROG_CORE_GENERIC_F413ZGTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F4
#define FLPROG_I2C0_SDA PB8
#define FLPROG_I2C1_SCL PB9

#define FLPROG_HAS_I2C1
#define FLPROG_NEED_CREATE_I2C1
#define FLPROG_I2C1_SDA PB11
#define FLPROG_I2C1_SCL PB10
#define FLPROG_CORE_STM32_F413
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F413ZHJX) 
#define FLPROG_CORE_NAME "GENERIC F413ZHJX"
#define FLPROG_CORE_CODE 689
#define FLPROG_CORE_GENERIC_F413ZHJX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F4
#define FLPROG_I2C0_SDA PB8
#define FLPROG_I2C1_SCL PB9

