Totuin/Flprog_Utilites/src/selectCore/flprogSelectCore_stm32.h
#define FLPROG_HAS_I2C1
#define FLPROG_NEED_CREATE_I2C1
#define FLPROG_I2C1_SDA PB11
#define FLPROG_I2C1_SCL PB10
#define FLPROG_CORE_STM32_F413
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F413ZHTX) 
#define FLPROG_CORE_NAME "GENERIC F413ZHTX"
#define FLPROG_CORE_CODE 690
#define FLPROG_CORE_GENERIC_F413ZHTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F4
#define FLPROG_I2C0_SDA PB8
#define FLPROG_I2C1_SCL PB9

#define FLPROG_HAS_I2C1
#define FLPROG_NEED_CREATE_I2C1
#define FLPROG_I2C1_SDA PB11
#define FLPROG_I2C1_SCL PB10
#define FLPROG_CORE_STM32_F413
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_NUCLEO_F413ZH) 
#define FLPROG_CORE_NAME "NUCLEO F413ZH"
#define FLPROG_CORE_CODE 1389
#define FLPROG_CORE_NUCLEO_F413ZH
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F4
#define FLPROG_I2C0_SDA PB8
#define FLPROG_I2C1_SCL PB9

#define FLPROG_HAS_I2C1
#define FLPROG_NEED_CREATE_I2C1
#define FLPROG_I2C1_SDA PB11
#define FLPROG_I2C1_SCL PB10
#define FLPROG_CORE_STM32_F413
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F415RGTX) 
#define FLPROG_CORE_NAME "GENERIC F415RGTX"
#define FLPROG_CORE_CODE 691
#define FLPROG_CORE_GENERIC_F415RGTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F4
#define FLPROG_I2C0_SDA PB8
#define FLPROG_I2C1_SCL PB9

#define FLPROG_HAS_I2C1
#define FLPROG_NEED_CREATE_I2C1
#define FLPROG_I2C1_SDA PB11
#define FLPROG_I2C1_SCL PB10
#define FLPROG_CORE_STM32_F415
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F417VETX) 
#define FLPROG_CORE_NAME "GENERIC F417VETX"
#define FLPROG_CORE_CODE 692
#define FLPROG_CORE_GENERIC_F417VETX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F4
#define FLPROG_I2C0_SDA PB8
#define FLPROG_I2C1_SCL PB9

#define FLPROG_HAS_I2C1
#define FLPROG_NEED_CREATE_I2C1
#define FLPROG_I2C1_SDA PB11
#define FLPROG_I2C1_SCL PB10
#define FLPROG_CORE_STM32_F417
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F417VGTX) 
#define FLPROG_CORE_NAME "GENERIC F417VGTX"
#define FLPROG_CORE_CODE 693
#define FLPROG_CORE_GENERIC_F417VGTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F4
#define FLPROG_I2C0_SDA PB8
#define FLPROG_I2C1_SCL PB9

#define FLPROG_HAS_I2C1
#define FLPROG_NEED_CREATE_I2C1
#define FLPROG_I2C1_SDA PB11
#define FLPROG_I2C1_SCL PB10
#define FLPROG_CORE_STM32_F417
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F417ZETX) 
#define FLPROG_CORE_NAME "GENERIC F417ZETX"
#define FLPROG_CORE_CODE 694
#define FLPROG_CORE_GENERIC_F417ZETX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F4
#define FLPROG_I2C0_SDA PB8
#define FLPROG_I2C1_SCL PB9

#define FLPROG_HAS_I2C1
#define FLPROG_NEED_CREATE_I2C1
#define FLPROG_I2C1_SDA PB11
#define FLPROG_I2C1_SCL PB10
#define FLPROG_CORE_STM32_F417
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F417ZGTX) 
#define FLPROG_CORE_NAME "GENERIC F417ZGTX"
#define FLPROG_CORE_CODE 695
#define FLPROG_CORE_GENERIC_F417ZGTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F4
#define FLPROG_I2C0_SDA PB8
#define FLPROG_I2C1_SCL PB9

#define FLPROG_HAS_I2C1
#define FLPROG_NEED_CREATE_I2C1
#define FLPROG_I2C1_SDA PB11
#define FLPROG_I2C1_SCL PB10
#define FLPROG_CORE_STM32_F417
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F423CHUX) 
#define FLPROG_CORE_NAME "GENERIC F423CHUX"
#define FLPROG_CORE_CODE 696
#define FLPROG_CORE_GENERIC_F423CHUX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F4
#define FLPROG_I2C0_SDA PB8
#define FLPROG_I2C1_SCL PB9

#define FLPROG_HAS_I2C1
#define FLPROG_NEED_CREATE_I2C1
#define FLPROG_I2C1_SDA PB11
#define FLPROG_I2C1_SCL PB10
#define FLPROG_CORE_STM32_F423
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F423RHTX) 
#define FLPROG_CORE_NAME "GENERIC F423RHTX"
#define FLPROG_CORE_CODE 697
#define FLPROG_CORE_GENERIC_F423RHTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F4
#define FLPROG_I2C0_SDA PB8
#define FLPROG_I2C1_SCL PB9

#define FLPROG_HAS_I2C1
#define FLPROG_NEED_CREATE_I2C1
#define FLPROG_I2C1_SDA PB11
#define FLPROG_I2C1_SCL PB10
#define FLPROG_CORE_STM32_F423
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F423ZHJX) 
#define FLPROG_CORE_NAME "GENERIC F423ZHJX"
#define FLPROG_CORE_CODE 698
#define FLPROG_CORE_GENERIC_F423ZHJX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F4
#define FLPROG_I2C0_SDA PB8
#define FLPROG_I2C1_SCL PB9

#define FLPROG_HAS_I2C1
#define FLPROG_NEED_CREATE_I2C1
#define FLPROG_I2C1_SDA PB11
#define FLPROG_I2C1_SCL PB10
#define FLPROG_CORE_STM32_F423
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F423ZHTX) 
#define FLPROG_CORE_NAME "GENERIC F423ZHTX"
#define FLPROG_CORE_CODE 699
#define FLPROG_CORE_GENERIC_F423ZHTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F4
#define FLPROG_I2C0_SDA PB8
#define FLPROG_I2C1_SCL PB9

#define FLPROG_HAS_I2C1
#define FLPROG_NEED_CREATE_I2C1
#define FLPROG_I2C1_SDA PB11
#define FLPROG_I2C1_SCL PB10
#define FLPROG_CORE_STM32_F423
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F427ZGTX) 
#define FLPROG_CORE_NAME "GENERIC F427ZGTX"
#define FLPROG_CORE_CODE 700
#define FLPROG_CORE_GENERIC_F427ZGTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F4
#define FLPROG_I2C0_SDA PB8
#define FLPROG_I2C1_SCL PB9

#define FLPROG_HAS_I2C1
#define FLPROG_NEED_CREATE_I2C1
#define FLPROG_I2C1_SDA PB11
#define FLPROG_I2C1_SCL PB10
#define FLPROG_CORE_STM32_F427
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F427ZITX) 
#define FLPROG_CORE_NAME "GENERIC F427ZITX"
#define FLPROG_CORE_CODE 701
#define FLPROG_CORE_GENERIC_F427ZITX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F4
#define FLPROG_I2C0_SDA PB8
#define FLPROG_I2C1_SCL PB9

#define FLPROG_HAS_I2C1
#define FLPROG_NEED_CREATE_I2C1
#define FLPROG_I2C1_SDA PB11
#define FLPROG_I2C1_SCL PB10
#define FLPROG_CORE_STM32_F427
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F429ZETX) 
#define FLPROG_CORE_NAME "GENERIC F429ZETX"
#define FLPROG_CORE_CODE 702
#define FLPROG_CORE_GENERIC_F429ZETX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F4
#define FLPROG_I2C0_SDA PB8
#define FLPROG_I2C1_SCL PB9

#define FLPROG_HAS_I2C1
#define FLPROG_NEED_CREATE_I2C1
#define FLPROG_I2C1_SDA PB11
#define FLPROG_I2C1_SCL PB10
#define FLPROG_CORE_STM32_F429
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F429ZGTX) 
#define FLPROG_CORE_NAME "GENERIC F429ZGTX"
#define FLPROG_CORE_CODE 703
#define FLPROG_CORE_GENERIC_F429ZGTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F4
#define FLPROG_I2C0_SDA PB8
#define FLPROG_I2C1_SCL PB9

#define FLPROG_HAS_I2C1
#define FLPROG_NEED_CREATE_I2C1
#define FLPROG_I2C1_SDA PB11
#define FLPROG_I2C1_SCL PB10
#define FLPROG_CORE_STM32_F429
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F429ZGYX) 
#define FLPROG_CORE_NAME "GENERIC F429ZGYX"
#define FLPROG_CORE_CODE 704
#define FLPROG_CORE_GENERIC_F429ZGYX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F4
#define FLPROG_I2C0_SDA PB8
#define FLPROG_I2C1_SCL PB9

#define FLPROG_HAS_I2C1
#define FLPROG_NEED_CREATE_I2C1
#define FLPROG_I2C1_SDA PB11
#define FLPROG_I2C1_SCL PB10
#define FLPROG_CORE_STM32_F429
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F429ZITX) 
#define FLPROG_CORE_NAME "GENERIC F429ZITX"
#define FLPROG_CORE_CODE 705
#define FLPROG_CORE_GENERIC_F429ZITX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F4
#define FLPROG_I2C0_SDA PB8
#define FLPROG_I2C1_SCL PB9

#define FLPROG_HAS_I2C1
#define FLPROG_NEED_CREATE_I2C1
#define FLPROG_I2C1_SDA PB11
#define FLPROG_I2C1_SCL PB10
#define FLPROG_CORE_STM32_F429
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F429ZIYX) 
#define FLPROG_CORE_NAME "GENERIC F429ZIYX"
#define FLPROG_CORE_CODE 706
#define FLPROG_CORE_GENERIC_F429ZIYX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F4
#define FLPROG_I2C0_SDA PB8
#define FLPROG_I2C1_SCL PB9

#define FLPROG_HAS_I2C1
#define FLPROG_NEED_CREATE_I2C1
#define FLPROG_I2C1_SDA PB11
#define FLPROG_I2C1_SCL PB10
#define FLPROG_CORE_STM32_F429
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_NUCLEO_F429ZI) 
#define FLPROG_CORE_NAME "NUCLEO F429ZI"
#define FLPROG_CORE_CODE 1390
#define FLPROG_CORE_NUCLEO_F429ZI
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F4
#define FLPROG_I2C0_SDA PB8
#define FLPROG_I2C1_SCL PB9

#define FLPROG_HAS_I2C1
#define FLPROG_NEED_CREATE_I2C1
#define FLPROG_I2C1_SDA PB11
#define FLPROG_I2C1_SCL PB10
#define FLPROG_CORE_STM32_F429
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F437ZGTX) 
#define FLPROG_CORE_NAME "GENERIC F437ZGTX"
#define FLPROG_CORE_CODE 707
#define FLPROG_CORE_GENERIC_F437ZGTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F4
#define FLPROG_I2C0_SDA PB8
#define FLPROG_I2C1_SCL PB9

#define FLPROG_HAS_I2C1
#define FLPROG_NEED_CREATE_I2C1
#define FLPROG_I2C1_SDA PB11
#define FLPROG_I2C1_SCL PB10
#define FLPROG_CORE_STM32_F437
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F437ZITX) 
#define FLPROG_CORE_NAME "GENERIC F437ZITX"
#define FLPROG_CORE_CODE 708
#define FLPROG_CORE_GENERIC_F437ZITX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F4
#define FLPROG_I2C0_SDA PB8
#define FLPROG_I2C1_SCL PB9

#define FLPROG_HAS_I2C1
#define FLPROG_NEED_CREATE_I2C1
#define FLPROG_I2C1_SDA PB11
#define FLPROG_I2C1_SCL PB10
#define FLPROG_CORE_STM32_F437
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F439ZGTX) 
#define FLPROG_CORE_NAME "GENERIC F439ZGTX"
#define FLPROG_CORE_CODE 709
#define FLPROG_CORE_GENERIC_F439ZGTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F4
#define FLPROG_I2C0_SDA PB8
#define FLPROG_I2C1_SCL PB9

#define FLPROG_HAS_I2C1
#define FLPROG_NEED_CREATE_I2C1
#define FLPROG_I2C1_SDA PB11
#define FLPROG_I2C1_SCL PB10
#define FLPROG_CORE_STM32_F439
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F439ZGYX) 
#define FLPROG_CORE_NAME "GENERIC F439ZGYX"
#define FLPROG_CORE_CODE 710
#define FLPROG_CORE_GENERIC_F439ZGYX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F4
#define FLPROG_I2C0_SDA PB8
#define FLPROG_I2C1_SCL PB9

#define FLPROG_HAS_I2C1
#define FLPROG_NEED_CREATE_I2C1
#define FLPROG_I2C1_SDA PB11
#define FLPROG_I2C1_SCL PB10
#define FLPROG_CORE_STM32_F439
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F439ZITX) 
#define FLPROG_CORE_NAME "GENERIC F439ZITX"
#define FLPROG_CORE_CODE 711
#define FLPROG_CORE_GENERIC_F439ZITX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F4
#define FLPROG_I2C0_SDA PB8
#define FLPROG_I2C1_SCL PB9

#define FLPROG_HAS_I2C1
#define FLPROG_NEED_CREATE_I2C1
#define FLPROG_I2C1_SDA PB11
#define FLPROG_I2C1_SCL PB10
#define FLPROG_CORE_STM32_F439
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F439ZIYX) 
#define FLPROG_CORE_NAME "GENERIC F439ZIYX"
#define FLPROG_CORE_CODE 712
#define FLPROG_CORE_GENERIC_F439ZIYX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F4
#define FLPROG_I2C0_SDA PB8
#define FLPROG_I2C1_SCL PB9

#define FLPROG_HAS_I2C1
#define FLPROG_NEED_CREATE_I2C1
#define FLPROG_I2C1_SDA PB11
#define FLPROG_I2C1_SCL PB10
#define FLPROG_CORE_STM32_F439
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_FYSETC_S6) 
#define FLPROG_CORE_NAME "FYSETC S6"
#define FLPROG_CORE_CODE 374
#define FLPROG_CORE_FYSETC_S6
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F4
#define FLPROG_I2C0_SDA PB8
#define FLPROG_I2C1_SCL PB9

#define FLPROG_HAS_I2C1
#define FLPROG_NEED_CREATE_I2C1
#define FLPROG_I2C1_SDA PB11
#define FLPROG_I2C1_SCL PB10
#define FLPROG_CORE_STM32_F446
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F446RCTX) 
#define FLPROG_CORE_NAME "GENERIC F446RCTX"
#define FLPROG_CORE_CODE 713
#define FLPROG_CORE_GENERIC_F446RCTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F4
#define FLPROG_I2C0_SDA PB8
#define FLPROG_I2C1_SCL PB9

#define FLPROG_HAS_I2C1
#define FLPROG_NEED_CREATE_I2C1
#define FLPROG_I2C1_SDA PB11
#define FLPROG_I2C1_SCL PB10
#define FLPROG_CORE_STM32_F446
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F446RETX) 
#define FLPROG_CORE_NAME "GENERIC F446RETX"
#define FLPROG_CORE_CODE 714
#define FLPROG_CORE_GENERIC_F446RETX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F4
#define FLPROG_I2C0_SDA PB8
#define FLPROG_I2C1_SCL PB9

#define FLPROG_HAS_I2C1
#define FLPROG_NEED_CREATE_I2C1
#define FLPROG_I2C1_SDA PB11
#define FLPROG_I2C1_SCL PB10
#define FLPROG_CORE_STM32_F446
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F446VCTX) 
#define FLPROG_CORE_NAME "GENERIC F446VCTX"
#define FLPROG_CORE_CODE 715
#define FLPROG_CORE_GENERIC_F446VCTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F4
#define FLPROG_I2C0_SDA PB8
#define FLPROG_I2C1_SCL PB9

#define FLPROG_HAS_I2C1
#define FLPROG_NEED_CREATE_I2C1
#define FLPROG_I2C1_SDA PB11
#define FLPROG_I2C1_SCL PB10
#define FLPROG_CORE_STM32_F446
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F446VETX) 
#define FLPROG_CORE_NAME "GENERIC F446VETX"
#define FLPROG_CORE_CODE 716
#define FLPROG_CORE_GENERIC_F446VETX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F4
#define FLPROG_I2C0_SDA PB8
#define FLPROG_I2C1_SCL PB9

#define FLPROG_HAS_I2C1
#define FLPROG_NEED_CREATE_I2C1
#define FLPROG_I2C1_SDA PB11
#define FLPROG_I2C1_SCL PB10
#define FLPROG_CORE_STM32_F446
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_NUCLEO_F446RE) 
#define FLPROG_CORE_NAME "NUCLEO F446RE"
#define FLPROG_CORE_CODE 1391
#define FLPROG_CORE_NUCLEO_F446RE
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F4
#define FLPROG_I2C0_SDA PB8
#define FLPROG_I2C1_SCL PB9

