Totuin/Flprog_Utilites/src/selectCore/flprogSelectCore_stm32.h
#define FLPROG_HAS_I2C1
#define FLPROG_NEED_CREATE_I2C1
#define FLPROG_I2C1_SDA PB11
#define FLPROG_I2C1_SCL PB10
#define FLPROG_CORE_STM32_F446
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_RUMBA32) 
#define FLPROG_CORE_NAME "RUMBA32"
#define FLPROG_CORE_CODE 1440
#define FLPROG_CORE_RUMBA32
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F4
#define FLPROG_I2C0_SDA PB8
#define FLPROG_I2C1_SCL PB9

#define FLPROG_HAS_I2C1
#define FLPROG_NEED_CREATE_I2C1
#define FLPROG_I2C1_SDA PB11
#define FLPROG_I2C1_SCL PB10
#define FLPROG_CORE_STM32_F446
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_VAKE_V1) 
#define FLPROG_CORE_NAME "VAKE V1"
#define FLPROG_CORE_CODE 1453
#define FLPROG_CORE_VAKE_V1
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F4
#define FLPROG_I2C0_SDA PB8
#define FLPROG_I2C1_SCL PB9

#define FLPROG_HAS_I2C1
#define FLPROG_NEED_CREATE_I2C1
#define FLPROG_I2C1_SDA PB11
#define FLPROG_I2C1_SCL PB10
#define FLPROG_CORE_STM32_F446
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_BLACKPILL_F401CC) 
#define FLPROG_CORE_NAME "BLACKPILL F401CC"
#define FLPROG_CORE_CODE 326
#define FLPROG_CORE_BLACKPILL_F401CC
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F4
#define FLPROG_I2C0_SDA PB8
#define FLPROG_I2C1_SCL PB9

#define FLPROG_HAS_I2C1
#define FLPROG_NEED_CREATE_I2C1
#define FLPROG_I2C1_SDA PB11
#define FLPROG_I2C1_SCL PB10
#define FLPROG_HAS_I2C1
#define FLPROG_NEED_CREATE_I2C1
#define FLPROG_I2C1_SDA PB3
#define FLPROG_I2C1_SCL PB10

#define FLPROG_HAS_UART1

#define FLPROG_HAS_UART2
#define FLPROG_NEED_CREATE_UART2
#define FLPROG_UART2_RX PA3
#define FLPROG_UART2_TX PA2

#define FLPROG_HAS_UART6
#define FLPROG_NEED_CREATE_UART6
#define FLPROG_UART6_RX PA12
#define FLPROG_UART6_TX PA11


#define FLPROG_CORE_STM32_F401


#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_BLACKPILL_F401CE) 
#define FLPROG_CORE_NAME "BLACKPILL F401CE"
#define FLPROG_CORE_CODE 327
#define FLPROG_CORE_BLACKPILL_F401CE
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F4
#define FLPROG_I2C0_SDA PB8
#define FLPROG_I2C1_SCL PB9

#define FLPROG_HAS_I2C1
#define FLPROG_NEED_CREATE_I2C1
#define FLPROG_I2C1_SDA PB11
#define FLPROG_I2C1_SCL PB10
#define FLPROG_HAS_I2C1
#define FLPROG_NEED_CREATE_I2C1
#define FLPROG_I2C1_SDA PB3
#define FLPROG_I2C1_SCL PB10

#define FLPROG_HAS_UART1

#define FLPROG_HAS_UART2
#define FLPROG_NEED_CREATE_UART2
#define FLPROG_UART2_RX PA3
#define FLPROG_UART2_TX PA2

#define FLPROG_HAS_UART6
#define FLPROG_NEED_CREATE_UART6
#define FLPROG_UART6_RX PA12
#define FLPROG_UART6_TX PA11


#define FLPROG_CORE_STM32_F401


#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_COREBOARD_F401RC) 
#define FLPROG_CORE_NAME "CoreBoard F401RC"
#define FLPROG_CORE_CODE 346
#define FLPROG_CORE_COREBOARD_F401RC
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F4
#define FLPROG_I2C0_SDA PB8
#define FLPROG_I2C1_SCL PB9

#define FLPROG_HAS_I2C1
#define FLPROG_NEED_CREATE_I2C1
#define FLPROG_I2C1_SDA PB11
#define FLPROG_I2C1_SCL PB10
#define FLPROG_HAS_I2C1
#define FLPROG_NEED_CREATE_I2C1
#define FLPROG_I2C1_SDA PB3
#define FLPROG_I2C1_SCL PB10

#define FLPROG_HAS_UART1

#define FLPROG_HAS_UART2
#define FLPROG_NEED_CREATE_UART2
#define FLPROG_UART2_RX PA3
#define FLPROG_UART2_TX PA2

#define FLPROG_HAS_UART6
#define FLPROG_NEED_CREATE_UART6
#define FLPROG_UART6_RX PA12
#define FLPROG_UART6_TX PA11


#define FLPROG_CORE_STM32_F401


#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F401CBUX) 
#define FLPROG_CORE_NAME "GENERIC F401CBUX"
#define FLPROG_CORE_CODE 637
#define FLPROG_CORE_GENERIC_F401CBUX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F4
#define FLPROG_I2C0_SDA PB8
#define FLPROG_I2C1_SCL PB9

#define FLPROG_HAS_I2C1
#define FLPROG_NEED_CREATE_I2C1
#define FLPROG_I2C1_SDA PB11
#define FLPROG_I2C1_SCL PB10
#define FLPROG_HAS_I2C1
#define FLPROG_NEED_CREATE_I2C1
#define FLPROG_I2C1_SDA PB3
#define FLPROG_I2C1_SCL PB10

#define FLPROG_HAS_UART1

#define FLPROG_HAS_UART2
#define FLPROG_NEED_CREATE_UART2
#define FLPROG_UART2_RX PA3
#define FLPROG_UART2_TX PA2

