Totuin/Flprog_Utilites/src/selectCore/flprogSelectCore_stm32.h
#define FLPROG_HAS_UART6
#define FLPROG_NEED_CREATE_UART6
#define FLPROG_UART6_RX PA12
#define FLPROG_UART6_TX PA11


#define FLPROG_CORE_STM32_F401


#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_ST3DP001_EVAL) 
#define FLPROG_CORE_NAME "ST3DP001 EVAL"
#define FLPROG_CORE_CODE 1442
#define FLPROG_CORE_ST3DP001_EVAL
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F4
#define FLPROG_I2C0_SDA PB8
#define FLPROG_I2C1_SCL PB9

#define FLPROG_HAS_I2C1
#define FLPROG_NEED_CREATE_I2C1
#define FLPROG_I2C1_SDA PB11
#define FLPROG_I2C1_SCL PB10
#define FLPROG_HAS_I2C1
#define FLPROG_NEED_CREATE_I2C1
#define FLPROG_I2C1_SDA PB3
#define FLPROG_I2C1_SCL PB10

#define FLPROG_HAS_UART1

#define FLPROG_HAS_UART2
#define FLPROG_NEED_CREATE_UART2
#define FLPROG_UART2_RX PA3
#define FLPROG_UART2_TX PA2

#define FLPROG_HAS_UART6
#define FLPROG_NEED_CREATE_UART6
#define FLPROG_UART6_RX PA12
#define FLPROG_UART6_TX PA11


#define FLPROG_CORE_STM32_F401


#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_BLACKPILL_F411CE) 
#define FLPROG_CORE_NAME "BLACKPILL F411CE"
#define FLPROG_CORE_CODE 328
#define FLPROG_CORE_BLACKPILL_F411CE
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F4
#define FLPROG_I2C0_SDA PB8
#define FLPROG_I2C1_SCL PB9

#define FLPROG_HAS_I2C1
#define FLPROG_NEED_CREATE_I2C1
#define FLPROG_I2C1_SDA PB11
#define FLPROG_I2C1_SCL PB10
#define FLPROG_HAS_I2C1
#define FLPROG_NEED_CREATE_I2C1
#define FLPROG_I2C1_SDA PB3
#define FLPROG_I2C1_SCL PB10

#define FLPROG_HAS_UART1

#define FLPROG_HAS_UART2
#define FLPROG_NEED_CREATE_UART2
#define FLPROG_UART2_RX PA3
#define FLPROG_UART2_TX PA2

#define FLPROG_HAS_UART6
#define FLPROG_NEED_CREATE_UART6
#define FLPROG_UART6_RX PA12
#define FLPROG_UART6_TX PA11


#define FLPROG_CORE_STM32_F411

#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F411CCUX) 
#define FLPROG_CORE_NAME "GENERIC F411CCUX"
#define FLPROG_CORE_CODE 669
#define FLPROG_CORE_GENERIC_F411CCUX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F4
#define FLPROG_I2C0_SDA PB8
#define FLPROG_I2C1_SCL PB9

#define FLPROG_HAS_I2C1
#define FLPROG_NEED_CREATE_I2C1
#define FLPROG_I2C1_SDA PB11
#define FLPROG_I2C1_SCL PB10
#define FLPROG_HAS_I2C1
#define FLPROG_NEED_CREATE_I2C1
#define FLPROG_I2C1_SDA PB3
#define FLPROG_I2C1_SCL PB10

#define FLPROG_HAS_UART1

#define FLPROG_HAS_UART2
#define FLPROG_NEED_CREATE_UART2
#define FLPROG_UART2_RX PA3
#define FLPROG_UART2_TX PA2

#define FLPROG_HAS_UART6
#define FLPROG_NEED_CREATE_UART6
#define FLPROG_UART6_RX PA12
#define FLPROG_UART6_TX PA11


#define FLPROG_CORE_STM32_F411

#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F411CCYX) 
#define FLPROG_CORE_NAME "GENERIC F411CCYX"
#define FLPROG_CORE_CODE 670
#define FLPROG_CORE_GENERIC_F411CCYX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F4
#define FLPROG_I2C0_SDA PB8
#define FLPROG_I2C1_SCL PB9

#define FLPROG_HAS_I2C1
#define FLPROG_NEED_CREATE_I2C1
#define FLPROG_I2C1_SDA PB11
#define FLPROG_I2C1_SCL PB10
#define FLPROG_HAS_I2C1
#define FLPROG_NEED_CREATE_I2C1
#define FLPROG_I2C1_SDA PB3
#define FLPROG_I2C1_SCL PB10

#define FLPROG_HAS_UART1

#define FLPROG_HAS_UART2
#define FLPROG_NEED_CREATE_UART2
#define FLPROG_UART2_RX PA3
#define FLPROG_UART2_TX PA2

#define FLPROG_HAS_UART6
#define FLPROG_NEED_CREATE_UART6
#define FLPROG_UART6_RX PA12
#define FLPROG_UART6_TX PA11


#define FLPROG_CORE_STM32_F411

#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F411CEUX) 
#define FLPROG_CORE_NAME "GENERIC F411CEUX"
#define FLPROG_CORE_CODE 671
#define FLPROG_CORE_GENERIC_F411CEUX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F4
#define FLPROG_I2C0_SDA PB8
#define FLPROG_I2C1_SCL PB9

#define FLPROG_HAS_I2C1
#define FLPROG_NEED_CREATE_I2C1
#define FLPROG_I2C1_SDA PB11
#define FLPROG_I2C1_SCL PB10
#define FLPROG_HAS_I2C1
#define FLPROG_NEED_CREATE_I2C1
#define FLPROG_I2C1_SDA PB3
#define FLPROG_I2C1_SCL PB10

#define FLPROG_HAS_UART1

#define FLPROG_HAS_UART2
#define FLPROG_NEED_CREATE_UART2
#define FLPROG_UART2_RX PA3
#define FLPROG_UART2_TX PA2

#define FLPROG_HAS_UART6
#define FLPROG_NEED_CREATE_UART6
#define FLPROG_UART6_RX PA12
#define FLPROG_UART6_TX PA11


#define FLPROG_CORE_STM32_F411

#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F411CEYX) 
#define FLPROG_CORE_NAME "GENERIC F411CEYX"
#define FLPROG_CORE_CODE 672
#define FLPROG_CORE_GENERIC_F411CEYX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F4
#define FLPROG_I2C0_SDA PB8
#define FLPROG_I2C1_SCL PB9

#define FLPROG_HAS_I2C1
#define FLPROG_NEED_CREATE_I2C1
#define FLPROG_I2C1_SDA PB11
#define FLPROG_I2C1_SCL PB10
#define FLPROG_HAS_I2C1
#define FLPROG_NEED_CREATE_I2C1
#define FLPROG_I2C1_SDA PB3
#define FLPROG_I2C1_SCL PB10

#define FLPROG_HAS_UART1

#define FLPROG_HAS_UART2
#define FLPROG_NEED_CREATE_UART2
#define FLPROG_UART2_RX PA3
#define FLPROG_UART2_TX PA2

