Totuin/Flprog_Utilites/src/selectCore/flprogSelectCore_stm32.h
#define FLPROG_HAS_UART6
#define FLPROG_NEED_CREATE_UART6
#define FLPROG_UART6_RX PA12
#define FLPROG_UART6_TX PA11


#define FLPROG_CORE_STM32_F411

#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F411RCTX) 
#define FLPROG_CORE_NAME "GENERIC F411RCTX"
#define FLPROG_CORE_CODE 673
#define FLPROG_CORE_GENERIC_F411RCTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F4
#define FLPROG_I2C0_SDA PB8
#define FLPROG_I2C1_SCL PB9

#define FLPROG_HAS_I2C1
#define FLPROG_NEED_CREATE_I2C1
#define FLPROG_I2C1_SDA PB11
#define FLPROG_I2C1_SCL PB10
#define FLPROG_HAS_I2C1
#define FLPROG_NEED_CREATE_I2C1
#define FLPROG_I2C1_SDA PB3
#define FLPROG_I2C1_SCL PB10

#define FLPROG_HAS_UART1

#define FLPROG_HAS_UART2
#define FLPROG_NEED_CREATE_UART2
#define FLPROG_UART2_RX PA3
#define FLPROG_UART2_TX PA2

#define FLPROG_HAS_UART6
#define FLPROG_NEED_CREATE_UART6
#define FLPROG_UART6_RX PA12
#define FLPROG_UART6_TX PA11


#define FLPROG_CORE_STM32_F411

#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F411RETX) 
#define FLPROG_CORE_NAME "GENERIC F411RETX"
#define FLPROG_CORE_CODE 674
#define FLPROG_CORE_GENERIC_F411RETX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F4
#define FLPROG_I2C0_SDA PB8
#define FLPROG_I2C1_SCL PB9

#define FLPROG_HAS_I2C1
#define FLPROG_NEED_CREATE_I2C1
#define FLPROG_I2C1_SDA PB11
#define FLPROG_I2C1_SCL PB10
#define FLPROG_HAS_I2C1
#define FLPROG_NEED_CREATE_I2C1
#define FLPROG_I2C1_SDA PB3
#define FLPROG_I2C1_SCL PB10

#define FLPROG_HAS_UART1

#define FLPROG_HAS_UART2
#define FLPROG_NEED_CREATE_UART2
#define FLPROG_UART2_RX PA3
#define FLPROG_UART2_TX PA2

#define FLPROG_HAS_UART6
#define FLPROG_NEED_CREATE_UART6
#define FLPROG_UART6_RX PA12
#define FLPROG_UART6_TX PA11


#define FLPROG_CORE_STM32_F411

#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_NUCLEO_F411RE) 
#define FLPROG_CORE_NAME "NUCLEO F411RE"
#define FLPROG_CORE_CODE 1388
#define FLPROG_CORE_NUCLEO_F411RE
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F4
#define FLPROG_I2C0_SDA PB8
#define FLPROG_I2C1_SCL PB9

#define FLPROG_HAS_I2C1
#define FLPROG_NEED_CREATE_I2C1
#define FLPROG_I2C1_SDA PB11
#define FLPROG_I2C1_SCL PB10
#define FLPROG_HAS_I2C1
#define FLPROG_NEED_CREATE_I2C1
#define FLPROG_I2C1_SDA PB3
#define FLPROG_I2C1_SCL PB10

#define FLPROG_HAS_UART1

#define FLPROG_HAS_UART2
#define FLPROG_NEED_CREATE_UART2
#define FLPROG_UART2_RX PA3
#define FLPROG_UART2_TX PA2

#define FLPROG_HAS_UART6
#define FLPROG_NEED_CREATE_UART6
#define FLPROG_UART6_RX PA12
#define FLPROG_UART6_TX PA11


#define FLPROG_CORE_STM32_F411

#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_PYBSTICK26_STD) 
#define FLPROG_CORE_NAME "PYBSTICK26 STD"
#define FLPROG_CORE_CODE 1434
#define FLPROG_CORE_PYBSTICK26_STD
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F4
#define FLPROG_I2C0_SDA PB8
#define FLPROG_I2C1_SCL PB9

#define FLPROG_HAS_I2C1
#define FLPROG_NEED_CREATE_I2C1
#define FLPROG_I2C1_SDA PB11
#define FLPROG_I2C1_SCL PB10
#define FLPROG_HAS_I2C1
#define FLPROG_NEED_CREATE_I2C1
#define FLPROG_I2C1_SDA PB3
#define FLPROG_I2C1_SCL PB10

#define FLPROG_HAS_UART1

#define FLPROG_HAS_UART2
#define FLPROG_NEED_CREATE_UART2
#define FLPROG_UART2_RX PA3
#define FLPROG_UART2_TX PA2

#define FLPROG_HAS_UART6
#define FLPROG_NEED_CREATE_UART6
#define FLPROG_UART6_RX PA12
#define FLPROG_UART6_TX PA11


#define FLPROG_CORE_STM32_F411

#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_THUNDERPACK_F411) 
#define FLPROG_CORE_NAME "THUNDERPACK F411"
#define FLPROG_CORE_CODE 1451
#define FLPROG_CORE_THUNDERPACK_F411
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F4
#define FLPROG_I2C0_SDA PB8
#define FLPROG_I2C1_SCL PB9

#define FLPROG_HAS_I2C1
#define FLPROG_NEED_CREATE_I2C1
#define FLPROG_I2C1_SDA PB11
#define FLPROG_I2C1_SCL PB10
#define FLPROG_HAS_I2C1
#define FLPROG_NEED_CREATE_I2C1
#define FLPROG_I2C1_SDA PB3
#define FLPROG_I2C1_SCL PB10

#define FLPROG_HAS_UART1

#define FLPROG_HAS_UART2
#define FLPROG_NEED_CREATE_UART2
#define FLPROG_UART2_RX PA3
#define FLPROG_UART2_TX PA2

#define FLPROG_HAS_UART6
#define FLPROG_NEED_CREATE_UART6
#define FLPROG_UART6_RX PA12
#define FLPROG_UART6_TX PA11


#define FLPROG_CORE_STM32_F411

#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F722RCTX) 
#define FLPROG_CORE_NAME "GENERIC F722RCTX"
#define FLPROG_CORE_CODE 717
#define FLPROG_CORE_GENERIC_F722RCTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F7
#define FLPROG_CORE_STM32_F722
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F722RETX) 
#define FLPROG_CORE_NAME "GENERIC F722RETX"
#define FLPROG_CORE_CODE 718
#define FLPROG_CORE_GENERIC_F722RETX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F7
#define FLPROG_CORE_STM32_F722
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F722ZCTX) 
#define FLPROG_CORE_NAME "GENERIC F722ZCTX"
#define FLPROG_CORE_CODE 719
#define FLPROG_CORE_GENERIC_F722ZCTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F7
#define FLPROG_CORE_STM32_F722
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F722ZETX) 
#define FLPROG_CORE_NAME "GENERIC F722ZETX"
#define FLPROG_CORE_CODE 720
#define FLPROG_CORE_GENERIC_F722ZETX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F7
#define FLPROG_CORE_STM32_F722
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_NUCLEO_F722ZE) 
#define FLPROG_CORE_NAME "NUCLEO F722ZE"
#define FLPROG_CORE_CODE 1392
#define FLPROG_CORE_NUCLEO_F722ZE
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F7
#define FLPROG_CORE_STM32_F722
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F730R8TX) 
#define FLPROG_CORE_NAME "GENERIC F730R8TX"
#define FLPROG_CORE_CODE 721
#define FLPROG_CORE_GENERIC_F730R8TX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F7
#define FLPROG_CORE_STM32_F730
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F732RETX) 
#define FLPROG_CORE_NAME "GENERIC F732RETX"
#define FLPROG_CORE_CODE 722
#define FLPROG_CORE_GENERIC_F732RETX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F7
#define FLPROG_CORE_STM32_F732
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F732ZETX) 
#define FLPROG_CORE_NAME "GENERIC F732ZETX"
#define FLPROG_CORE_CODE 723
#define FLPROG_CORE_GENERIC_F732ZETX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F7
#define FLPROG_CORE_STM32_F732
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F745ZETX) 
#define FLPROG_CORE_NAME "GENERIC F745ZETX"
#define FLPROG_CORE_CODE 724
#define FLPROG_CORE_GENERIC_F745ZETX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F7
#define FLPROG_CORE_STM32_F745
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F745ZGTX) 
#define FLPROG_CORE_NAME "GENERIC F745ZGTX"
#define FLPROG_CORE_CODE 725
#define FLPROG_CORE_GENERIC_F745ZGTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F7
#define FLPROG_CORE_STM32_F745
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_DISCO_F746NG) 
#define FLPROG_CORE_NAME "DISCO F746NG"
#define FLPROG_CORE_CODE 359
#define FLPROG_CORE_DISCO_F746NG
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F7
#define FLPROG_CORE_STM32_F746
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_ETHERCAT_DUINO) 
#define FLPROG_CORE_NAME "ETHERCAT DUINO"
#define FLPROG_CORE_CODE 369
#define FLPROG_CORE_ETHERCAT_DUINO
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F7
#define FLPROG_CORE_STM32_F746
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F746BETX) 
#define FLPROG_CORE_NAME "GENERIC F746BETX"
#define FLPROG_CORE_CODE 726
#define FLPROG_CORE_GENERIC_F746BETX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F7
#define FLPROG_CORE_STM32_F746
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F746BGTX) 
#define FLPROG_CORE_NAME "GENERIC F746BGTX"
#define FLPROG_CORE_CODE 727
#define FLPROG_CORE_GENERIC_F746BGTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F7
#define FLPROG_CORE_STM32_F746
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F746NEHX) 
#define FLPROG_CORE_NAME "GENERIC F746NEHX"
#define FLPROG_CORE_CODE 728
#define FLPROG_CORE_GENERIC_F746NEHX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F7
#define FLPROG_CORE_STM32_F746
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F746NGHX) 
#define FLPROG_CORE_NAME "GENERIC F746NGHX"
#define FLPROG_CORE_CODE 729
#define FLPROG_CORE_GENERIC_F746NGHX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F7
#define FLPROG_CORE_STM32_F746
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F746ZETX) 
#define FLPROG_CORE_NAME "GENERIC F746ZETX"
#define FLPROG_CORE_CODE 730
#define FLPROG_CORE_GENERIC_F746ZETX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F7
#define FLPROG_CORE_STM32_F746
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F746ZEYX) 
#define FLPROG_CORE_NAME "GENERIC F746ZEYX"
#define FLPROG_CORE_CODE 731
#define FLPROG_CORE_GENERIC_F746ZEYX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F7
#define FLPROG_CORE_STM32_F746
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F746ZGTX) 
#define FLPROG_CORE_NAME "GENERIC F746ZGTX"
#define FLPROG_CORE_CODE 732
#define FLPROG_CORE_GENERIC_F746ZGTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F7
#define FLPROG_CORE_STM32_F746
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F746ZGYX) 
#define FLPROG_CORE_NAME "GENERIC F746ZGYX"
#define FLPROG_CORE_CODE 733
#define FLPROG_CORE_GENERIC_F746ZGYX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F7
#define FLPROG_CORE_STM32_F746
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_NUCLEO_F746ZG) 
#define FLPROG_CORE_NAME "NUCLEO F746ZG"
#define FLPROG_CORE_CODE 1393
#define FLPROG_CORE_NUCLEO_F746ZG
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F7
#define FLPROG_CORE_STM32_F746
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F750N8HX) 
#define FLPROG_CORE_NAME "GENERIC F750N8HX"
#define FLPROG_CORE_CODE 734
#define FLPROG_CORE_GENERIC_F750N8HX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F7
#define FLPROG_CORE_STM32_F750
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F750Z8TX) 
#define FLPROG_CORE_NAME "GENERIC F750Z8TX"
#define FLPROG_CORE_CODE 735
#define FLPROG_CORE_GENERIC_F750Z8TX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F7
#define FLPROG_CORE_STM32_F750
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F756BGTX) 
#define FLPROG_CORE_NAME "GENERIC F756BGTX"
#define FLPROG_CORE_CODE 736
#define FLPROG_CORE_GENERIC_F756BGTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F7
#define FLPROG_CORE_STM32_F756
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F756NGHX) 
#define FLPROG_CORE_NAME "GENERIC F756NGHX"
#define FLPROG_CORE_CODE 737
#define FLPROG_CORE_GENERIC_F756NGHX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F7
#define FLPROG_CORE_STM32_F756
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F756ZGTX) 
#define FLPROG_CORE_NAME "GENERIC F756ZGTX"
#define FLPROG_CORE_CODE 738
#define FLPROG_CORE_GENERIC_F756ZGTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F7
#define FLPROG_CORE_STM32_F756
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F756ZGYX) 
#define FLPROG_CORE_NAME "GENERIC F756ZGYX"
#define FLPROG_CORE_CODE 739
#define FLPROG_CORE_GENERIC_F756ZGYX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F7
#define FLPROG_CORE_STM32_F756
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_NUCLEO_F756ZG) 
#define FLPROG_CORE_NAME "NUCLEO F756ZG"
#define FLPROG_CORE_CODE 1394
#define FLPROG_CORE_NUCLEO_F756ZG
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F7
#define FLPROG_CORE_STM32_F756
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F765IGKX) 
#define FLPROG_CORE_NAME "GENERIC F765IGKX"
#define FLPROG_CORE_CODE 740
#define FLPROG_CORE_GENERIC_F765IGKX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F7
#define FLPROG_CORE_STM32_F765
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F765IGTX) 
#define FLPROG_CORE_NAME "GENERIC F765IGTX"
#define FLPROG_CORE_CODE 741
#define FLPROG_CORE_GENERIC_F765IGTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F7
#define FLPROG_CORE_STM32_F765
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
