Totuin/Flprog_Utilites/src/selectCore/flprogSelectCore_stm32.h
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F765IIKX) 
#define FLPROG_CORE_NAME "GENERIC F765IIKX"
#define FLPROG_CORE_CODE 742
#define FLPROG_CORE_GENERIC_F765IIKX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F7
#define FLPROG_CORE_STM32_F765
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F765IITX) 
#define FLPROG_CORE_NAME "GENERIC F765IITX"
#define FLPROG_CORE_CODE 743
#define FLPROG_CORE_GENERIC_F765IITX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F7
#define FLPROG_CORE_STM32_F765
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F765VGHX) 
#define FLPROG_CORE_NAME "GENERIC F765VGHX"
#define FLPROG_CORE_CODE 744
#define FLPROG_CORE_GENERIC_F765VGHX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F7
#define FLPROG_CORE_STM32_F765
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F765VGTX) 
#define FLPROG_CORE_NAME "GENERIC F765VGTX"
#define FLPROG_CORE_CODE 745
#define FLPROG_CORE_GENERIC_F765VGTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F7
#define FLPROG_CORE_STM32_F765
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F765VIHX) 
#define FLPROG_CORE_NAME "GENERIC F765VIHX"
#define FLPROG_CORE_CODE 746
#define FLPROG_CORE_GENERIC_F765VIHX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F7
#define FLPROG_CORE_STM32_F765
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F765VITX) 
#define FLPROG_CORE_NAME "GENERIC F765VITX"
#define FLPROG_CORE_CODE 747
#define FLPROG_CORE_GENERIC_F765VITX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F7
#define FLPROG_CORE_STM32_F765
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F765ZGTX) 
#define FLPROG_CORE_NAME "GENERIC F765ZGTX"
#define FLPROG_CORE_CODE 748
#define FLPROG_CORE_GENERIC_F765ZGTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F7
#define FLPROG_CORE_STM32_F765
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F765ZITX) 
#define FLPROG_CORE_NAME "GENERIC F765ZITX"
#define FLPROG_CORE_CODE 749
#define FLPROG_CORE_GENERIC_F765ZITX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F7
#define FLPROG_CORE_STM32_F765
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_REMRAM_V1) 
#define FLPROG_CORE_NAME "REMRAM V1"
#define FLPROG_CORE_CODE 1438
#define FLPROG_CORE_REMRAM_V1
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F7
#define FLPROG_CORE_STM32_F765
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F767IGKX) 
#define FLPROG_CORE_NAME "GENERIC F767IGKX"
#define FLPROG_CORE_CODE 750
#define FLPROG_CORE_GENERIC_F767IGKX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F7
#define FLPROG_CORE_STM32_F767
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F767IGTX) 
#define FLPROG_CORE_NAME "GENERIC F767IGTX"
#define FLPROG_CORE_CODE 751
#define FLPROG_CORE_GENERIC_F767IGTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F7
#define FLPROG_CORE_STM32_F767
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F767IIKX) 
#define FLPROG_CORE_NAME "GENERIC F767IIKX"
#define FLPROG_CORE_CODE 752
#define FLPROG_CORE_GENERIC_F767IIKX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F7
#define FLPROG_CORE_STM32_F767
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F767IITX) 
#define FLPROG_CORE_NAME "GENERIC F767IITX"
#define FLPROG_CORE_CODE 753
#define FLPROG_CORE_GENERIC_F767IITX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F7
#define FLPROG_CORE_STM32_F767
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F767VGHX) 
#define FLPROG_CORE_NAME "GENERIC F767VGHX"
#define FLPROG_CORE_CODE 754
#define FLPROG_CORE_GENERIC_F767VGHX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F7
#define FLPROG_CORE_STM32_F767
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F767VGTX) 
#define FLPROG_CORE_NAME "GENERIC F767VGTX"
#define FLPROG_CORE_CODE 755
#define FLPROG_CORE_GENERIC_F767VGTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F7
#define FLPROG_CORE_STM32_F767
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F767VIHX) 
#define FLPROG_CORE_NAME "GENERIC F767VIHX"
#define FLPROG_CORE_CODE 756
#define FLPROG_CORE_GENERIC_F767VIHX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F7
#define FLPROG_CORE_STM32_F767
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F767VITX) 
#define FLPROG_CORE_NAME "GENERIC F767VITX"
#define FLPROG_CORE_CODE 757
#define FLPROG_CORE_GENERIC_F767VITX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F7
#define FLPROG_CORE_STM32_F767
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F767ZGTX) 
#define FLPROG_CORE_NAME "GENERIC F767ZGTX"
#define FLPROG_CORE_CODE 758
#define FLPROG_CORE_GENERIC_F767ZGTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F7
#define FLPROG_CORE_STM32_F767
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F767ZITX) 
#define FLPROG_CORE_NAME "GENERIC F767ZITX"
#define FLPROG_CORE_CODE 759
#define FLPROG_CORE_GENERIC_F767ZITX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F7
#define FLPROG_CORE_STM32_F767
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_NUCLEO_F767ZI) 
#define FLPROG_CORE_NAME "NUCLEO F767ZI"
#define FLPROG_CORE_CODE 1395
#define FLPROG_CORE_NUCLEO_F767ZI
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F7
#define FLPROG_CORE_STM32_F767
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F777IIKX) 
#define FLPROG_CORE_NAME "GENERIC F777IIKX"
#define FLPROG_CORE_CODE 760
#define FLPROG_CORE_GENERIC_F777IIKX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F7
#define FLPROG_CORE_STM32_F777
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F777IITX) 
#define FLPROG_CORE_NAME "GENERIC F777IITX"
#define FLPROG_CORE_CODE 761
#define FLPROG_CORE_GENERIC_F777IITX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F7
#define FLPROG_CORE_STM32_F777
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F777VIHX) 
#define FLPROG_CORE_NAME "GENERIC F777VIHX"
#define FLPROG_CORE_CODE 762
#define FLPROG_CORE_GENERIC_F777VIHX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F7
#define FLPROG_CORE_STM32_F777
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F777VITX) 
#define FLPROG_CORE_NAME "GENERIC F777VITX"
#define FLPROG_CORE_CODE 763
#define FLPROG_CORE_GENERIC_F777VITX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F7
#define FLPROG_CORE_STM32_F777
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_F777ZITX) 
#define FLPROG_CORE_NAME "GENERIC F777ZITX"
#define FLPROG_CORE_CODE 764
#define FLPROG_CORE_GENERIC_F777ZITX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_F7
#define FLPROG_CORE_STM32_F777
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_AURORA_ONE) 
#define FLPROG_CORE_NAME "AURORA ONE"
#define FLPROG_CORE_CODE 323
#define FLPROG_CORE_AURORA_ONE
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G0
#define FLPROG_CORE_STM32_G030
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G030C6TX) 
#define FLPROG_CORE_NAME "GENERIC G030C6TX"
#define FLPROG_CORE_CODE 765
#define FLPROG_CORE_GENERIC_G030C6TX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G0
#define FLPROG_CORE_STM32_G030
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G030C8TX) 
#define FLPROG_CORE_NAME "GENERIC G030C8TX"
#define FLPROG_CORE_CODE 766
#define FLPROG_CORE_GENERIC_G030C8TX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G0
#define FLPROG_CORE_STM32_G030
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G030F6PX) 
#define FLPROG_CORE_NAME "GENERIC G030F6PX"
#define FLPROG_CORE_CODE 767
#define FLPROG_CORE_GENERIC_G030F6PX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G0
#define FLPROG_CORE_STM32_G030
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G030J6MX) 
#define FLPROG_CORE_NAME "GENERIC G030J6MX"
#define FLPROG_CORE_CODE 768
#define FLPROG_CORE_GENERIC_G030J6MX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G0
#define FLPROG_CORE_STM32_G030
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G030K6TX) 
#define FLPROG_CORE_NAME "GENERIC G030K6TX"
#define FLPROG_CORE_CODE 769
#define FLPROG_CORE_GENERIC_G030K6TX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G0
#define FLPROG_CORE_STM32_G030
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G030K8TX) 
#define FLPROG_CORE_NAME "GENERIC G030K8TX"
#define FLPROG_CORE_CODE 770
#define FLPROG_CORE_GENERIC_G030K8TX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G0
#define FLPROG_CORE_STM32_G030
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_DISCO_G0316) 
#define FLPROG_CORE_NAME "DISCO G0316"
#define FLPROG_CORE_CODE 360
#define FLPROG_CORE_DISCO_G0316
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G0
#define FLPROG_CORE_STM32_G031
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G031C4TX) 
#define FLPROG_CORE_NAME "GENERIC G031C4TX"
#define FLPROG_CORE_CODE 771
#define FLPROG_CORE_GENERIC_G031C4TX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G0
#define FLPROG_CORE_STM32_G031
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G031C4UX) 
#define FLPROG_CORE_NAME "GENERIC G031C4UX"
#define FLPROG_CORE_CODE 772
#define FLPROG_CORE_GENERIC_G031C4UX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G0
#define FLPROG_CORE_STM32_G031
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G031C6TX) 
#define FLPROG_CORE_NAME "GENERIC G031C6TX"
#define FLPROG_CORE_CODE 773
#define FLPROG_CORE_GENERIC_G031C6TX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G0
#define FLPROG_CORE_STM32_G031
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G031C6UX) 
#define FLPROG_CORE_NAME "GENERIC G031C6UX"
#define FLPROG_CORE_CODE 774
#define FLPROG_CORE_GENERIC_G031C6UX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G0
#define FLPROG_CORE_STM32_G031
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G031C8TX) 
#define FLPROG_CORE_NAME "GENERIC G031C8TX"
#define FLPROG_CORE_CODE 775
#define FLPROG_CORE_GENERIC_G031C8TX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G0
#define FLPROG_CORE_STM32_G031
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G031C8UX) 
#define FLPROG_CORE_NAME "GENERIC G031C8UX"
#define FLPROG_CORE_CODE 776
#define FLPROG_CORE_GENERIC_G031C8UX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G0
#define FLPROG_CORE_STM32_G031
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G031F4PX) 
#define FLPROG_CORE_NAME "GENERIC G031F4PX"
#define FLPROG_CORE_CODE 777
#define FLPROG_CORE_GENERIC_G031F4PX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G0
#define FLPROG_CORE_STM32_G031
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G031F6PX) 
#define FLPROG_CORE_NAME "GENERIC G031F6PX"
