Totuin/Flprog_Utilites/src/selectCore/flprogSelectCore_stm32.h
#define FLPROG_CORE_CODE 778
#define FLPROG_CORE_GENERIC_G031F6PX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G0
#define FLPROG_CORE_STM32_G031
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G031F8PX) 
#define FLPROG_CORE_NAME "GENERIC G031F8PX"
#define FLPROG_CORE_CODE 779
#define FLPROG_CORE_GENERIC_G031F8PX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G0
#define FLPROG_CORE_STM32_G031
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G031G4UX) 
#define FLPROG_CORE_NAME "GENERIC G031G4UX"
#define FLPROG_CORE_CODE 780
#define FLPROG_CORE_GENERIC_G031G4UX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G0
#define FLPROG_CORE_STM32_G031
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G031G6UX) 
#define FLPROG_CORE_NAME "GENERIC G031G6UX"
#define FLPROG_CORE_CODE 781
#define FLPROG_CORE_GENERIC_G031G6UX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G0
#define FLPROG_CORE_STM32_G031
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G031G8UX) 
#define FLPROG_CORE_NAME "GENERIC G031G8UX"
#define FLPROG_CORE_CODE 782
#define FLPROG_CORE_GENERIC_G031G8UX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G0
#define FLPROG_CORE_STM32_G031
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G031J4MX) 
#define FLPROG_CORE_NAME "GENERIC G031J4MX"
#define FLPROG_CORE_CODE 783
#define FLPROG_CORE_GENERIC_G031J4MX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G0
#define FLPROG_CORE_STM32_G031
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G031J6MX) 
#define FLPROG_CORE_NAME "GENERIC G031J6MX"
#define FLPROG_CORE_CODE 784
#define FLPROG_CORE_GENERIC_G031J6MX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G0
#define FLPROG_CORE_STM32_G031
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G031K4TX) 
#define FLPROG_CORE_NAME "GENERIC G031K4TX"
#define FLPROG_CORE_CODE 785
#define FLPROG_CORE_GENERIC_G031K4TX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G0
#define FLPROG_CORE_STM32_G031
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G031K4UX) 
#define FLPROG_CORE_NAME "GENERIC G031K4UX"
#define FLPROG_CORE_CODE 786
#define FLPROG_CORE_GENERIC_G031K4UX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G0
#define FLPROG_CORE_STM32_G031
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G031K6TX) 
#define FLPROG_CORE_NAME "GENERIC G031K6TX"
#define FLPROG_CORE_CODE 787
#define FLPROG_CORE_GENERIC_G031K6TX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G0
#define FLPROG_CORE_STM32_G031
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G031K6UX) 
#define FLPROG_CORE_NAME "GENERIC G031K6UX"
#define FLPROG_CORE_CODE 788
#define FLPROG_CORE_GENERIC_G031K6UX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G0
#define FLPROG_CORE_STM32_G031
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G031K8TX) 
#define FLPROG_CORE_NAME "GENERIC G031K8TX"
#define FLPROG_CORE_CODE 789
#define FLPROG_CORE_GENERIC_G031K8TX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G0
#define FLPROG_CORE_STM32_G031
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G031K8UX) 
#define FLPROG_CORE_NAME "GENERIC G031K8UX"
#define FLPROG_CORE_CODE 790
#define FLPROG_CORE_GENERIC_G031K8UX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G0
#define FLPROG_CORE_STM32_G031
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G031Y8YX) 
#define FLPROG_CORE_NAME "GENERIC G031Y8YX"
#define FLPROG_CORE_CODE 791
#define FLPROG_CORE_GENERIC_G031Y8YX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G0
#define FLPROG_CORE_STM32_G031
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_NUCLEO_G031K8) 
#define FLPROG_CORE_NAME "NUCLEO G031K8"
#define FLPROG_CORE_CODE 1396
#define FLPROG_CORE_NUCLEO_G031K8
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G0
#define FLPROG_CORE_STM32_G031
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G041C6TX) 
#define FLPROG_CORE_NAME "GENERIC G041C6TX"
#define FLPROG_CORE_CODE 792
#define FLPROG_CORE_GENERIC_G041C6TX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G0
#define FLPROG_CORE_STM32_G041
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G041C6UX) 
#define FLPROG_CORE_NAME "GENERIC G041C6UX"
#define FLPROG_CORE_CODE 793
#define FLPROG_CORE_GENERIC_G041C6UX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G0
#define FLPROG_CORE_STM32_G041
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G041C8TX) 
#define FLPROG_CORE_NAME "GENERIC G041C8TX"
#define FLPROG_CORE_CODE 794
#define FLPROG_CORE_GENERIC_G041C8TX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G0
#define FLPROG_CORE_STM32_G041
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G041C8UX) 
#define FLPROG_CORE_NAME "GENERIC G041C8UX"
#define FLPROG_CORE_CODE 795
#define FLPROG_CORE_GENERIC_G041C8UX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G0
#define FLPROG_CORE_STM32_G041
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G041F6PX) 
#define FLPROG_CORE_NAME "GENERIC G041F6PX"
#define FLPROG_CORE_CODE 796
#define FLPROG_CORE_GENERIC_G041F6PX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G0
#define FLPROG_CORE_STM32_G041
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G041F8PX) 
#define FLPROG_CORE_NAME "GENERIC G041F8PX"
#define FLPROG_CORE_CODE 797
#define FLPROG_CORE_GENERIC_G041F8PX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G0
#define FLPROG_CORE_STM32_G041
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G041G6UX) 
#define FLPROG_CORE_NAME "GENERIC G041G6UX"
#define FLPROG_CORE_CODE 798
#define FLPROG_CORE_GENERIC_G041G6UX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G0
#define FLPROG_CORE_STM32_G041
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G041G8UX) 
#define FLPROG_CORE_NAME "GENERIC G041G8UX"
#define FLPROG_CORE_CODE 799
#define FLPROG_CORE_GENERIC_G041G8UX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G0
#define FLPROG_CORE_STM32_G041
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G041J6MX) 
#define FLPROG_CORE_NAME "GENERIC G041J6MX"
#define FLPROG_CORE_CODE 800
#define FLPROG_CORE_GENERIC_G041J6MX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G0
#define FLPROG_CORE_STM32_G041
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G041K6TX) 
#define FLPROG_CORE_NAME "GENERIC G041K6TX"
#define FLPROG_CORE_CODE 801
#define FLPROG_CORE_GENERIC_G041K6TX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G0
#define FLPROG_CORE_STM32_G041
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G041K6UX) 
#define FLPROG_CORE_NAME "GENERIC G041K6UX"
#define FLPROG_CORE_CODE 802
#define FLPROG_CORE_GENERIC_G041K6UX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G0
#define FLPROG_CORE_STM32_G041
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G041K8TX) 
#define FLPROG_CORE_NAME "GENERIC G041K8TX"
#define FLPROG_CORE_CODE 803
#define FLPROG_CORE_GENERIC_G041K8TX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G0
#define FLPROG_CORE_STM32_G041
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G041K8UX) 
#define FLPROG_CORE_NAME "GENERIC G041K8UX"
#define FLPROG_CORE_CODE 804
#define FLPROG_CORE_GENERIC_G041K8UX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G0
#define FLPROG_CORE_STM32_G041
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G041Y8YX) 
#define FLPROG_CORE_NAME "GENERIC G041Y8YX"
#define FLPROG_CORE_CODE 805
#define FLPROG_CORE_GENERIC_G041Y8YX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G0
#define FLPROG_CORE_STM32_G041
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G050C6TX) 
#define FLPROG_CORE_NAME "GENERIC G050C6TX"
#define FLPROG_CORE_CODE 806
#define FLPROG_CORE_GENERIC_G050C6TX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G0
#define FLPROG_CORE_STM32_G050
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G050C8TX) 
#define FLPROG_CORE_NAME "GENERIC G050C8TX"
#define FLPROG_CORE_CODE 807
#define FLPROG_CORE_GENERIC_G050C8TX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G0
#define FLPROG_CORE_STM32_G050
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G050F6PX) 
#define FLPROG_CORE_NAME "GENERIC G050F6PX"
#define FLPROG_CORE_CODE 808
#define FLPROG_CORE_GENERIC_G050F6PX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G0
#define FLPROG_CORE_STM32_G050
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G050K6TX) 
#define FLPROG_CORE_NAME "GENERIC G050K6TX"
#define FLPROG_CORE_CODE 809
#define FLPROG_CORE_GENERIC_G050K6TX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G0
#define FLPROG_CORE_STM32_G050
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G050K8TX) 
#define FLPROG_CORE_NAME "GENERIC G050K8TX"
#define FLPROG_CORE_CODE 810
#define FLPROG_CORE_GENERIC_G050K8TX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G0
#define FLPROG_CORE_STM32_G050
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G051C6TX) 
#define FLPROG_CORE_NAME "GENERIC G051C6TX"
#define FLPROG_CORE_CODE 811
#define FLPROG_CORE_GENERIC_G051C6TX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G0
#define FLPROG_CORE_STM32_G051
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G051C6UX) 
#define FLPROG_CORE_NAME "GENERIC G051C6UX"
#define FLPROG_CORE_CODE 812
#define FLPROG_CORE_GENERIC_G051C6UX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G0
#define FLPROG_CORE_STM32_G051
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G051C8TX) 
#define FLPROG_CORE_NAME "GENERIC G051C8TX"
#define FLPROG_CORE_CODE 813
#define FLPROG_CORE_GENERIC_G051C8TX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G0
#define FLPROG_CORE_STM32_G051
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G051C8UX) 
#define FLPROG_CORE_NAME "GENERIC G051C8UX"
#define FLPROG_CORE_CODE 814
#define FLPROG_CORE_GENERIC_G051C8UX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G0
#define FLPROG_CORE_STM32_G051
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G051F6PX) 
#define FLPROG_CORE_NAME "GENERIC G051F6PX"
#define FLPROG_CORE_CODE 815
#define FLPROG_CORE_GENERIC_G051F6PX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G0
#define FLPROG_CORE_STM32_G051
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G051F8PX) 
#define FLPROG_CORE_NAME "GENERIC G051F8PX"
#define FLPROG_CORE_CODE 816
#define FLPROG_CORE_GENERIC_G051F8PX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G0
#define FLPROG_CORE_STM32_G051
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G051F8YX) 
#define FLPROG_CORE_NAME "GENERIC G051F8YX"
#define FLPROG_CORE_CODE 817
#define FLPROG_CORE_GENERIC_G051F8YX
