Totuin/Flprog_Utilites/src/selectCore/flprogSelectCore_stm32.h
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G0
#define FLPROG_CORE_STM32_G051
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G051G6UX) 
#define FLPROG_CORE_NAME "GENERIC G051G6UX"
#define FLPROG_CORE_CODE 818
#define FLPROG_CORE_GENERIC_G051G6UX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G0
#define FLPROG_CORE_STM32_G051
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G051G8UX) 
#define FLPROG_CORE_NAME "GENERIC G051G8UX"
#define FLPROG_CORE_CODE 819
#define FLPROG_CORE_GENERIC_G051G8UX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G0
#define FLPROG_CORE_STM32_G051
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G051K6TX) 
#define FLPROG_CORE_NAME "GENERIC G051K6TX"
#define FLPROG_CORE_CODE 820
#define FLPROG_CORE_GENERIC_G051K6TX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G0
#define FLPROG_CORE_STM32_G051
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G051K6UX) 
#define FLPROG_CORE_NAME "GENERIC G051K6UX"
#define FLPROG_CORE_CODE 821
#define FLPROG_CORE_GENERIC_G051K6UX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G0
#define FLPROG_CORE_STM32_G051
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G051K8TX) 
#define FLPROG_CORE_NAME "GENERIC G051K8TX"
#define FLPROG_CORE_CODE 822
#define FLPROG_CORE_GENERIC_G051K8TX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G0
#define FLPROG_CORE_STM32_G051
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G051K8UX) 
#define FLPROG_CORE_NAME "GENERIC G051K8UX"
#define FLPROG_CORE_CODE 823
#define FLPROG_CORE_GENERIC_G051K8UX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G0
#define FLPROG_CORE_STM32_G051
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G061C6TX) 
#define FLPROG_CORE_NAME "GENERIC G061C6TX"
#define FLPROG_CORE_CODE 824
#define FLPROG_CORE_GENERIC_G061C6TX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G0
#define FLPROG_CORE_STM32_G061
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G061C6UX) 
#define FLPROG_CORE_NAME "GENERIC G061C6UX"
#define FLPROG_CORE_CODE 825
#define FLPROG_CORE_GENERIC_G061C6UX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G0
#define FLPROG_CORE_STM32_G061
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G061C8TX) 
#define FLPROG_CORE_NAME "GENERIC G061C8TX"
#define FLPROG_CORE_CODE 826
#define FLPROG_CORE_GENERIC_G061C8TX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G0
#define FLPROG_CORE_STM32_G061
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G061C8UX) 
#define FLPROG_CORE_NAME "GENERIC G061C8UX"
#define FLPROG_CORE_CODE 827
#define FLPROG_CORE_GENERIC_G061C8UX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G0
#define FLPROG_CORE_STM32_G061
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G061F6PX) 
#define FLPROG_CORE_NAME "GENERIC G061F6PX"
#define FLPROG_CORE_CODE 828
#define FLPROG_CORE_GENERIC_G061F6PX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G0
#define FLPROG_CORE_STM32_G061
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G061F8PX) 
#define FLPROG_CORE_NAME "GENERIC G061F8PX"
#define FLPROG_CORE_CODE 829
#define FLPROG_CORE_GENERIC_G061F8PX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G0
#define FLPROG_CORE_STM32_G061
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G061F8YX) 
#define FLPROG_CORE_NAME "GENERIC G061F8YX"
#define FLPROG_CORE_CODE 830
#define FLPROG_CORE_GENERIC_G061F8YX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G0
#define FLPROG_CORE_STM32_G061
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G061G6UX) 
#define FLPROG_CORE_NAME "GENERIC G061G6UX"
#define FLPROG_CORE_CODE 831
#define FLPROG_CORE_GENERIC_G061G6UX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G0
#define FLPROG_CORE_STM32_G061
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G061G8UX) 
#define FLPROG_CORE_NAME "GENERIC G061G8UX"
#define FLPROG_CORE_CODE 832
#define FLPROG_CORE_GENERIC_G061G8UX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G0
#define FLPROG_CORE_STM32_G061
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G061K6TX) 
#define FLPROG_CORE_NAME "GENERIC G061K6TX"
#define FLPROG_CORE_CODE 833
#define FLPROG_CORE_GENERIC_G061K6TX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G0
#define FLPROG_CORE_STM32_G061
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G061K6UX) 
#define FLPROG_CORE_NAME "GENERIC G061K6UX"
#define FLPROG_CORE_CODE 834
#define FLPROG_CORE_GENERIC_G061K6UX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G0
#define FLPROG_CORE_STM32_G061
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G061K8TX) 
#define FLPROG_CORE_NAME "GENERIC G061K8TX"
#define FLPROG_CORE_CODE 835
#define FLPROG_CORE_GENERIC_G061K8TX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G0
#define FLPROG_CORE_STM32_G061
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G061K8UX) 
#define FLPROG_CORE_NAME "GENERIC G061K8UX"
#define FLPROG_CORE_CODE 836
#define FLPROG_CORE_GENERIC_G061K8UX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G0
#define FLPROG_CORE_STM32_G061
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G070CBTX) 
#define FLPROG_CORE_NAME "GENERIC G070CBTX"
#define FLPROG_CORE_CODE 837
#define FLPROG_CORE_GENERIC_G070CBTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G0
#define FLPROG_CORE_STM32_G070
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G070KBTX) 
#define FLPROG_CORE_NAME "GENERIC G070KBTX"
#define FLPROG_CORE_CODE 838
#define FLPROG_CORE_GENERIC_G070KBTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G0
#define FLPROG_CORE_STM32_G070
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G070RBTX) 
#define FLPROG_CORE_NAME "GENERIC G070RBTX"
#define FLPROG_CORE_CODE 839
#define FLPROG_CORE_GENERIC_G070RBTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G0
#define FLPROG_CORE_STM32_G070
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_NUCLEO_G070RB) 
#define FLPROG_CORE_NAME "NUCLEO G070RB"
#define FLPROG_CORE_CODE 1397
#define FLPROG_CORE_NUCLEO_G070RB
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G0
#define FLPROG_CORE_STM32_G070
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_AGAFIA_SG0) 
#define FLPROG_CORE_NAME "AGAFIA SG0"
#define FLPROG_CORE_CODE 321
#define FLPROG_CORE_AGAFIA_SG0
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G0
#define FLPROG_CORE_STM32_G071
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G071C6TX) 
#define FLPROG_CORE_NAME "GENERIC G071C6TX"
#define FLPROG_CORE_CODE 840
#define FLPROG_CORE_GENERIC_G071C6TX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G0
#define FLPROG_CORE_STM32_G071
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G071C6UX) 
#define FLPROG_CORE_NAME "GENERIC G071C6UX"
#define FLPROG_CORE_CODE 841
#define FLPROG_CORE_GENERIC_G071C6UX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G0
#define FLPROG_CORE_STM32_G071
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G071C8TX) 
#define FLPROG_CORE_NAME "GENERIC G071C8TX"
#define FLPROG_CORE_CODE 842
#define FLPROG_CORE_GENERIC_G071C8TX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G0
#define FLPROG_CORE_STM32_G071
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G071C8UX) 
#define FLPROG_CORE_NAME "GENERIC G071C8UX"
#define FLPROG_CORE_CODE 843
#define FLPROG_CORE_GENERIC_G071C8UX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G0
#define FLPROG_CORE_STM32_G071
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G071CBTX) 
#define FLPROG_CORE_NAME "GENERIC G071CBTX"
#define FLPROG_CORE_CODE 844
#define FLPROG_CORE_GENERIC_G071CBTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G0
#define FLPROG_CORE_STM32_G071
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G071CBUX) 
#define FLPROG_CORE_NAME "GENERIC G071CBUX"
#define FLPROG_CORE_CODE 845
#define FLPROG_CORE_GENERIC_G071CBUX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G0
#define FLPROG_CORE_STM32_G071
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G071EBYX) 
#define FLPROG_CORE_NAME "GENERIC G071EBYX"
#define FLPROG_CORE_CODE 846
#define FLPROG_CORE_GENERIC_G071EBYX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G0
#define FLPROG_CORE_STM32_G071
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G071G6UX) 
#define FLPROG_CORE_NAME "GENERIC G071G6UX"
#define FLPROG_CORE_CODE 847
#define FLPROG_CORE_GENERIC_G071G6UX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G0
#define FLPROG_CORE_STM32_G071
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G071G8UX) 
#define FLPROG_CORE_NAME "GENERIC G071G8UX"
#define FLPROG_CORE_CODE 848
#define FLPROG_CORE_GENERIC_G071G8UX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G0
#define FLPROG_CORE_STM32_G071
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G071G8UXN) 
#define FLPROG_CORE_NAME "GENERIC G071G8UXN"
#define FLPROG_CORE_CODE 849
#define FLPROG_CORE_GENERIC_G071G8UXN
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G0
#define FLPROG_CORE_STM32_G071
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G071GBUX) 
#define FLPROG_CORE_NAME "GENERIC G071GBUX"
#define FLPROG_CORE_CODE 850
#define FLPROG_CORE_GENERIC_G071GBUX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G0
#define FLPROG_CORE_STM32_G071
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G071GBUXN) 
#define FLPROG_CORE_NAME "GENERIC G071GBUXN"
#define FLPROG_CORE_CODE 851
#define FLPROG_CORE_GENERIC_G071GBUXN
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G0
#define FLPROG_CORE_STM32_G071
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G071K6TX) 
#define FLPROG_CORE_NAME "GENERIC G071K6TX"
#define FLPROG_CORE_CODE 852
#define FLPROG_CORE_GENERIC_G071K6TX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G0
#define FLPROG_CORE_STM32_G071
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G071K6UX) 
#define FLPROG_CORE_NAME "GENERIC G071K6UX"
#define FLPROG_CORE_CODE 853
#define FLPROG_CORE_GENERIC_G071K6UX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G0
#define FLPROG_CORE_STM32_G071
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G071K8TX) 
#define FLPROG_CORE_NAME "GENERIC G071K8TX"
#define FLPROG_CORE_CODE 854
#define FLPROG_CORE_GENERIC_G071K8TX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G0
#define FLPROG_CORE_STM32_G071
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G071K8UX) 
#define FLPROG_CORE_NAME "GENERIC G071K8UX"
#define FLPROG_CORE_CODE 855
#define FLPROG_CORE_GENERIC_G071K8UX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
