Totuin/Flprog_Utilites/src/selectCore/flprogSelectCore_stm32.h
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G0
#define FLPROG_CORE_STM32_G071
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G071KBTX) 
#define FLPROG_CORE_NAME "GENERIC G071KBTX"
#define FLPROG_CORE_CODE 856
#define FLPROG_CORE_GENERIC_G071KBTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G0
#define FLPROG_CORE_STM32_G071
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G071KBUX) 
#define FLPROG_CORE_NAME "GENERIC G071KBUX"
#define FLPROG_CORE_CODE 857
#define FLPROG_CORE_GENERIC_G071KBUX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G0
#define FLPROG_CORE_STM32_G071
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G071R6TX) 
#define FLPROG_CORE_NAME "GENERIC G071R6TX"
#define FLPROG_CORE_CODE 858
#define FLPROG_CORE_GENERIC_G071R6TX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G0
#define FLPROG_CORE_STM32_G071
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G071R8TX) 
#define FLPROG_CORE_NAME "GENERIC G071R8TX"
#define FLPROG_CORE_CODE 859
#define FLPROG_CORE_GENERIC_G071R8TX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G0
#define FLPROG_CORE_STM32_G071
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G071RBIX) 
#define FLPROG_CORE_NAME "GENERIC G071RBIX"
#define FLPROG_CORE_CODE 860
#define FLPROG_CORE_GENERIC_G071RBIX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G0
#define FLPROG_CORE_STM32_G071
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G071RBTX) 
#define FLPROG_CORE_NAME "GENERIC G071RBTX"
#define FLPROG_CORE_CODE 861
#define FLPROG_CORE_GENERIC_G071RBTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G0
#define FLPROG_CORE_STM32_G071
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_NUCLEO_G071RB) 
#define FLPROG_CORE_NAME "NUCLEO G071RB"
#define FLPROG_CORE_CODE 1398
#define FLPROG_CORE_NUCLEO_G071RB
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G0
#define FLPROG_CORE_STM32_G071
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G081CBTX) 
#define FLPROG_CORE_NAME "GENERIC G081CBTX"
#define FLPROG_CORE_CODE 862
#define FLPROG_CORE_GENERIC_G081CBTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G0
#define FLPROG_CORE_STM32_G081
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G081CBUX) 
#define FLPROG_CORE_NAME "GENERIC G081CBUX"
#define FLPROG_CORE_CODE 863
#define FLPROG_CORE_GENERIC_G081CBUX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G0
#define FLPROG_CORE_STM32_G081
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G081EBYX) 
#define FLPROG_CORE_NAME "GENERIC G081EBYX"
#define FLPROG_CORE_CODE 864
#define FLPROG_CORE_GENERIC_G081EBYX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G0
#define FLPROG_CORE_STM32_G081
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G081GBUX) 
#define FLPROG_CORE_NAME "GENERIC G081GBUX"
#define FLPROG_CORE_CODE 865
#define FLPROG_CORE_GENERIC_G081GBUX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G0
#define FLPROG_CORE_STM32_G081
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G081GBUXN) 
#define FLPROG_CORE_NAME "GENERIC G081GBUXN"
#define FLPROG_CORE_CODE 866
#define FLPROG_CORE_GENERIC_G081GBUXN
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G0
#define FLPROG_CORE_STM32_G081
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G081KBTX) 
#define FLPROG_CORE_NAME "GENERIC G081KBTX"
#define FLPROG_CORE_CODE 867
#define FLPROG_CORE_GENERIC_G081KBTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G0
#define FLPROG_CORE_STM32_G081
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G081KBUX) 
#define FLPROG_CORE_NAME "GENERIC G081KBUX"
#define FLPROG_CORE_CODE 868
#define FLPROG_CORE_GENERIC_G081KBUX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G0
#define FLPROG_CORE_STM32_G081
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G081RBIX) 
#define FLPROG_CORE_NAME "GENERIC G081RBIX"
#define FLPROG_CORE_CODE 869
#define FLPROG_CORE_GENERIC_G081RBIX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G0
#define FLPROG_CORE_STM32_G081
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G081RBTX) 
#define FLPROG_CORE_NAME "GENERIC G081RBTX"
#define FLPROG_CORE_CODE 870
#define FLPROG_CORE_GENERIC_G081RBTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G0
#define FLPROG_CORE_STM32_G081
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G0B0CETX) 
#define FLPROG_CORE_NAME "GENERIC G0B0CETX"
#define FLPROG_CORE_CODE 871
#define FLPROG_CORE_GENERIC_G0B0CETX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G0
#define FLPROG_CORE_STM32_G0B0
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G0B0RETX) 
#define FLPROG_CORE_NAME "GENERIC G0B0RETX"
#define FLPROG_CORE_CODE 872
#define FLPROG_CORE_GENERIC_G0B0RETX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G0
#define FLPROG_CORE_STM32_G0B0
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G0B0VETX) 
#define FLPROG_CORE_NAME "GENERIC G0B0VETX"
#define FLPROG_CORE_CODE 873
#define FLPROG_CORE_GENERIC_G0B0VETX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G0
#define FLPROG_CORE_STM32_G0B0
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_EBB42_V1_1) 
#define FLPROG_CORE_NAME "EBB42 V1 1"
#define FLPROG_CORE_CODE 365
#define FLPROG_CORE_EBB42_V1_1
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G0
#define FLPROG_CORE_STM32_G0B1
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G0B1CBTX) 
#define FLPROG_CORE_NAME "GENERIC G0B1CBTX"
#define FLPROG_CORE_CODE 874
#define FLPROG_CORE_GENERIC_G0B1CBTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G0
#define FLPROG_CORE_STM32_G0B1
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G0B1CBUX) 
#define FLPROG_CORE_NAME "GENERIC G0B1CBUX"
#define FLPROG_CORE_CODE 875
#define FLPROG_CORE_GENERIC_G0B1CBUX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G0
#define FLPROG_CORE_STM32_G0B1
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G0B1CCTX) 
#define FLPROG_CORE_NAME "GENERIC G0B1CCTX"
#define FLPROG_CORE_CODE 876
#define FLPROG_CORE_GENERIC_G0B1CCTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G0
#define FLPROG_CORE_STM32_G0B1
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G0B1CCUX) 
#define FLPROG_CORE_NAME "GENERIC G0B1CCUX"
#define FLPROG_CORE_CODE 877
#define FLPROG_CORE_GENERIC_G0B1CCUX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G0
#define FLPROG_CORE_STM32_G0B1
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G0B1CETX) 
#define FLPROG_CORE_NAME "GENERIC G0B1CETX"
#define FLPROG_CORE_CODE 878
#define FLPROG_CORE_GENERIC_G0B1CETX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G0
#define FLPROG_CORE_STM32_G0B1
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G0B1CEUX) 
#define FLPROG_CORE_NAME "GENERIC G0B1CEUX"
#define FLPROG_CORE_CODE 879
#define FLPROG_CORE_GENERIC_G0B1CEUX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G0
#define FLPROG_CORE_STM32_G0B1
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G0B1KBTX) 
#define FLPROG_CORE_NAME "GENERIC G0B1KBTX"
#define FLPROG_CORE_CODE 880
#define FLPROG_CORE_GENERIC_G0B1KBTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G0
#define FLPROG_CORE_STM32_G0B1
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G0B1KBUX) 
#define FLPROG_CORE_NAME "GENERIC G0B1KBUX"
#define FLPROG_CORE_CODE 881
#define FLPROG_CORE_GENERIC_G0B1KBUX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G0
#define FLPROG_CORE_STM32_G0B1
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G0B1KCTX) 
#define FLPROG_CORE_NAME "GENERIC G0B1KCTX"
#define FLPROG_CORE_CODE 882
#define FLPROG_CORE_GENERIC_G0B1KCTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G0
#define FLPROG_CORE_STM32_G0B1
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G0B1KCUX) 
#define FLPROG_CORE_NAME "GENERIC G0B1KCUX"
#define FLPROG_CORE_CODE 883
#define FLPROG_CORE_GENERIC_G0B1KCUX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G0
#define FLPROG_CORE_STM32_G0B1
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G0B1KETX) 
#define FLPROG_CORE_NAME "GENERIC G0B1KETX"
#define FLPROG_CORE_CODE 884
#define FLPROG_CORE_GENERIC_G0B1KETX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G0
#define FLPROG_CORE_STM32_G0B1
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G0B1KEUX) 
#define FLPROG_CORE_NAME "GENERIC G0B1KEUX"
#define FLPROG_CORE_CODE 885
#define FLPROG_CORE_GENERIC_G0B1KEUX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G0
#define FLPROG_CORE_STM32_G0B1
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G0B1MBTX) 
#define FLPROG_CORE_NAME "GENERIC G0B1MBTX"
#define FLPROG_CORE_CODE 886
#define FLPROG_CORE_GENERIC_G0B1MBTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G0
#define FLPROG_CORE_STM32_G0B1
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G0B1MCTX) 
#define FLPROG_CORE_NAME "GENERIC G0B1MCTX"
#define FLPROG_CORE_CODE 887
#define FLPROG_CORE_GENERIC_G0B1MCTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G0
#define FLPROG_CORE_STM32_G0B1
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G0B1METX) 
#define FLPROG_CORE_NAME "GENERIC G0B1METX"
#define FLPROG_CORE_CODE 888
#define FLPROG_CORE_GENERIC_G0B1METX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G0
#define FLPROG_CORE_STM32_G0B1
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G0B1NEYX) 
#define FLPROG_CORE_NAME "GENERIC G0B1NEYX"
#define FLPROG_CORE_CODE 889
#define FLPROG_CORE_GENERIC_G0B1NEYX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G0
#define FLPROG_CORE_STM32_G0B1
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G0B1RBTX) 
#define FLPROG_CORE_NAME "GENERIC G0B1RBTX"
#define FLPROG_CORE_CODE 890
#define FLPROG_CORE_GENERIC_G0B1RBTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G0
#define FLPROG_CORE_STM32_G0B1
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G0B1RCTX) 
#define FLPROG_CORE_NAME "GENERIC G0B1RCTX"
#define FLPROG_CORE_CODE 891
#define FLPROG_CORE_GENERIC_G0B1RCTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G0
#define FLPROG_CORE_STM32_G0B1
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G0B1RETX) 
#define FLPROG_CORE_NAME "GENERIC G0B1RETX"
#define FLPROG_CORE_CODE 892
#define FLPROG_CORE_GENERIC_G0B1RETX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G0
#define FLPROG_CORE_STM32_G0B1
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G0B1VBIX) 
#define FLPROG_CORE_NAME "GENERIC G0B1VBIX"
#define FLPROG_CORE_CODE 893
#define FLPROG_CORE_GENERIC_G0B1VBIX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
