Totuin/Flprog_Utilites/src/selectCore/flprogSelectCore_stm32.h
#define FLPROG_CORE_STM32_G0
#define FLPROG_CORE_STM32_G0B1
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G0B1VBTX) 
#define FLPROG_CORE_NAME "GENERIC G0B1VBTX"
#define FLPROG_CORE_CODE 894
#define FLPROG_CORE_GENERIC_G0B1VBTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G0
#define FLPROG_CORE_STM32_G0B1
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G0B1VCIX) 
#define FLPROG_CORE_NAME "GENERIC G0B1VCIX"
#define FLPROG_CORE_CODE 895
#define FLPROG_CORE_GENERIC_G0B1VCIX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G0
#define FLPROG_CORE_STM32_G0B1
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G0B1VCTX) 
#define FLPROG_CORE_NAME "GENERIC G0B1VCTX"
#define FLPROG_CORE_CODE 896
#define FLPROG_CORE_GENERIC_G0B1VCTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G0
#define FLPROG_CORE_STM32_G0B1
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G0B1VEIX) 
#define FLPROG_CORE_NAME "GENERIC G0B1VEIX"
#define FLPROG_CORE_CODE 897
#define FLPROG_CORE_GENERIC_G0B1VEIX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G0
#define FLPROG_CORE_STM32_G0B1
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G0B1VETX) 
#define FLPROG_CORE_NAME "GENERIC G0B1VETX"
#define FLPROG_CORE_CODE 898
#define FLPROG_CORE_GENERIC_G0B1VETX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G0
#define FLPROG_CORE_STM32_G0B1
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_NUCLEO_G0B1RE) 
#define FLPROG_CORE_NAME "NUCLEO G0B1RE"
#define FLPROG_CORE_CODE 1399
#define FLPROG_CORE_NUCLEO_G0B1RE
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G0
#define FLPROG_CORE_STM32_G0B1
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G0C1CCTX) 
#define FLPROG_CORE_NAME "GENERIC G0C1CCTX"
#define FLPROG_CORE_CODE 899
#define FLPROG_CORE_GENERIC_G0C1CCTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G0
#define FLPROG_CORE_STM32_G0C1
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G0C1CCUX) 
#define FLPROG_CORE_NAME "GENERIC G0C1CCUX"
#define FLPROG_CORE_CODE 900
#define FLPROG_CORE_GENERIC_G0C1CCUX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G0
#define FLPROG_CORE_STM32_G0C1
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G0C1CETX) 
#define FLPROG_CORE_NAME "GENERIC G0C1CETX"
#define FLPROG_CORE_CODE 901
#define FLPROG_CORE_GENERIC_G0C1CETX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G0
#define FLPROG_CORE_STM32_G0C1
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G0C1CEUX) 
#define FLPROG_CORE_NAME "GENERIC G0C1CEUX"
#define FLPROG_CORE_CODE 902
#define FLPROG_CORE_GENERIC_G0C1CEUX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G0
#define FLPROG_CORE_STM32_G0C1
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G0C1KCTX) 
#define FLPROG_CORE_NAME "GENERIC G0C1KCTX"
#define FLPROG_CORE_CODE 903
#define FLPROG_CORE_GENERIC_G0C1KCTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G0
#define FLPROG_CORE_STM32_G0C1
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G0C1KCUX) 
#define FLPROG_CORE_NAME "GENERIC G0C1KCUX"
#define FLPROG_CORE_CODE 904
#define FLPROG_CORE_GENERIC_G0C1KCUX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G0
#define FLPROG_CORE_STM32_G0C1
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G0C1KETX) 
#define FLPROG_CORE_NAME "GENERIC G0C1KETX"
#define FLPROG_CORE_CODE 905
#define FLPROG_CORE_GENERIC_G0C1KETX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G0
#define FLPROG_CORE_STM32_G0C1
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G0C1KEUX) 
#define FLPROG_CORE_NAME "GENERIC G0C1KEUX"
#define FLPROG_CORE_CODE 906
#define FLPROG_CORE_GENERIC_G0C1KEUX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G0
#define FLPROG_CORE_STM32_G0C1
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G0C1MCTX) 
#define FLPROG_CORE_NAME "GENERIC G0C1MCTX"
#define FLPROG_CORE_CODE 907
#define FLPROG_CORE_GENERIC_G0C1MCTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G0
#define FLPROG_CORE_STM32_G0C1
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G0C1METX) 
#define FLPROG_CORE_NAME "GENERIC G0C1METX"
#define FLPROG_CORE_CODE 908
#define FLPROG_CORE_GENERIC_G0C1METX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G0
#define FLPROG_CORE_STM32_G0C1
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G0C1NEYX) 
#define FLPROG_CORE_NAME "GENERIC G0C1NEYX"
#define FLPROG_CORE_CODE 909
#define FLPROG_CORE_GENERIC_G0C1NEYX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G0
#define FLPROG_CORE_STM32_G0C1
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G0C1RCTX) 
#define FLPROG_CORE_NAME "GENERIC G0C1RCTX"
#define FLPROG_CORE_CODE 910
#define FLPROG_CORE_GENERIC_G0C1RCTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G0
#define FLPROG_CORE_STM32_G0C1
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G0C1RETX) 
#define FLPROG_CORE_NAME "GENERIC G0C1RETX"
#define FLPROG_CORE_CODE 911
#define FLPROG_CORE_GENERIC_G0C1RETX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G0
#define FLPROG_CORE_STM32_G0C1
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G0C1VCIX) 
#define FLPROG_CORE_NAME "GENERIC G0C1VCIX"
#define FLPROG_CORE_CODE 912
#define FLPROG_CORE_GENERIC_G0C1VCIX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G0
#define FLPROG_CORE_STM32_G0C1
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G0C1VCTX) 
#define FLPROG_CORE_NAME "GENERIC G0C1VCTX"
#define FLPROG_CORE_CODE 913
#define FLPROG_CORE_GENERIC_G0C1VCTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G0
#define FLPROG_CORE_STM32_G0C1
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G0C1VEIX) 
#define FLPROG_CORE_NAME "GENERIC G0C1VEIX"
#define FLPROG_CORE_CODE 914
#define FLPROG_CORE_GENERIC_G0C1VEIX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G0
#define FLPROG_CORE_STM32_G0C1
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G0C1VETX) 
#define FLPROG_CORE_NAME "GENERIC G0C1VETX"
#define FLPROG_CORE_CODE 915
#define FLPROG_CORE_GENERIC_G0C1VETX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G0
#define FLPROG_CORE_STM32_G0C1
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_B_G431B_ESC1) 
#define FLPROG_CORE_NAME "B G431B ESC1"
#define FLPROG_CORE_CODE 340
#define FLPROG_CORE_B_G431B_ESC1
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G4
#define FLPROG_CORE_STM32_G431
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G431C6TX) 
#define FLPROG_CORE_NAME "GENERIC G431C6TX"
#define FLPROG_CORE_CODE 916
#define FLPROG_CORE_GENERIC_G431C6TX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G4
#define FLPROG_CORE_STM32_G431
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G431C6UX) 
#define FLPROG_CORE_NAME "GENERIC G431C6UX"
#define FLPROG_CORE_CODE 917
#define FLPROG_CORE_GENERIC_G431C6UX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G4
#define FLPROG_CORE_STM32_G431
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G431C8TX) 
#define FLPROG_CORE_NAME "GENERIC G431C8TX"
#define FLPROG_CORE_CODE 918
#define FLPROG_CORE_GENERIC_G431C8TX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G4
#define FLPROG_CORE_STM32_G431
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G431C8UX) 
#define FLPROG_CORE_NAME "GENERIC G431C8UX"
#define FLPROG_CORE_CODE 919
#define FLPROG_CORE_GENERIC_G431C8UX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G4
#define FLPROG_CORE_STM32_G431
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G431CBTX) 
#define FLPROG_CORE_NAME "GENERIC G431CBTX"
#define FLPROG_CORE_CODE 920
#define FLPROG_CORE_GENERIC_G431CBTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G4
#define FLPROG_CORE_STM32_G431
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G431CBUX) 
#define FLPROG_CORE_NAME "GENERIC G431CBUX"
#define FLPROG_CORE_CODE 921
#define FLPROG_CORE_GENERIC_G431CBUX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G4
#define FLPROG_CORE_STM32_G431
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G431K6TX) 
#define FLPROG_CORE_NAME "GENERIC G431K6TX"
#define FLPROG_CORE_CODE 922
#define FLPROG_CORE_GENERIC_G431K6TX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G4
#define FLPROG_CORE_STM32_G431
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G431K6UX) 
#define FLPROG_CORE_NAME "GENERIC G431K6UX"
#define FLPROG_CORE_CODE 923
#define FLPROG_CORE_GENERIC_G431K6UX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G4
#define FLPROG_CORE_STM32_G431
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G431K8TX) 
#define FLPROG_CORE_NAME "GENERIC G431K8TX"
#define FLPROG_CORE_CODE 924
#define FLPROG_CORE_GENERIC_G431K8TX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G4
#define FLPROG_CORE_STM32_G431
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G431K8UX) 
#define FLPROG_CORE_NAME "GENERIC G431K8UX"
#define FLPROG_CORE_CODE 925
#define FLPROG_CORE_GENERIC_G431K8UX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G4
#define FLPROG_CORE_STM32_G431
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G431KBTX) 
#define FLPROG_CORE_NAME "GENERIC G431KBTX"
#define FLPROG_CORE_CODE 926
#define FLPROG_CORE_GENERIC_G431KBTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G4
#define FLPROG_CORE_STM32_G431
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G431KBUX) 
#define FLPROG_CORE_NAME "GENERIC G431KBUX"
#define FLPROG_CORE_CODE 927
#define FLPROG_CORE_GENERIC_G431KBUX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G4
#define FLPROG_CORE_STM32_G431
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G431M6TX) 
#define FLPROG_CORE_NAME "GENERIC G431M6TX"
#define FLPROG_CORE_CODE 928
#define FLPROG_CORE_GENERIC_G431M6TX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G4
#define FLPROG_CORE_STM32_G431
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G431M8TX) 
#define FLPROG_CORE_NAME "GENERIC G431M8TX"
#define FLPROG_CORE_CODE 929
#define FLPROG_CORE_GENERIC_G431M8TX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G4
#define FLPROG_CORE_STM32_G431
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G431MBTX) 
#define FLPROG_CORE_NAME "GENERIC G431MBTX"
#define FLPROG_CORE_CODE 930
#define FLPROG_CORE_GENERIC_G431MBTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G4
#define FLPROG_CORE_STM32_G431
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G431R6IX) 
#define FLPROG_CORE_NAME "GENERIC G431R6IX"
#define FLPROG_CORE_CODE 931
#define FLPROG_CORE_GENERIC_G431R6IX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G4
#define FLPROG_CORE_STM32_G431
#endif
