Totuin/Flprog_Utilites/src/selectCore/flprogSelectCore_stm32.h
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G431R6TX) 
#define FLPROG_CORE_NAME "GENERIC G431R6TX"
#define FLPROG_CORE_CODE 932
#define FLPROG_CORE_GENERIC_G431R6TX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G4
#define FLPROG_CORE_STM32_G431
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G431R8IX) 
#define FLPROG_CORE_NAME "GENERIC G431R8IX"
#define FLPROG_CORE_CODE 933
#define FLPROG_CORE_GENERIC_G431R8IX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G4
#define FLPROG_CORE_STM32_G431
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G431R8TX) 
#define FLPROG_CORE_NAME "GENERIC G431R8TX"
#define FLPROG_CORE_CODE 934
#define FLPROG_CORE_GENERIC_G431R8TX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G4
#define FLPROG_CORE_STM32_G431
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G431RBIX) 
#define FLPROG_CORE_NAME "GENERIC G431RBIX"
#define FLPROG_CORE_CODE 935
#define FLPROG_CORE_GENERIC_G431RBIX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G4
#define FLPROG_CORE_STM32_G431
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G431RBTX) 
#define FLPROG_CORE_NAME "GENERIC G431RBTX"
#define FLPROG_CORE_CODE 936
#define FLPROG_CORE_GENERIC_G431RBTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G4
#define FLPROG_CORE_STM32_G431
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G431V6TX) 
#define FLPROG_CORE_NAME "GENERIC G431V6TX"
#define FLPROG_CORE_CODE 937
#define FLPROG_CORE_GENERIC_G431V6TX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G4
#define FLPROG_CORE_STM32_G431
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G431V8TX) 
#define FLPROG_CORE_NAME "GENERIC G431V8TX"
#define FLPROG_CORE_CODE 938
#define FLPROG_CORE_GENERIC_G431V8TX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G4
#define FLPROG_CORE_STM32_G431
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G431VBTX) 
#define FLPROG_CORE_NAME "GENERIC G431VBTX"
#define FLPROG_CORE_CODE 939
#define FLPROG_CORE_GENERIC_G431VBTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G4
#define FLPROG_CORE_STM32_G431
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_NUCLEO_G431KB) 
#define FLPROG_CORE_NAME "NUCLEO G431KB"
#define FLPROG_CORE_CODE 1400
#define FLPROG_CORE_NUCLEO_G431KB
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G4
#define FLPROG_CORE_STM32_G431
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_NUCLEO_G431RB) 
#define FLPROG_CORE_NAME "NUCLEO G431RB"
#define FLPROG_CORE_CODE 1401
#define FLPROG_CORE_NUCLEO_G431RB
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G4
#define FLPROG_CORE_STM32_G431
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G441CBTX) 
#define FLPROG_CORE_NAME "GENERIC G441CBTX"
#define FLPROG_CORE_CODE 940
#define FLPROG_CORE_GENERIC_G441CBTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G4
#define FLPROG_CORE_STM32_G441
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G441CBUX) 
#define FLPROG_CORE_NAME "GENERIC G441CBUX"
#define FLPROG_CORE_CODE 941
#define FLPROG_CORE_GENERIC_G441CBUX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G4
#define FLPROG_CORE_STM32_G441
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G441KBTX) 
#define FLPROG_CORE_NAME "GENERIC G441KBTX"
#define FLPROG_CORE_CODE 942
#define FLPROG_CORE_GENERIC_G441KBTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G4
#define FLPROG_CORE_STM32_G441
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G441KBUX) 
#define FLPROG_CORE_NAME "GENERIC G441KBUX"
#define FLPROG_CORE_CODE 943
#define FLPROG_CORE_GENERIC_G441KBUX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G4
#define FLPROG_CORE_STM32_G441
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G441MBTX) 
#define FLPROG_CORE_NAME "GENERIC G441MBTX"
#define FLPROG_CORE_CODE 944
#define FLPROG_CORE_GENERIC_G441MBTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G4
#define FLPROG_CORE_STM32_G441
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G441RBIX) 
#define FLPROG_CORE_NAME "GENERIC G441RBIX"
#define FLPROG_CORE_CODE 945
#define FLPROG_CORE_GENERIC_G441RBIX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G4
#define FLPROG_CORE_STM32_G441
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G441RBTX) 
#define FLPROG_CORE_NAME "GENERIC G441RBTX"
#define FLPROG_CORE_CODE 946
#define FLPROG_CORE_GENERIC_G441RBTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G4
#define FLPROG_CORE_STM32_G441
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G441VBTX) 
#define FLPROG_CORE_NAME "GENERIC G441VBTX"
#define FLPROG_CORE_CODE 947
#define FLPROG_CORE_GENERIC_G441VBTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G4
#define FLPROG_CORE_STM32_G441
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G471CCTX) 
#define FLPROG_CORE_NAME "GENERIC G471CCTX"
#define FLPROG_CORE_CODE 948
#define FLPROG_CORE_GENERIC_G471CCTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G4
#define FLPROG_CORE_STM32_G471
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G471CETX) 
#define FLPROG_CORE_NAME "GENERIC G471CETX"
#define FLPROG_CORE_CODE 949
#define FLPROG_CORE_GENERIC_G471CETX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G4
#define FLPROG_CORE_STM32_G471
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G471MCTX) 
#define FLPROG_CORE_NAME "GENERIC G471MCTX"
#define FLPROG_CORE_CODE 950
#define FLPROG_CORE_GENERIC_G471MCTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G4
#define FLPROG_CORE_STM32_G471
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G471METX) 
#define FLPROG_CORE_NAME "GENERIC G471METX"
#define FLPROG_CORE_CODE 951
#define FLPROG_CORE_GENERIC_G471METX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G4
#define FLPROG_CORE_STM32_G471
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G471QCTX) 
#define FLPROG_CORE_NAME "GENERIC G471QCTX"
#define FLPROG_CORE_CODE 952
#define FLPROG_CORE_GENERIC_G471QCTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G4
#define FLPROG_CORE_STM32_G471
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G471QETX) 
#define FLPROG_CORE_NAME "GENERIC G471QETX"
#define FLPROG_CORE_CODE 953
#define FLPROG_CORE_GENERIC_G471QETX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G4
#define FLPROG_CORE_STM32_G471
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G471RCTX) 
#define FLPROG_CORE_NAME "GENERIC G471RCTX"
#define FLPROG_CORE_CODE 954
#define FLPROG_CORE_GENERIC_G471RCTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G4
#define FLPROG_CORE_STM32_G471
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G471RETX) 
#define FLPROG_CORE_NAME "GENERIC G471RETX"
#define FLPROG_CORE_CODE 955
#define FLPROG_CORE_GENERIC_G471RETX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G4
#define FLPROG_CORE_STM32_G471
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G471VCHX) 
#define FLPROG_CORE_NAME "GENERIC G471VCHX"
#define FLPROG_CORE_CODE 956
#define FLPROG_CORE_GENERIC_G471VCHX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G4
#define FLPROG_CORE_STM32_G471
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G471VCIX) 
#define FLPROG_CORE_NAME "GENERIC G471VCIX"
#define FLPROG_CORE_CODE 957
#define FLPROG_CORE_GENERIC_G471VCIX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G4
#define FLPROG_CORE_STM32_G471
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G471VCTX) 
#define FLPROG_CORE_NAME "GENERIC G471VCTX"
#define FLPROG_CORE_CODE 958
#define FLPROG_CORE_GENERIC_G471VCTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G4
#define FLPROG_CORE_STM32_G471
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G471VEHX) 
#define FLPROG_CORE_NAME "GENERIC G471VEHX"
#define FLPROG_CORE_CODE 959
#define FLPROG_CORE_GENERIC_G471VEHX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G4
#define FLPROG_CORE_STM32_G471
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G471VEIX) 
#define FLPROG_CORE_NAME "GENERIC G471VEIX"
#define FLPROG_CORE_CODE 960
#define FLPROG_CORE_GENERIC_G471VEIX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G4
#define FLPROG_CORE_STM32_G471
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G471VETX) 
#define FLPROG_CORE_NAME "GENERIC G471VETX"
#define FLPROG_CORE_CODE 961
#define FLPROG_CORE_GENERIC_G471VETX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G4
#define FLPROG_CORE_STM32_G471
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G473CBTX) 
#define FLPROG_CORE_NAME "GENERIC G473CBTX"
#define FLPROG_CORE_CODE 962
#define FLPROG_CORE_GENERIC_G473CBTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G4
#define FLPROG_CORE_STM32_G473
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G473CCTX) 
#define FLPROG_CORE_NAME "GENERIC G473CCTX"
#define FLPROG_CORE_CODE 963
#define FLPROG_CORE_GENERIC_G473CCTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G4
#define FLPROG_CORE_STM32_G473
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G473CETX) 
#define FLPROG_CORE_NAME "GENERIC G473CETX"
#define FLPROG_CORE_CODE 964
#define FLPROG_CORE_GENERIC_G473CETX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G4
#define FLPROG_CORE_STM32_G473
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G473MBTX) 
#define FLPROG_CORE_NAME "GENERIC G473MBTX"
#define FLPROG_CORE_CODE 965
#define FLPROG_CORE_GENERIC_G473MBTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G4
#define FLPROG_CORE_STM32_G473
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G473MCTX) 
#define FLPROG_CORE_NAME "GENERIC G473MCTX"
#define FLPROG_CORE_CODE 966
#define FLPROG_CORE_GENERIC_G473MCTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G4
#define FLPROG_CORE_STM32_G473
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G473METX) 
#define FLPROG_CORE_NAME "GENERIC G473METX"
#define FLPROG_CORE_CODE 967
#define FLPROG_CORE_GENERIC_G473METX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G4
#define FLPROG_CORE_STM32_G473
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G473PBIX) 
#define FLPROG_CORE_NAME "GENERIC G473PBIX"
#define FLPROG_CORE_CODE 968
#define FLPROG_CORE_GENERIC_G473PBIX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G4
#define FLPROG_CORE_STM32_G473
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G473PCIX) 
#define FLPROG_CORE_NAME "GENERIC G473PCIX"
#define FLPROG_CORE_CODE 969
#define FLPROG_CORE_GENERIC_G473PCIX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G4
#define FLPROG_CORE_STM32_G473
#endif
