Totuin/Flprog_Utilites/src/selectCore/flprogSelectCore_stm32.h
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G473PEIX) 
#define FLPROG_CORE_NAME "GENERIC G473PEIX"
#define FLPROG_CORE_CODE 970
#define FLPROG_CORE_GENERIC_G473PEIX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G4
#define FLPROG_CORE_STM32_G473
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G473QBTX) 
#define FLPROG_CORE_NAME "GENERIC G473QBTX"
#define FLPROG_CORE_CODE 971
#define FLPROG_CORE_GENERIC_G473QBTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G4
#define FLPROG_CORE_STM32_G473
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G473QCTX) 
#define FLPROG_CORE_NAME "GENERIC G473QCTX"
#define FLPROG_CORE_CODE 972
#define FLPROG_CORE_GENERIC_G473QCTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G4
#define FLPROG_CORE_STM32_G473
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G473QETX) 
#define FLPROG_CORE_NAME "GENERIC G473QETX"
#define FLPROG_CORE_CODE 973
#define FLPROG_CORE_GENERIC_G473QETX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G4
#define FLPROG_CORE_STM32_G473
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G473RBTX) 
#define FLPROG_CORE_NAME "GENERIC G473RBTX"
#define FLPROG_CORE_CODE 974
#define FLPROG_CORE_GENERIC_G473RBTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G4
#define FLPROG_CORE_STM32_G473
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G473RCTX) 
#define FLPROG_CORE_NAME "GENERIC G473RCTX"
#define FLPROG_CORE_CODE 975
#define FLPROG_CORE_GENERIC_G473RCTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G4
#define FLPROG_CORE_STM32_G473
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G473RETX) 
#define FLPROG_CORE_NAME "GENERIC G473RETX"
#define FLPROG_CORE_CODE 976
#define FLPROG_CORE_GENERIC_G473RETX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G4
#define FLPROG_CORE_STM32_G473
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G473VBHX) 
#define FLPROG_CORE_NAME "GENERIC G473VBHX"
#define FLPROG_CORE_CODE 977
#define FLPROG_CORE_GENERIC_G473VBHX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G4
#define FLPROG_CORE_STM32_G473
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G473VBTX) 
#define FLPROG_CORE_NAME "GENERIC G473VBTX"
#define FLPROG_CORE_CODE 978
#define FLPROG_CORE_GENERIC_G473VBTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G4
#define FLPROG_CORE_STM32_G473
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G473VCHX) 
#define FLPROG_CORE_NAME "GENERIC G473VCHX"
#define FLPROG_CORE_CODE 979
#define FLPROG_CORE_GENERIC_G473VCHX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G4
#define FLPROG_CORE_STM32_G473
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G473VCTX) 
#define FLPROG_CORE_NAME "GENERIC G473VCTX"
#define FLPROG_CORE_CODE 980
#define FLPROG_CORE_GENERIC_G473VCTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G4
#define FLPROG_CORE_STM32_G473
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G473VEHX) 
#define FLPROG_CORE_NAME "GENERIC G473VEHX"
#define FLPROG_CORE_CODE 981
#define FLPROG_CORE_GENERIC_G473VEHX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G4
#define FLPROG_CORE_STM32_G473
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G473VETX) 
#define FLPROG_CORE_NAME "GENERIC G473VETX"
#define FLPROG_CORE_CODE 982
#define FLPROG_CORE_GENERIC_G473VETX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G4
#define FLPROG_CORE_STM32_G473
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G474CBTX) 
#define FLPROG_CORE_NAME "GENERIC G474CBTX"
#define FLPROG_CORE_CODE 983
#define FLPROG_CORE_GENERIC_G474CBTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G4
#define FLPROG_CORE_STM32_G474
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G474CCTX) 
#define FLPROG_CORE_NAME "GENERIC G474CCTX"
#define FLPROG_CORE_CODE 984
#define FLPROG_CORE_GENERIC_G474CCTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G4
#define FLPROG_CORE_STM32_G474
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G474CETX) 
#define FLPROG_CORE_NAME "GENERIC G474CETX"
#define FLPROG_CORE_CODE 985
#define FLPROG_CORE_GENERIC_G474CETX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G4
#define FLPROG_CORE_STM32_G474
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G474MBTX) 
#define FLPROG_CORE_NAME "GENERIC G474MBTX"
#define FLPROG_CORE_CODE 986
#define FLPROG_CORE_GENERIC_G474MBTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G4
#define FLPROG_CORE_STM32_G474
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G474MCTX) 
#define FLPROG_CORE_NAME "GENERIC G474MCTX"
#define FLPROG_CORE_CODE 987
#define FLPROG_CORE_GENERIC_G474MCTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G4
#define FLPROG_CORE_STM32_G474
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G474METX) 
#define FLPROG_CORE_NAME "GENERIC G474METX"
#define FLPROG_CORE_CODE 988
#define FLPROG_CORE_GENERIC_G474METX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G4
#define FLPROG_CORE_STM32_G474
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G474PBIX) 
#define FLPROG_CORE_NAME "GENERIC G474PBIX"
#define FLPROG_CORE_CODE 989
#define FLPROG_CORE_GENERIC_G474PBIX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G4
#define FLPROG_CORE_STM32_G474
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G474PCIX) 
#define FLPROG_CORE_NAME "GENERIC G474PCIX"
#define FLPROG_CORE_CODE 990
#define FLPROG_CORE_GENERIC_G474PCIX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G4
#define FLPROG_CORE_STM32_G474
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G474PEIX) 
#define FLPROG_CORE_NAME "GENERIC G474PEIX"
#define FLPROG_CORE_CODE 991
#define FLPROG_CORE_GENERIC_G474PEIX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G4
#define FLPROG_CORE_STM32_G474
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G474QBTX) 
#define FLPROG_CORE_NAME "GENERIC G474QBTX"
#define FLPROG_CORE_CODE 992
#define FLPROG_CORE_GENERIC_G474QBTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G4
#define FLPROG_CORE_STM32_G474
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G474QCTX) 
#define FLPROG_CORE_NAME "GENERIC G474QCTX"
#define FLPROG_CORE_CODE 993
#define FLPROG_CORE_GENERIC_G474QCTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G4
#define FLPROG_CORE_STM32_G474
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G474QETX) 
#define FLPROG_CORE_NAME "GENERIC G474QETX"
#define FLPROG_CORE_CODE 994
#define FLPROG_CORE_GENERIC_G474QETX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G4
#define FLPROG_CORE_STM32_G474
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G474RBTX) 
#define FLPROG_CORE_NAME "GENERIC G474RBTX"
#define FLPROG_CORE_CODE 995
#define FLPROG_CORE_GENERIC_G474RBTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G4
#define FLPROG_CORE_STM32_G474
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G474RCTX) 
#define FLPROG_CORE_NAME "GENERIC G474RCTX"
#define FLPROG_CORE_CODE 996
#define FLPROG_CORE_GENERIC_G474RCTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G4
#define FLPROG_CORE_STM32_G474
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G474RETX) 
#define FLPROG_CORE_NAME "GENERIC G474RETX"
#define FLPROG_CORE_CODE 997
#define FLPROG_CORE_GENERIC_G474RETX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G4
#define FLPROG_CORE_STM32_G474
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G474VBHX) 
#define FLPROG_CORE_NAME "GENERIC G474VBHX"
#define FLPROG_CORE_CODE 998
#define FLPROG_CORE_GENERIC_G474VBHX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G4
#define FLPROG_CORE_STM32_G474
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G474VBTX) 
#define FLPROG_CORE_NAME "GENERIC G474VBTX"
#define FLPROG_CORE_CODE 999
#define FLPROG_CORE_GENERIC_G474VBTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G4
#define FLPROG_CORE_STM32_G474
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G474VCHX) 
#define FLPROG_CORE_NAME "GENERIC G474VCHX"
#define FLPROG_CORE_CODE 1000
#define FLPROG_CORE_GENERIC_G474VCHX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G4
#define FLPROG_CORE_STM32_G474
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G474VCTX) 
#define FLPROG_CORE_NAME "GENERIC G474VCTX"
#define FLPROG_CORE_CODE 1001
#define FLPROG_CORE_GENERIC_G474VCTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G4
#define FLPROG_CORE_STM32_G474
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G474VEHX) 
#define FLPROG_CORE_NAME "GENERIC G474VEHX"
#define FLPROG_CORE_CODE 1002
#define FLPROG_CORE_GENERIC_G474VEHX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G4
#define FLPROG_CORE_STM32_G474
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G474VETX) 
#define FLPROG_CORE_NAME "GENERIC G474VETX"
#define FLPROG_CORE_CODE 1003
#define FLPROG_CORE_GENERIC_G474VETX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G4
#define FLPROG_CORE_STM32_G474
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_NUCLEO_G474RE) 
#define FLPROG_CORE_NAME "NUCLEO G474RE"
#define FLPROG_CORE_CODE 1402
#define FLPROG_CORE_NUCLEO_G474RE
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G4
#define FLPROG_CORE_STM32_G474
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G483CETX) 
#define FLPROG_CORE_NAME "GENERIC G483CETX"
#define FLPROG_CORE_CODE 1004
#define FLPROG_CORE_GENERIC_G483CETX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G4
#define FLPROG_CORE_STM32_G483
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G483METX) 
#define FLPROG_CORE_NAME "GENERIC G483METX"
#define FLPROG_CORE_CODE 1005
#define FLPROG_CORE_GENERIC_G483METX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G4
#define FLPROG_CORE_STM32_G483
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G483PEIX) 
#define FLPROG_CORE_NAME "GENERIC G483PEIX"
#define FLPROG_CORE_CODE 1006
#define FLPROG_CORE_GENERIC_G483PEIX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G4
#define FLPROG_CORE_STM32_G483
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G483QETX) 
#define FLPROG_CORE_NAME "GENERIC G483QETX"
#define FLPROG_CORE_CODE 1007
#define FLPROG_CORE_GENERIC_G483QETX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G4
#define FLPROG_CORE_STM32_G483
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G483RETX) 
#define FLPROG_CORE_NAME "GENERIC G483RETX"
#define FLPROG_CORE_CODE 1008
#define FLPROG_CORE_GENERIC_G483RETX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G4
#define FLPROG_CORE_STM32_G483
#endif
