Totuin/Flprog_Utilites/src/selectCore/flprogSelectCore_stm32.h
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G483VEHX) 
#define FLPROG_CORE_NAME "GENERIC G483VEHX"
#define FLPROG_CORE_CODE 1009
#define FLPROG_CORE_GENERIC_G483VEHX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G4
#define FLPROG_CORE_STM32_G483
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G483VETX) 
#define FLPROG_CORE_NAME "GENERIC G483VETX"
#define FLPROG_CORE_CODE 1010
#define FLPROG_CORE_GENERIC_G483VETX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G4
#define FLPROG_CORE_STM32_G483
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G484CETX) 
#define FLPROG_CORE_NAME "GENERIC G484CETX"
#define FLPROG_CORE_CODE 1011
#define FLPROG_CORE_GENERIC_G484CETX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G4
#define FLPROG_CORE_STM32_G484
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G484METX) 
#define FLPROG_CORE_NAME "GENERIC G484METX"
#define FLPROG_CORE_CODE 1012
#define FLPROG_CORE_GENERIC_G484METX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G4
#define FLPROG_CORE_STM32_G484
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G484PEIX) 
#define FLPROG_CORE_NAME "GENERIC G484PEIX"
#define FLPROG_CORE_CODE 1013
#define FLPROG_CORE_GENERIC_G484PEIX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G4
#define FLPROG_CORE_STM32_G484
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G484QETX) 
#define FLPROG_CORE_NAME "GENERIC G484QETX, GENERIC G484QETX"
#define FLPROG_CORE_CODE 1014
#define FLPROG_CORE_GENERIC_G484QETX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G4
#define FLPROG_CORE_STM32_G484
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G484RETX) 
#define FLPROG_CORE_NAME "GENERIC G484RETX"
#define FLPROG_CORE_CODE 1016
#define FLPROG_CORE_GENERIC_G484RETX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G4
#define FLPROG_CORE_STM32_G484
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G484VEHX) 
#define FLPROG_CORE_NAME "GENERIC G484VEHX"
#define FLPROG_CORE_CODE 1017
#define FLPROG_CORE_GENERIC_G484VEHX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G4
#define FLPROG_CORE_STM32_G484
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G484VETX) 
#define FLPROG_CORE_NAME "GENERIC G484VETX"
#define FLPROG_CORE_CODE 1018
#define FLPROG_CORE_GENERIC_G484VETX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G4
#define FLPROG_CORE_STM32_G484
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G491CCTX) 
#define FLPROG_CORE_NAME "GENERIC G491CCTX"
#define FLPROG_CORE_CODE 1019
#define FLPROG_CORE_GENERIC_G491CCTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G4
#define FLPROG_CORE_STM32_G491
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G491CETX) 
#define FLPROG_CORE_NAME "GENERIC G491CETX"
#define FLPROG_CORE_CODE 1020
#define FLPROG_CORE_GENERIC_G491CETX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G4
#define FLPROG_CORE_STM32_G491
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G491KCUX) 
#define FLPROG_CORE_NAME "GENERIC G491KCUX"
#define FLPROG_CORE_CODE 1021
#define FLPROG_CORE_GENERIC_G491KCUX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G4
#define FLPROG_CORE_STM32_G491
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G491KEUX) 
#define FLPROG_CORE_NAME "GENERIC G491KEUX"
#define FLPROG_CORE_CODE 1022
#define FLPROG_CORE_GENERIC_G491KEUX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G4
#define FLPROG_CORE_STM32_G491
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G491MCSX) 
#define FLPROG_CORE_NAME "GENERIC G491MCSX"
#define FLPROG_CORE_CODE 1023
#define FLPROG_CORE_GENERIC_G491MCSX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G4
#define FLPROG_CORE_STM32_G491
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G491MCTX) 
#define FLPROG_CORE_NAME "GENERIC G491MCTX"
#define FLPROG_CORE_CODE 1024
#define FLPROG_CORE_GENERIC_G491MCTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G4
#define FLPROG_CORE_STM32_G491
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G491MESX) 
#define FLPROG_CORE_NAME "GENERIC G491MESX"
#define FLPROG_CORE_CODE 1025
#define FLPROG_CORE_GENERIC_G491MESX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G4
#define FLPROG_CORE_STM32_G491
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G491METX) 
#define FLPROG_CORE_NAME "GENERIC G491METX"
#define FLPROG_CORE_CODE 1026
#define FLPROG_CORE_GENERIC_G491METX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G4
#define FLPROG_CORE_STM32_G491
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G491RCIX) 
#define FLPROG_CORE_NAME "GENERIC G491RCIX"
#define FLPROG_CORE_CODE 1027
#define FLPROG_CORE_GENERIC_G491RCIX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G4
#define FLPROG_CORE_STM32_G491
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G491RCTX) 
#define FLPROG_CORE_NAME "GENERIC G491RCTX"
#define FLPROG_CORE_CODE 1028
#define FLPROG_CORE_GENERIC_G491RCTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G4
#define FLPROG_CORE_STM32_G491
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G491REIX) 
#define FLPROG_CORE_NAME "GENERIC G491REIX"
#define FLPROG_CORE_CODE 1029
#define FLPROG_CORE_GENERIC_G491REIX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G4
#define FLPROG_CORE_STM32_G491
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G491RETX) 
#define FLPROG_CORE_NAME "GENERIC G491RETX"
#define FLPROG_CORE_CODE 1030
#define FLPROG_CORE_GENERIC_G491RETX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G4
#define FLPROG_CORE_STM32_G491
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G491REYX) 
#define FLPROG_CORE_NAME "GENERIC G491REYX"
#define FLPROG_CORE_CODE 1031
#define FLPROG_CORE_GENERIC_G491REYX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G4
#define FLPROG_CORE_STM32_G491
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G491VCTX) 
#define FLPROG_CORE_NAME "GENERIC G491VCTX"
#define FLPROG_CORE_CODE 1032
#define FLPROG_CORE_GENERIC_G491VCTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G4
#define FLPROG_CORE_STM32_G491
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G491VETX) 
#define FLPROG_CORE_NAME "GENERIC G491VETX"
#define FLPROG_CORE_CODE 1033
#define FLPROG_CORE_GENERIC_G491VETX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G4
#define FLPROG_CORE_STM32_G491
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G4A1CETX) 
#define FLPROG_CORE_NAME "GENERIC G4A1CETX"
#define FLPROG_CORE_CODE 1034
#define FLPROG_CORE_GENERIC_G4A1CETX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G4
#define FLPROG_CORE_STM32_G4A1
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G4A1KEUX) 
#define FLPROG_CORE_NAME "GENERIC G4A1KEUX"
#define FLPROG_CORE_CODE 1035
#define FLPROG_CORE_GENERIC_G4A1KEUX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G4
#define FLPROG_CORE_STM32_G4A1
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G4A1MESX) 
#define FLPROG_CORE_NAME "GENERIC G4A1MESX"
#define FLPROG_CORE_CODE 1036
#define FLPROG_CORE_GENERIC_G4A1MESX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G4
#define FLPROG_CORE_STM32_G4A1
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G4A1METX) 
#define FLPROG_CORE_NAME "GENERIC G4A1METX"
#define FLPROG_CORE_CODE 1037
#define FLPROG_CORE_GENERIC_G4A1METX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G4
#define FLPROG_CORE_STM32_G4A1
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G4A1REIX) 
#define FLPROG_CORE_NAME "GENERIC G4A1REIX"
#define FLPROG_CORE_CODE 1038
#define FLPROG_CORE_GENERIC_G4A1REIX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G4
#define FLPROG_CORE_STM32_G4A1
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G4A1RETX) 
#define FLPROG_CORE_NAME "GENERIC G4A1RETX"
#define FLPROG_CORE_CODE 1039
#define FLPROG_CORE_GENERIC_G4A1RETX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G4
#define FLPROG_CORE_STM32_G4A1
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G4A1REYX) 
#define FLPROG_CORE_NAME "GENERIC G4A1REYX"
#define FLPROG_CORE_CODE 1040
#define FLPROG_CORE_GENERIC_G4A1REYX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G4
#define FLPROG_CORE_STM32_G4A1
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_G4A1VETX) 
#define FLPROG_CORE_NAME "GENERIC G4A1VETX"
#define FLPROG_CORE_CODE 1041
#define FLPROG_CORE_GENERIC_G4A1VETX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_G4
#define FLPROG_CORE_STM32_G4A1
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_H723ZETX) 
#define FLPROG_CORE_NAME "GENERIC H723ZETX"
#define FLPROG_CORE_CODE 1042
#define FLPROG_CORE_GENERIC_H723ZETX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_H7

#define FLPROG_HAS_I2C1
#define FLPROG_NEED_CREATE_I2C1
#define FLPROG_I2C1_SDA PB11
#define FLPROG_I2C1_SCL PB10

#define FLPROG_HAS_UART1
#define FLPROG_NEED_CREATE_UART1
#define FLPROG_UART1_RX PA10
#define FLPROG_UART1_TX PA9

#define FLPROG_HAS_UART2
#define FLPROG_NEED_CREATE_UART2
#define FLPROG_UART2_RX PA3
#define FLPROG_UART2_TX PA2

#define FLPROG_HAS_UART3
#define FLPROG_NEED_CREATE_UART3
#define FLPROG_UART3_RX PD9
#define FLPROG_UART3_TX PD8

