Totuin/Flprog_Utilites/src/selectCore/flprogSelectCore_stm32.h
#define FLPROG_HAS_UART4
#define FLPROG_NEED_CREATE_UART4
#define FLPROG_UART4_RX PC11
#define FLPROG_UART4_TX PC10

#define FLPROG_HAS_UART5
#define FLPROG_NEED_CREATE_UART5
#define FLPROG_UART5_RX PD2
#define FLPROG_UART5_TX PC12

#define FLPROG_HAS_UART6
#define FLPROG_NEED_CREATE_UART6
#define FLPROG_UART6_RX PC7
#define FLPROG_UART6_TX PC6

#define FLPROG_HAS_UART7
#define FLPROG_NEED_CREATE_UART7
#define FLPROG_UART7_RX PC9
#define FLPROG_UART7_TX PC8

#define FLPROG_HAS_UART8
#define FLPROG_NEED_CREATE_UART8
#define FLPROG_UART8_RX PC13
#define FLPROG_UART8_TX PC12
#define FLPROG_CORE_STM32_H743
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_H743IGTX) 
#define FLPROG_CORE_NAME "GENERIC H743IGTX"
#define FLPROG_CORE_CODE 1057
#define FLPROG_CORE_GENERIC_H743IGTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_H7

#define FLPROG_HAS_I2C1
#define FLPROG_NEED_CREATE_I2C1
#define FLPROG_I2C1_SDA PB11
#define FLPROG_I2C1_SCL PB10

#define FLPROG_HAS_UART1
#define FLPROG_NEED_CREATE_UART1
#define FLPROG_UART1_RX PA10
#define FLPROG_UART1_TX PA9

#define FLPROG_HAS_UART2
#define FLPROG_NEED_CREATE_UART2
#define FLPROG_UART2_RX PA3
#define FLPROG_UART2_TX PA2

#define FLPROG_HAS_UART3
#define FLPROG_NEED_CREATE_UART3
#define FLPROG_UART3_RX PD9
#define FLPROG_UART3_TX PD8

#define FLPROG_HAS_UART4
#define FLPROG_NEED_CREATE_UART4
#define FLPROG_UART4_RX PC11
#define FLPROG_UART4_TX PC10

#define FLPROG_HAS_UART5
#define FLPROG_NEED_CREATE_UART5
#define FLPROG_UART5_RX PD2
#define FLPROG_UART5_TX PC12

#define FLPROG_HAS_UART6
#define FLPROG_NEED_CREATE_UART6
#define FLPROG_UART6_RX PC7
#define FLPROG_UART6_TX PC6

#define FLPROG_HAS_UART7
#define FLPROG_NEED_CREATE_UART7
#define FLPROG_UART7_RX PC9
#define FLPROG_UART7_TX PC8

#define FLPROG_HAS_UART8
#define FLPROG_NEED_CREATE_UART8
#define FLPROG_UART8_RX PC13
#define FLPROG_UART8_TX PC12
#define FLPROG_CORE_STM32_H743
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_H743IIKX) 
#define FLPROG_CORE_NAME "GENERIC H743IIKX"
#define FLPROG_CORE_CODE 1058
#define FLPROG_CORE_GENERIC_H743IIKX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_H7

#define FLPROG_HAS_I2C1
#define FLPROG_NEED_CREATE_I2C1
#define FLPROG_I2C1_SDA PB11
#define FLPROG_I2C1_SCL PB10

#define FLPROG_HAS_UART1
#define FLPROG_NEED_CREATE_UART1
#define FLPROG_UART1_RX PA10
#define FLPROG_UART1_TX PA9

#define FLPROG_HAS_UART2
#define FLPROG_NEED_CREATE_UART2
#define FLPROG_UART2_RX PA3
#define FLPROG_UART2_TX PA2

#define FLPROG_HAS_UART3
#define FLPROG_NEED_CREATE_UART3
#define FLPROG_UART3_RX PD9
#define FLPROG_UART3_TX PD8

#define FLPROG_HAS_UART4
#define FLPROG_NEED_CREATE_UART4
#define FLPROG_UART4_RX PC11
#define FLPROG_UART4_TX PC10

#define FLPROG_HAS_UART5
#define FLPROG_NEED_CREATE_UART5
#define FLPROG_UART5_RX PD2
#define FLPROG_UART5_TX PC12

#define FLPROG_HAS_UART6
#define FLPROG_NEED_CREATE_UART6
#define FLPROG_UART6_RX PC7
#define FLPROG_UART6_TX PC6

#define FLPROG_HAS_UART7
#define FLPROG_NEED_CREATE_UART7
#define FLPROG_UART7_RX PC9
#define FLPROG_UART7_TX PC8

#define FLPROG_HAS_UART8
#define FLPROG_NEED_CREATE_UART8
#define FLPROG_UART8_RX PC13
#define FLPROG_UART8_TX PC12
#define FLPROG_CORE_STM32_H743
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_H743IITX) 
#define FLPROG_CORE_NAME "GENERIC H743IITX"
#define FLPROG_CORE_CODE 1059
#define FLPROG_CORE_GENERIC_H743IITX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_H7

#define FLPROG_HAS_I2C1
#define FLPROG_NEED_CREATE_I2C1
#define FLPROG_I2C1_SDA PB11
#define FLPROG_I2C1_SCL PB10

#define FLPROG_HAS_UART1
#define FLPROG_NEED_CREATE_UART1
#define FLPROG_UART1_RX PA10
#define FLPROG_UART1_TX PA9

#define FLPROG_HAS_UART2
#define FLPROG_NEED_CREATE_UART2
#define FLPROG_UART2_RX PA3
#define FLPROG_UART2_TX PA2

#define FLPROG_HAS_UART3
#define FLPROG_NEED_CREATE_UART3
#define FLPROG_UART3_RX PD9
#define FLPROG_UART3_TX PD8

#define FLPROG_HAS_UART4
#define FLPROG_NEED_CREATE_UART4
#define FLPROG_UART4_RX PC11
#define FLPROG_UART4_TX PC10

#define FLPROG_HAS_UART5
#define FLPROG_NEED_CREATE_UART5
#define FLPROG_UART5_RX PD2
#define FLPROG_UART5_TX PC12

#define FLPROG_HAS_UART6
#define FLPROG_NEED_CREATE_UART6
#define FLPROG_UART6_RX PC7
#define FLPROG_UART6_TX PC6

#define FLPROG_HAS_UART7
#define FLPROG_NEED_CREATE_UART7
#define FLPROG_UART7_RX PC9
#define FLPROG_UART7_TX PC8

#define FLPROG_HAS_UART8
#define FLPROG_NEED_CREATE_UART8
#define FLPROG_UART8_RX PC13
#define FLPROG_UART8_TX PC12
#define FLPROG_CORE_STM32_H743
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_H743VGHX) 
#define FLPROG_CORE_NAME "GENERIC H743VGHX"
#define FLPROG_CORE_CODE 1060
#define FLPROG_CORE_GENERIC_H743VGHX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_H7

#define FLPROG_HAS_I2C1
#define FLPROG_NEED_CREATE_I2C1
#define FLPROG_I2C1_SDA PB11
#define FLPROG_I2C1_SCL PB10

#define FLPROG_HAS_UART1
#define FLPROG_NEED_CREATE_UART1
#define FLPROG_UART1_RX PA10
#define FLPROG_UART1_TX PA9

#define FLPROG_HAS_UART2
#define FLPROG_NEED_CREATE_UART2
#define FLPROG_UART2_RX PA3
#define FLPROG_UART2_TX PA2

#define FLPROG_HAS_UART3
#define FLPROG_NEED_CREATE_UART3
#define FLPROG_UART3_RX PD9
#define FLPROG_UART3_TX PD8

