Totuin/Flprog_Utilites/src/selectCore/flprogSelectCore_stm32.h
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L0
#define FLPROG_CORE_STM32_L031
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L031E6YX) 
#define FLPROG_CORE_NAME "GENERIC L031E6YX"
#define FLPROG_CORE_CODE 1111
#define FLPROG_CORE_GENERIC_L031E6YX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L0
#define FLPROG_CORE_STM32_L031
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L031F4PX) 
#define FLPROG_CORE_NAME "GENERIC L031F4PX"
#define FLPROG_CORE_CODE 1112
#define FLPROG_CORE_GENERIC_L031F4PX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L0
#define FLPROG_CORE_STM32_L031
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L031F6PX) 
#define FLPROG_CORE_NAME "GENERIC L031F6PX"
#define FLPROG_CORE_CODE 1113
#define FLPROG_CORE_GENERIC_L031F6PX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L0
#define FLPROG_CORE_STM32_L031
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L031G4UX) 
#define FLPROG_CORE_NAME "GENERIC L031G4UX"
#define FLPROG_CORE_CODE 1114
#define FLPROG_CORE_GENERIC_L031G4UX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L0
#define FLPROG_CORE_STM32_L031
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L031G6UX) 
#define FLPROG_CORE_NAME "GENERIC L031G6UX"
#define FLPROG_CORE_CODE 1115
#define FLPROG_CORE_GENERIC_L031G6UX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L0
#define FLPROG_CORE_STM32_L031
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L031K4TX) 
#define FLPROG_CORE_NAME "GENERIC L031K4TX"
#define FLPROG_CORE_CODE 1116
#define FLPROG_CORE_GENERIC_L031K4TX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L0
#define FLPROG_CORE_STM32_L031
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L031K6TX) 
#define FLPROG_CORE_NAME "GENERIC L031K6TX"
#define FLPROG_CORE_CODE 1117
#define FLPROG_CORE_GENERIC_L031K6TX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L0
#define FLPROG_CORE_STM32_L031
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_NUCLEO_L031K6) 
#define FLPROG_CORE_NAME "NUCLEO L031K6"
#define FLPROG_CORE_CODE 1406
#define FLPROG_CORE_NUCLEO_L031K6
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L0
#define FLPROG_CORE_STM32_L031
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L041C4TX) 
#define FLPROG_CORE_NAME "GENERIC L041C4TX"
#define FLPROG_CORE_CODE 1118
#define FLPROG_CORE_GENERIC_L041C4TX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L0
#define FLPROG_CORE_STM32_L041
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L041C6TX) 
#define FLPROG_CORE_NAME "GENERIC L041C6TX"
#define FLPROG_CORE_CODE 1119
#define FLPROG_CORE_GENERIC_L041C6TX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L0
#define FLPROG_CORE_STM32_L041
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L041C6UX) 
#define FLPROG_CORE_NAME "GENERIC L041C6UX"
#define FLPROG_CORE_CODE 1120
#define FLPROG_CORE_GENERIC_L041C6UX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L0
#define FLPROG_CORE_STM32_L041
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L041E6YX) 
#define FLPROG_CORE_NAME "GENERIC L041E6YX"
#define FLPROG_CORE_CODE 1121
#define FLPROG_CORE_GENERIC_L041E6YX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L0
#define FLPROG_CORE_STM32_L041
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L041F6PX) 
#define FLPROG_CORE_NAME "GENERIC L041F6PX"
#define FLPROG_CORE_CODE 1122
#define FLPROG_CORE_GENERIC_L041F6PX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L0
#define FLPROG_CORE_STM32_L041
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L041G6UX) 
#define FLPROG_CORE_NAME "GENERIC L041G6UX"
#define FLPROG_CORE_CODE 1123
#define FLPROG_CORE_GENERIC_L041G6UX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L0
#define FLPROG_CORE_STM32_L041
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L041K6TX) 
#define FLPROG_CORE_NAME "GENERIC L041K6TX"
#define FLPROG_CORE_CODE 1124
#define FLPROG_CORE_GENERIC_L041K6TX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L0
#define FLPROG_CORE_STM32_L041
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L051C6TX) 
#define FLPROG_CORE_NAME "GENERIC L051C6TX"
#define FLPROG_CORE_CODE 1125
#define FLPROG_CORE_GENERIC_L051C6TX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L0
#define FLPROG_CORE_STM32_L051
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L051C6UX) 
#define FLPROG_CORE_NAME "GENERIC L051C6UX"
#define FLPROG_CORE_CODE 1126
#define FLPROG_CORE_GENERIC_L051C6UX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L0
#define FLPROG_CORE_STM32_L051
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L051C8TX) 
#define FLPROG_CORE_NAME "GENERIC L051C8TX"
#define FLPROG_CORE_CODE 1127
#define FLPROG_CORE_GENERIC_L051C8TX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L0
#define FLPROG_CORE_STM32_L051
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L051C8UX) 
#define FLPROG_CORE_NAME "GENERIC L051C8UX"
#define FLPROG_CORE_CODE 1128
#define FLPROG_CORE_GENERIC_L051C8UX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L0
#define FLPROG_CORE_STM32_L051
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_RHF76_052) 
#define FLPROG_CORE_NAME "RHF76 052"
#define FLPROG_CORE_CODE 1439
#define FLPROG_CORE_RHF76_052
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L0
#define FLPROG_CORE_STM32_L051
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L052C6TX) 
#define FLPROG_CORE_NAME "GENERIC L052C6TX"
#define FLPROG_CORE_CODE 1129
#define FLPROG_CORE_GENERIC_L052C6TX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L0
#define FLPROG_CORE_STM32_L052
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L052C6UX) 
#define FLPROG_CORE_NAME "GENERIC L052C6UX"
#define FLPROG_CORE_CODE 1130
#define FLPROG_CORE_GENERIC_L052C6UX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L0
#define FLPROG_CORE_STM32_L052
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L052C8TX) 
#define FLPROG_CORE_NAME "GENERIC L052C8TX"
#define FLPROG_CORE_CODE 1131
#define FLPROG_CORE_GENERIC_L052C8TX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L0
#define FLPROG_CORE_STM32_L052
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L052C8UX) 
#define FLPROG_CORE_NAME "GENERIC L052C8UX"
#define FLPROG_CORE_CODE 1132
#define FLPROG_CORE_GENERIC_L052C8UX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L0
#define FLPROG_CORE_STM32_L052
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L052K6TX) 
#define FLPROG_CORE_NAME "GENERIC L052K6TX"
#define FLPROG_CORE_CODE 1133
#define FLPROG_CORE_GENERIC_L052K6TX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L0
#define FLPROG_CORE_STM32_L052
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L052K8TX) 
#define FLPROG_CORE_NAME "GENERIC L052K8TX"
#define FLPROG_CORE_CODE 1134
#define FLPROG_CORE_GENERIC_L052K8TX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L0
#define FLPROG_CORE_STM32_L052
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L052R6HX) 
#define FLPROG_CORE_NAME "GENERIC L052R6HX"
#define FLPROG_CORE_CODE 1135
#define FLPROG_CORE_GENERIC_L052R6HX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L0
#define FLPROG_CORE_STM32_L052
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L052R6TX) 
#define FLPROG_CORE_NAME "GENERIC L052R6TX"
#define FLPROG_CORE_CODE 1136
#define FLPROG_CORE_GENERIC_L052R6TX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L0
#define FLPROG_CORE_STM32_L052
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L052R8HX) 
#define FLPROG_CORE_NAME "GENERIC L052R8HX"
#define FLPROG_CORE_CODE 1137
#define FLPROG_CORE_GENERIC_L052R8HX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L0
#define FLPROG_CORE_STM32_L052
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L052R8TX) 
#define FLPROG_CORE_NAME "GENERIC L052R8TX"
#define FLPROG_CORE_CODE 1138
#define FLPROG_CORE_GENERIC_L052R8TX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L0
#define FLPROG_CORE_STM32_L052
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L052T6YX) 
#define FLPROG_CORE_NAME "GENERIC L052T6YX"
#define FLPROG_CORE_CODE 1139
#define FLPROG_CORE_GENERIC_L052T6YX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L0
#define FLPROG_CORE_STM32_L052
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L052T8FX) 
#define FLPROG_CORE_NAME "GENERIC L052T8FX"
#define FLPROG_CORE_CODE 1140
#define FLPROG_CORE_GENERIC_L052T8FX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L0
#define FLPROG_CORE_STM32_L052
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L052T8YX) 
#define FLPROG_CORE_NAME "GENERIC L052T8YX"
#define FLPROG_CORE_CODE 1141
#define FLPROG_CORE_GENERIC_L052T8YX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L0
#define FLPROG_CORE_STM32_L052
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L053C6TX) 
#define FLPROG_CORE_NAME "GENERIC L053C6TX"
#define FLPROG_CORE_CODE 1142
#define FLPROG_CORE_GENERIC_L053C6TX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L0
#define FLPROG_CORE_STM32_L053
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L053C6UX) 
#define FLPROG_CORE_NAME "GENERIC L053C6UX"
#define FLPROG_CORE_CODE 1143
#define FLPROG_CORE_GENERIC_L053C6UX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L0
#define FLPROG_CORE_STM32_L053
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L053C8TX) 
#define FLPROG_CORE_NAME "GENERIC L053C8TX"
#define FLPROG_CORE_CODE 1144
#define FLPROG_CORE_GENERIC_L053C8TX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L0
#define FLPROG_CORE_STM32_L053
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L053C8UX) 
#define FLPROG_CORE_NAME "GENERIC L053C8UX"
#define FLPROG_CORE_CODE 1145
#define FLPROG_CORE_GENERIC_L053C8UX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L0
#define FLPROG_CORE_STM32_L053
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L053R6HX) 
#define FLPROG_CORE_NAME "GENERIC L053R6HX"
#define FLPROG_CORE_CODE 1146
#define FLPROG_CORE_GENERIC_L053R6HX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L0
#define FLPROG_CORE_STM32_L053
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L053R6TX) 
#define FLPROG_CORE_NAME "GENERIC L053R6TX"
#define FLPROG_CORE_CODE 1147
#define FLPROG_CORE_GENERIC_L053R6TX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L0
#define FLPROG_CORE_STM32_L053
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L053R8HX) 
#define FLPROG_CORE_NAME "GENERIC L053R8HX"
#define FLPROG_CORE_CODE 1148
#define FLPROG_CORE_GENERIC_L053R8HX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
