Totuin/Flprog_Utilites/src/selectCore/flprogSelectCore_stm32.h
#define FLPROG_CORE_STM32_L0
#define FLPROG_CORE_STM32_L053
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L053R8TX) 
#define FLPROG_CORE_NAME "GENERIC L053R8TX"
#define FLPROG_CORE_CODE 1149
#define FLPROG_CORE_GENERIC_L053R8TX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L0
#define FLPROG_CORE_STM32_L053
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_NUCLEO_L053R8) 
#define FLPROG_CORE_NAME "NUCLEO L053R8"
#define FLPROG_CORE_CODE 1407
#define FLPROG_CORE_NUCLEO_L053R8
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L0
#define FLPROG_CORE_STM32_L053
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L062C8UX) 
#define FLPROG_CORE_NAME "GENERIC L062C8UX"
#define FLPROG_CORE_CODE 1150
#define FLPROG_CORE_GENERIC_L062C8UX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L0
#define FLPROG_CORE_STM32_L062
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L062K8TX) 
#define FLPROG_CORE_NAME "GENERIC L062K8TX"
#define FLPROG_CORE_CODE 1151
#define FLPROG_CORE_GENERIC_L062K8TX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L0
#define FLPROG_CORE_STM32_L062
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L063C8TX) 
#define FLPROG_CORE_NAME "GENERIC L063C8TX"
#define FLPROG_CORE_CODE 1152
#define FLPROG_CORE_GENERIC_L063C8TX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L0
#define FLPROG_CORE_STM32_L063
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L063C8UX) 
#define FLPROG_CORE_NAME "GENERIC L063C8UX"
#define FLPROG_CORE_CODE 1153
#define FLPROG_CORE_GENERIC_L063C8UX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L0
#define FLPROG_CORE_STM32_L063
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L063R8TX) 
#define FLPROG_CORE_NAME "GENERIC L063R8TX"
#define FLPROG_CORE_CODE 1154
#define FLPROG_CORE_GENERIC_L063R8TX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L0
#define FLPROG_CORE_STM32_L063
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_B_L072Z_LRWAN1) 
#define FLPROG_CORE_NAME "B L072Z LRWAN1"
#define FLPROG_CORE_CODE 341
#define FLPROG_CORE_B_L072Z_LRWAN1
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L0
#define FLPROG_CORE_STM32_L072
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L072CBTX) 
#define FLPROG_CORE_NAME "GENERIC L072CBTX"
#define FLPROG_CORE_CODE 1155
#define FLPROG_CORE_GENERIC_L072CBTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L0
#define FLPROG_CORE_STM32_L072
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L072CBUX) 
#define FLPROG_CORE_NAME "GENERIC L072CBUX"
#define FLPROG_CORE_CODE 1156
#define FLPROG_CORE_GENERIC_L072CBUX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L0
#define FLPROG_CORE_STM32_L072
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L072CBYX) 
#define FLPROG_CORE_NAME "GENERIC L072CBYX"
#define FLPROG_CORE_CODE 1157
#define FLPROG_CORE_GENERIC_L072CBYX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L0
#define FLPROG_CORE_STM32_L072
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L072CZEX) 
#define FLPROG_CORE_NAME "GENERIC L072CZEX"
#define FLPROG_CORE_CODE 1158
#define FLPROG_CORE_GENERIC_L072CZEX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L0
#define FLPROG_CORE_STM32_L072
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L072CZTX) 
#define FLPROG_CORE_NAME "GENERIC L072CZTX"
#define FLPROG_CORE_CODE 1159
#define FLPROG_CORE_GENERIC_L072CZTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L0
#define FLPROG_CORE_STM32_L072
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L072CZUX) 
#define FLPROG_CORE_NAME "GENERIC L072CZUX"
#define FLPROG_CORE_CODE 1160
#define FLPROG_CORE_GENERIC_L072CZUX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L0
#define FLPROG_CORE_STM32_L072
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L072CZYX) 
#define FLPROG_CORE_NAME "GENERIC L072CZYX"
#define FLPROG_CORE_CODE 1161
#define FLPROG_CORE_GENERIC_L072CZYX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L0
#define FLPROG_CORE_STM32_L072
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L072KBTX) 
#define FLPROG_CORE_NAME "GENERIC L072KBTX"
#define FLPROG_CORE_CODE 1162
#define FLPROG_CORE_GENERIC_L072KBTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L0
#define FLPROG_CORE_STM32_L072
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L072KBUX) 
#define FLPROG_CORE_NAME "GENERIC L072KBUX"
#define FLPROG_CORE_CODE 1163
#define FLPROG_CORE_GENERIC_L072KBUX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L0
#define FLPROG_CORE_STM32_L072
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L072KZTX) 
#define FLPROG_CORE_NAME "GENERIC L072KZTX"
#define FLPROG_CORE_CODE 1164
#define FLPROG_CORE_GENERIC_L072KZTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L0
#define FLPROG_CORE_STM32_L072
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L072KZUX) 
#define FLPROG_CORE_NAME "GENERIC L072KZUX"
#define FLPROG_CORE_CODE 1165
#define FLPROG_CORE_GENERIC_L072KZUX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L0
#define FLPROG_CORE_STM32_L072
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L072RBHX) 
#define FLPROG_CORE_NAME "GENERIC L072RBHX"
#define FLPROG_CORE_CODE 1166
#define FLPROG_CORE_GENERIC_L072RBHX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L0
#define FLPROG_CORE_STM32_L072
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L072RBIX) 
#define FLPROG_CORE_NAME "GENERIC L072RBIX"
#define FLPROG_CORE_CODE 1167
#define FLPROG_CORE_GENERIC_L072RBIX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L0
#define FLPROG_CORE_STM32_L072
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L072RBTX) 
#define FLPROG_CORE_NAME "GENERIC L072RBTX"
#define FLPROG_CORE_CODE 1168
#define FLPROG_CORE_GENERIC_L072RBTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L0
#define FLPROG_CORE_STM32_L072
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L072RZHX) 
#define FLPROG_CORE_NAME "GENERIC L072RZHX"
#define FLPROG_CORE_CODE 1169
#define FLPROG_CORE_GENERIC_L072RZHX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L0
#define FLPROG_CORE_STM32_L072
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L072RZIX) 
#define FLPROG_CORE_NAME "GENERIC L072RZIX"
#define FLPROG_CORE_CODE 1170
#define FLPROG_CORE_GENERIC_L072RZIX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L0
#define FLPROG_CORE_STM32_L072
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L072RZTX) 
#define FLPROG_CORE_NAME "GENERIC L072RZTX"
#define FLPROG_CORE_CODE 1171
#define FLPROG_CORE_GENERIC_L072RZTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L0
#define FLPROG_CORE_STM32_L072
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L072V8IX) 
#define FLPROG_CORE_NAME "GENERIC L072V8IX"
#define FLPROG_CORE_CODE 1172
#define FLPROG_CORE_GENERIC_L072V8IX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L0
#define FLPROG_CORE_STM32_L072
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L072V8TX) 
#define FLPROG_CORE_NAME "GENERIC L072V8TX"
#define FLPROG_CORE_CODE 1173
#define FLPROG_CORE_GENERIC_L072V8TX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L0
#define FLPROG_CORE_STM32_L072
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L072VBIX) 
#define FLPROG_CORE_NAME "GENERIC L072VBIX"
#define FLPROG_CORE_CODE 1174
#define FLPROG_CORE_GENERIC_L072VBIX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L0
#define FLPROG_CORE_STM32_L072
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L072VBTX) 
#define FLPROG_CORE_NAME "GENERIC L072VBTX"
#define FLPROG_CORE_CODE 1175
#define FLPROG_CORE_GENERIC_L072VBTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L0
#define FLPROG_CORE_STM32_L072
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L072VZIX) 
#define FLPROG_CORE_NAME "GENERIC L072VZIX"
#define FLPROG_CORE_CODE 1176
#define FLPROG_CORE_GENERIC_L072VZIX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L0
#define FLPROG_CORE_STM32_L072
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L072VZTX) 
#define FLPROG_CORE_NAME "GENERIC L072VZTX"
#define FLPROG_CORE_CODE 1177
#define FLPROG_CORE_GENERIC_L072VZTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L0
#define FLPROG_CORE_STM32_L072
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_PX_HER0) 
#define FLPROG_CORE_NAME "PX HER0"
#define FLPROG_CORE_CODE 1430
#define FLPROG_CORE_PX_HER0
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L0
#define FLPROG_CORE_STM32_L072
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_THUNDERPACK_L072) 
#define FLPROG_CORE_NAME "THUNDERPACK L072"
#define FLPROG_CORE_CODE 1452
#define FLPROG_CORE_THUNDERPACK_L072
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L0
#define FLPROG_CORE_STM32_L072
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_ACSIP_S76S) 
#define FLPROG_CORE_NAME "ACSIP S76S"
#define FLPROG_CORE_CODE 319
#define FLPROG_CORE_ACSIP_S76S
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L0
#define FLPROG_CORE_STM32_L073
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L073CBTX) 
#define FLPROG_CORE_NAME "GENERIC L073CBTX"
#define FLPROG_CORE_CODE 1178
#define FLPROG_CORE_GENERIC_L073CBTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L0
#define FLPROG_CORE_STM32_L073
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L073CBUX) 
#define FLPROG_CORE_NAME "GENERIC L073CBUX"
#define FLPROG_CORE_CODE 1179
#define FLPROG_CORE_GENERIC_L073CBUX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L0
#define FLPROG_CORE_STM32_L073
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L073CZTX) 
#define FLPROG_CORE_NAME "GENERIC L073CZTX"
#define FLPROG_CORE_CODE 1180
#define FLPROG_CORE_GENERIC_L073CZTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L0
#define FLPROG_CORE_STM32_L073
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L073CZUX) 
#define FLPROG_CORE_NAME "GENERIC L073CZUX"
#define FLPROG_CORE_CODE 1181
#define FLPROG_CORE_GENERIC_L073CZUX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L0
#define FLPROG_CORE_STM32_L073
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L073CZYX) 
#define FLPROG_CORE_NAME "GENERIC L073CZYX"
#define FLPROG_CORE_CODE 1182
#define FLPROG_CORE_GENERIC_L073CZYX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L0
#define FLPROG_CORE_STM32_L073
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L073RBHX) 
#define FLPROG_CORE_NAME "GENERIC L073RBHX"
#define FLPROG_CORE_CODE 1183
#define FLPROG_CORE_GENERIC_L073RBHX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L0
#define FLPROG_CORE_STM32_L073
#endif
