Totuin/Flprog_Utilites/src/selectCore/flprogSelectCore_stm32.h
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L073RBTX) 
#define FLPROG_CORE_NAME "GENERIC L073RBTX"
#define FLPROG_CORE_CODE 1184
#define FLPROG_CORE_GENERIC_L073RBTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L0
#define FLPROG_CORE_STM32_L073
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L073RZHX) 
#define FLPROG_CORE_NAME "GENERIC L073RZHX"
#define FLPROG_CORE_CODE 1185
#define FLPROG_CORE_GENERIC_L073RZHX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L0
#define FLPROG_CORE_STM32_L073
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L073RZIX) 
#define FLPROG_CORE_NAME "GENERIC L073RZIX"
#define FLPROG_CORE_CODE 1186
#define FLPROG_CORE_GENERIC_L073RZIX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L0
#define FLPROG_CORE_STM32_L073
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L073RZTX) 
#define FLPROG_CORE_NAME "GENERIC L073RZTX"
#define FLPROG_CORE_CODE 1187
#define FLPROG_CORE_GENERIC_L073RZTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L0
#define FLPROG_CORE_STM32_L073
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L073V8IX) 
#define FLPROG_CORE_NAME "GENERIC L073V8IX"
#define FLPROG_CORE_CODE 1188
#define FLPROG_CORE_GENERIC_L073V8IX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L0
#define FLPROG_CORE_STM32_L073
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L073V8TX) 
#define FLPROG_CORE_NAME "GENERIC L073V8TX"
#define FLPROG_CORE_CODE 1189
#define FLPROG_CORE_GENERIC_L073V8TX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L0
#define FLPROG_CORE_STM32_L073
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L073VBIX) 
#define FLPROG_CORE_NAME "GENERIC L073VBIX"
#define FLPROG_CORE_CODE 1190
#define FLPROG_CORE_GENERIC_L073VBIX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L0
#define FLPROG_CORE_STM32_L073
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L073VBTX) 
#define FLPROG_CORE_NAME "GENERIC L073VBTX"
#define FLPROG_CORE_CODE 1191
#define FLPROG_CORE_GENERIC_L073VBTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L0
#define FLPROG_CORE_STM32_L073
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L073VZIX) 
#define FLPROG_CORE_NAME "GENERIC L073VZIX"
#define FLPROG_CORE_CODE 1192
#define FLPROG_CORE_GENERIC_L073VZIX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L0
#define FLPROG_CORE_STM32_L073
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L073VZTX) 
#define FLPROG_CORE_NAME "GENERIC L073VZTX"
#define FLPROG_CORE_CODE 1193
#define FLPROG_CORE_GENERIC_L073VZTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L0
#define FLPROG_CORE_STM32_L073
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_NUCLEO_L073RZ) 
#define FLPROG_CORE_NAME "NUCLEO L073RZ"
#define FLPROG_CORE_CODE 1408
#define FLPROG_CORE_NUCLEO_L073RZ
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L0
#define FLPROG_CORE_STM32_L073
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L082CZUX) 
#define FLPROG_CORE_NAME "GENERIC L082CZUX"
#define FLPROG_CORE_CODE 1194
#define FLPROG_CORE_GENERIC_L082CZUX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L0
#define FLPROG_CORE_STM32_L082
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L082CZYX) 
#define FLPROG_CORE_NAME "GENERIC L082CZYX"
#define FLPROG_CORE_CODE 1195
#define FLPROG_CORE_GENERIC_L082CZYX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L0
#define FLPROG_CORE_STM32_L082
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L082KBTX) 
#define FLPROG_CORE_NAME "GENERIC L082KBTX"
#define FLPROG_CORE_CODE 1196
#define FLPROG_CORE_GENERIC_L082KBTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L0
#define FLPROG_CORE_STM32_L082
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L082KBUX) 
#define FLPROG_CORE_NAME "GENERIC L082KBUX"
#define FLPROG_CORE_CODE 1197
#define FLPROG_CORE_GENERIC_L082KBUX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L0
#define FLPROG_CORE_STM32_L082
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L082KZTX) 
#define FLPROG_CORE_NAME "GENERIC L082KZTX"
#define FLPROG_CORE_CODE 1198
#define FLPROG_CORE_GENERIC_L082KZTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L0
#define FLPROG_CORE_STM32_L082
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L082KZUX) 
#define FLPROG_CORE_NAME "GENERIC L082KZUX"
#define FLPROG_CORE_CODE 1199
#define FLPROG_CORE_GENERIC_L082KZUX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L0
#define FLPROG_CORE_STM32_L082
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L083CBTX) 
#define FLPROG_CORE_NAME "GENERIC L083CBTX"
#define FLPROG_CORE_CODE 1200
#define FLPROG_CORE_GENERIC_L083CBTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L0
#define FLPROG_CORE_STM32_L083
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L083CZTX) 
#define FLPROG_CORE_NAME "GENERIC L083CZTX"
#define FLPROG_CORE_CODE 1201
#define FLPROG_CORE_GENERIC_L083CZTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L0
#define FLPROG_CORE_STM32_L083
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L083CZUX) 
#define FLPROG_CORE_NAME "GENERIC L083CZUX"
#define FLPROG_CORE_CODE 1202
#define FLPROG_CORE_GENERIC_L083CZUX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L0
#define FLPROG_CORE_STM32_L083
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L083RBHX) 
#define FLPROG_CORE_NAME "GENERIC L083RBHX"
#define FLPROG_CORE_CODE 1203
#define FLPROG_CORE_GENERIC_L083RBHX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L0
#define FLPROG_CORE_STM32_L083
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L083RBTX) 
#define FLPROG_CORE_NAME "GENERIC L083RBTX"
#define FLPROG_CORE_CODE 1204
#define FLPROG_CORE_GENERIC_L083RBTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L0
#define FLPROG_CORE_STM32_L083
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L083RZHX) 
#define FLPROG_CORE_NAME "GENERIC L083RZHX"
#define FLPROG_CORE_CODE 1205
#define FLPROG_CORE_GENERIC_L083RZHX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L0
#define FLPROG_CORE_STM32_L083
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L083RZTX) 
#define FLPROG_CORE_NAME "GENERIC L083RZTX"
#define FLPROG_CORE_CODE 1206
#define FLPROG_CORE_GENERIC_L083RZTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L0
#define FLPROG_CORE_STM32_L083
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L083V8IX) 
#define FLPROG_CORE_NAME "GENERIC L083V8IX"
#define FLPROG_CORE_CODE 1207
#define FLPROG_CORE_GENERIC_L083V8IX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L0
#define FLPROG_CORE_STM32_L083
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L083V8TX) 
#define FLPROG_CORE_NAME "GENERIC L083V8TX"
#define FLPROG_CORE_CODE 1208
#define FLPROG_CORE_GENERIC_L083V8TX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L0
#define FLPROG_CORE_STM32_L083
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L083VBIX) 
#define FLPROG_CORE_NAME "GENERIC L083VBIX"
#define FLPROG_CORE_CODE 1209
#define FLPROG_CORE_GENERIC_L083VBIX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L0
#define FLPROG_CORE_STM32_L083
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L083VBTX) 
#define FLPROG_CORE_NAME "GENERIC L083VBTX"
#define FLPROG_CORE_CODE 1210
#define FLPROG_CORE_GENERIC_L083VBTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L0
#define FLPROG_CORE_STM32_L083
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L083VZIX) 
#define FLPROG_CORE_NAME "GENERIC L083VZIX"
#define FLPROG_CORE_CODE 1211
#define FLPROG_CORE_GENERIC_L083VZIX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L0
#define FLPROG_CORE_STM32_L083
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L083VZTX) 
#define FLPROG_CORE_NAME "GENERIC L083VZTX"
#define FLPROG_CORE_CODE 1212
#define FLPROG_CORE_GENERIC_L083VZTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L0
#define FLPROG_CORE_STM32_L083
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L100C6UX) 
#define FLPROG_CORE_NAME "GENERIC L100C6UX"
#define FLPROG_CORE_CODE 1213
#define FLPROG_CORE_GENERIC_L100C6UX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L1
#define FLPROG_CORE_STM32_L100
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L100C6UXA) 
#define FLPROG_CORE_NAME "GENERIC L100C6UXA"
#define FLPROG_CORE_CODE 1214
#define FLPROG_CORE_GENERIC_L100C6UXA
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L1
#define FLPROG_CORE_STM32_L100
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L151C6TX) 
#define FLPROG_CORE_NAME "GENERIC L151C6TX"
#define FLPROG_CORE_CODE 1215
#define FLPROG_CORE_GENERIC_L151C6TX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L1
#define FLPROG_CORE_STM32_L151
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L151C6TXA) 
#define FLPROG_CORE_NAME "GENERIC L151C6TXA"
#define FLPROG_CORE_CODE 1216
#define FLPROG_CORE_GENERIC_L151C6TXA
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L1
#define FLPROG_CORE_STM32_L151
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L151C6UX) 
#define FLPROG_CORE_NAME "GENERIC L151C6UX"
#define FLPROG_CORE_CODE 1217
#define FLPROG_CORE_GENERIC_L151C6UX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L1
#define FLPROG_CORE_STM32_L151
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L151C6UXA) 
#define FLPROG_CORE_NAME "GENERIC L151C6UXA"
#define FLPROG_CORE_CODE 1218
#define FLPROG_CORE_GENERIC_L151C6UXA
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L1
#define FLPROG_CORE_STM32_L151
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L151C8TX) 
#define FLPROG_CORE_NAME "GENERIC L151C8TX"
#define FLPROG_CORE_CODE 1219
#define FLPROG_CORE_GENERIC_L151C8TX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L1
#define FLPROG_CORE_STM32_L151
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L151C8TXA) 
#define FLPROG_CORE_NAME "GENERIC L151C8TXA"
#define FLPROG_CORE_CODE 1220
#define FLPROG_CORE_GENERIC_L151C8TXA
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L1
#define FLPROG_CORE_STM32_L151
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L151C8UX) 
#define FLPROG_CORE_NAME "GENERIC L151C8UX"
#define FLPROG_CORE_CODE 1221
#define FLPROG_CORE_GENERIC_L151C8UX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L1
#define FLPROG_CORE_STM32_L151
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L151C8UXA) 
#define FLPROG_CORE_NAME "GENERIC L151C8UXA"
#define FLPROG_CORE_CODE 1222
#define FLPROG_CORE_GENERIC_L151C8UXA
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L1
#define FLPROG_CORE_STM32_L151
#endif
