Totuin/Flprog_Utilites/src/selectCore/flprogSelectCore_stm32.h
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L151CBTX) 
#define FLPROG_CORE_NAME "GENERIC L151CBTX"
#define FLPROG_CORE_CODE 1223
#define FLPROG_CORE_GENERIC_L151CBTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L1
#define FLPROG_CORE_STM32_L151
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L151CBTXA) 
#define FLPROG_CORE_NAME "GENERIC L151CBTXA"
#define FLPROG_CORE_CODE 1224
#define FLPROG_CORE_GENERIC_L151CBTXA
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L1
#define FLPROG_CORE_STM32_L151
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L151CBUX) 
#define FLPROG_CORE_NAME "GENERIC L151CBUX"
#define FLPROG_CORE_CODE 1225
#define FLPROG_CORE_GENERIC_L151CBUX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L1
#define FLPROG_CORE_STM32_L151
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L151CBUXA) 
#define FLPROG_CORE_NAME "GENERIC L151CBUXA"
#define FLPROG_CORE_CODE 1226
#define FLPROG_CORE_GENERIC_L151CBUXA
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L1
#define FLPROG_CORE_STM32_L151
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L151RETX) 
#define FLPROG_CORE_NAME "GENERIC L151RETX"
#define FLPROG_CORE_CODE 1227
#define FLPROG_CORE_GENERIC_L151RETX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L1
#define FLPROG_CORE_STM32_L151
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_RAK811_TRACKER) 
#define FLPROG_CORE_NAME "RAK811 TRACKER"
#define FLPROG_CORE_CODE 1437
#define FLPROG_CORE_RAK811_TRACKER
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L1
#define FLPROG_CORE_STM32_L151
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L152C6TX) 
#define FLPROG_CORE_NAME "GENERIC L152C6TX"
#define FLPROG_CORE_CODE 1228
#define FLPROG_CORE_GENERIC_L152C6TX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L1
#define FLPROG_CORE_STM32_L152
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L152C6TXA) 
#define FLPROG_CORE_NAME "GENERIC L152C6TXA"
#define FLPROG_CORE_CODE 1229
#define FLPROG_CORE_GENERIC_L152C6TXA
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L1
#define FLPROG_CORE_STM32_L152
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L152C6UX) 
#define FLPROG_CORE_NAME "GENERIC L152C6UX"
#define FLPROG_CORE_CODE 1230
#define FLPROG_CORE_GENERIC_L152C6UX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L1
#define FLPROG_CORE_STM32_L152
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L152C6UXA) 
#define FLPROG_CORE_NAME "GENERIC L152C6UXA"
#define FLPROG_CORE_CODE 1231
#define FLPROG_CORE_GENERIC_L152C6UXA
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L1
#define FLPROG_CORE_STM32_L152
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L152C8TX) 
#define FLPROG_CORE_NAME "GENERIC L152C8TX"
#define FLPROG_CORE_CODE 1232
#define FLPROG_CORE_GENERIC_L152C8TX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L1
#define FLPROG_CORE_STM32_L152
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L152C8TXA) 
#define FLPROG_CORE_NAME "GENERIC L152C8TXA"
#define FLPROG_CORE_CODE 1233
#define FLPROG_CORE_GENERIC_L152C8TXA
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L1
#define FLPROG_CORE_STM32_L152
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L152C8UX) 
#define FLPROG_CORE_NAME "GENERIC L152C8UX"
#define FLPROG_CORE_CODE 1234
#define FLPROG_CORE_GENERIC_L152C8UX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L1
#define FLPROG_CORE_STM32_L152
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L152C8UXA) 
#define FLPROG_CORE_NAME "GENERIC L152C8UXA"
#define FLPROG_CORE_CODE 1235
#define FLPROG_CORE_GENERIC_L152C8UXA
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L1
#define FLPROG_CORE_STM32_L152
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L152CBTX) 
#define FLPROG_CORE_NAME "GENERIC L152CBTX"
#define FLPROG_CORE_CODE 1236
#define FLPROG_CORE_GENERIC_L152CBTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L1
#define FLPROG_CORE_STM32_L152
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L152CBTXA) 
#define FLPROG_CORE_NAME "GENERIC L152CBTXA"
#define FLPROG_CORE_CODE 1237
#define FLPROG_CORE_GENERIC_L152CBTXA
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L1
#define FLPROG_CORE_STM32_L152
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L152CBUX) 
#define FLPROG_CORE_NAME "GENERIC L152CBUX"
#define FLPROG_CORE_CODE 1238
#define FLPROG_CORE_GENERIC_L152CBUX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L1
#define FLPROG_CORE_STM32_L152
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L152CBUXA) 
#define FLPROG_CORE_NAME "GENERIC L152CBUXA"
#define FLPROG_CORE_CODE 1239
#define FLPROG_CORE_GENERIC_L152CBUXA
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L1
#define FLPROG_CORE_STM32_L152
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L152RETX) 
#define FLPROG_CORE_NAME "GENERIC L152RETX"
#define FLPROG_CORE_CODE 1240
#define FLPROG_CORE_GENERIC_L152RETX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L1
#define FLPROG_CORE_STM32_L152
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_NUCLEO_L152RE) 
#define FLPROG_CORE_NAME "NUCLEO L152RE"
#define FLPROG_CORE_CODE 1409
#define FLPROG_CORE_NUCLEO_L152RE
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L1
#define FLPROG_CORE_STM32_L152
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L162RETX) 
#define FLPROG_CORE_NAME "GENERIC L162RETX"
#define FLPROG_CORE_CODE 1241
#define FLPROG_CORE_GENERIC_L162RETX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L1
#define FLPROG_CORE_STM32_L162
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L412K8TX) 
#define FLPROG_CORE_NAME "GENERIC L412K8TX"
#define FLPROG_CORE_CODE 1242
#define FLPROG_CORE_GENERIC_L412K8TX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L4
#define FLPROG_CORE_STM32_L412
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L412K8UX) 
#define FLPROG_CORE_NAME "GENERIC L412K8UX"
#define FLPROG_CORE_CODE 1243
#define FLPROG_CORE_GENERIC_L412K8UX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L4
#define FLPROG_CORE_STM32_L412
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L412KBTX) 
#define FLPROG_CORE_NAME "GENERIC L412KBTX"
#define FLPROG_CORE_CODE 1244
#define FLPROG_CORE_GENERIC_L412KBTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L4
#define FLPROG_CORE_STM32_L412
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L412KBUX) 
#define FLPROG_CORE_NAME "GENERIC L412KBUX"
#define FLPROG_CORE_CODE 1245
#define FLPROG_CORE_GENERIC_L412KBUX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L4
#define FLPROG_CORE_STM32_L412
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_NUCLEO_L412KB) 
#define FLPROG_CORE_NAME "NUCLEO L412KB"
#define FLPROG_CORE_CODE 1410
#define FLPROG_CORE_NUCLEO_L412KB
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L4
#define FLPROG_CORE_STM32_L412
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L422KBTX) 
#define FLPROG_CORE_NAME "GENERIC L422KBTX"
#define FLPROG_CORE_CODE 1246
#define FLPROG_CORE_GENERIC_L422KBTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L4
#define FLPROG_CORE_STM32_L422
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L422KBUX) 
#define FLPROG_CORE_NAME "GENERIC L422KBUX"
#define FLPROG_CORE_CODE 1247
#define FLPROG_CORE_GENERIC_L422KBUX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L4
#define FLPROG_CORE_STM32_L422
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L431RBIX) 
#define FLPROG_CORE_NAME "GENERIC L431RBIX"
#define FLPROG_CORE_CODE 1248
#define FLPROG_CORE_GENERIC_L431RBIX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L4
#define FLPROG_CORE_STM32_L431
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L431RBTX) 
#define FLPROG_CORE_NAME "GENERIC L431RBTX"
#define FLPROG_CORE_CODE 1249
#define FLPROG_CORE_GENERIC_L431RBTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L4
#define FLPROG_CORE_STM32_L431
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L431RBYX) 
#define FLPROG_CORE_NAME "GENERIC L431RBYX"
#define FLPROG_CORE_CODE 1250
#define FLPROG_CORE_GENERIC_L431RBYX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L4
#define FLPROG_CORE_STM32_L431
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L431RCIX) 
#define FLPROG_CORE_NAME "GENERIC L431RCIX"
#define FLPROG_CORE_CODE 1251
#define FLPROG_CORE_GENERIC_L431RCIX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L4
#define FLPROG_CORE_STM32_L431
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L431RCTX) 
#define FLPROG_CORE_NAME "GENERIC L431RCTX"
#define FLPROG_CORE_CODE 1252
#define FLPROG_CORE_GENERIC_L431RCTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L4
#define FLPROG_CORE_STM32_L431
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L431RCYX) 
#define FLPROG_CORE_NAME "GENERIC L431RCYX"
#define FLPROG_CORE_CODE 1253
#define FLPROG_CORE_GENERIC_L431RCYX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L4
#define FLPROG_CORE_STM32_L431
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L432KBUX) 
#define FLPROG_CORE_NAME "GENERIC L432KBUX"
#define FLPROG_CORE_CODE 1254
#define FLPROG_CORE_GENERIC_L432KBUX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L4
#define FLPROG_CORE_STM32_L432
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L432KCUX) 
#define FLPROG_CORE_NAME "GENERIC L432KCUX"
#define FLPROG_CORE_CODE 1255
#define FLPROG_CORE_GENERIC_L432KCUX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L4
#define FLPROG_CORE_STM32_L432
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_NUCLEO_L432KC) 
#define FLPROG_CORE_NAME "NUCLEO L432KC"
#define FLPROG_CORE_CODE 1411
#define FLPROG_CORE_NUCLEO_L432KC
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L4
#define FLPROG_CORE_STM32_L432
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L433CBTX) 
#define FLPROG_CORE_NAME "GENERIC L433CBTX"
#define FLPROG_CORE_CODE 1256
#define FLPROG_CORE_GENERIC_L433CBTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L4
#define FLPROG_CORE_STM32_L433
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L433CBUX) 
#define FLPROG_CORE_NAME "GENERIC L433CBUX"
#define FLPROG_CORE_CODE 1257
#define FLPROG_CORE_GENERIC_L433CBUX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L4
#define FLPROG_CORE_STM32_L433
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L433CCTX) 
#define FLPROG_CORE_NAME "GENERIC L433CCTX"
#define FLPROG_CORE_CODE 1258
#define FLPROG_CORE_GENERIC_L433CCTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L4
#define FLPROG_CORE_STM32_L433
#endif
