Totuin/Flprog_Utilites/src/selectCore/flprogSelectCore_stm32.h
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L433CCUX) 
#define FLPROG_CORE_NAME "GENERIC L433CCUX"
#define FLPROG_CORE_CODE 1259
#define FLPROG_CORE_GENERIC_L433CCUX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L4
#define FLPROG_CORE_STM32_L433
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L433RCTXP) 
#define FLPROG_CORE_NAME "GENERIC L433RCTXP"
#define FLPROG_CORE_CODE 1260
#define FLPROG_CORE_GENERIC_L433RCTXP
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L4
#define FLPROG_CORE_STM32_L433
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_NUCLEO_L433RC_P) 
#define FLPROG_CORE_NAME "NUCLEO L433RC P"
#define FLPROG_CORE_CODE 1412
#define FLPROG_CORE_NUCLEO_L433RC_P
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L4
#define FLPROG_CORE_STM32_L433
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L442KCUX) 
#define FLPROG_CORE_NAME "GENERIC L442KCUX"
#define FLPROG_CORE_CODE 1261
#define FLPROG_CORE_GENERIC_L442KCUX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L4
#define FLPROG_CORE_STM32_L442
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L443CCTX) 
#define FLPROG_CORE_NAME "GENERIC L443CCTX"
#define FLPROG_CORE_CODE 1262
#define FLPROG_CORE_GENERIC_L443CCTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L4
#define FLPROG_CORE_STM32_L443
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L443CCUX) 
#define FLPROG_CORE_NAME "GENERIC L443CCUX"
#define FLPROG_CORE_CODE 1263
#define FLPROG_CORE_GENERIC_L443CCUX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L4
#define FLPROG_CORE_STM32_L443
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L452RCIX) 
#define FLPROG_CORE_NAME "GENERIC L452RCIX"
#define FLPROG_CORE_CODE 1264
#define FLPROG_CORE_GENERIC_L452RCIX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L4
#define FLPROG_CORE_STM32_L452
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L452RCTX) 
#define FLPROG_CORE_NAME "GENERIC L452RCTX"
#define FLPROG_CORE_CODE 1265
#define FLPROG_CORE_GENERIC_L452RCTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L4
#define FLPROG_CORE_STM32_L452
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L452RCYX) 
#define FLPROG_CORE_NAME "GENERIC L452RCYX"
#define FLPROG_CORE_CODE 1266
#define FLPROG_CORE_GENERIC_L452RCYX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L4
#define FLPROG_CORE_STM32_L452
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L452REIX) 
#define FLPROG_CORE_NAME "GENERIC L452REIX"
#define FLPROG_CORE_CODE 1267
#define FLPROG_CORE_GENERIC_L452REIX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L4
#define FLPROG_CORE_STM32_L452
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L452RETX) 
#define FLPROG_CORE_NAME "GENERIC L452RETX"
#define FLPROG_CORE_CODE 1268
#define FLPROG_CORE_GENERIC_L452RETX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L4
#define FLPROG_CORE_STM32_L452
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L452RETXP) 
#define FLPROG_CORE_NAME "GENERIC L452RETXP"
#define FLPROG_CORE_CODE 1269
#define FLPROG_CORE_GENERIC_L452RETXP
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L4
#define FLPROG_CORE_STM32_L452
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L452REYX) 
#define FLPROG_CORE_NAME "GENERIC L452REYX"
#define FLPROG_CORE_CODE 1270
#define FLPROG_CORE_GENERIC_L452REYX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L4
#define FLPROG_CORE_STM32_L452
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_LEAFONY_AP03) 
#define FLPROG_CORE_NAME "LEAFONY AP03"
#define FLPROG_CORE_CODE 1367
#define FLPROG_CORE_LEAFONY_AP03
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L4
#define FLPROG_CORE_STM32_L452
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_NUCLEO_L452RE) 
#define FLPROG_CORE_NAME "NUCLEO L452RE"
#define FLPROG_CORE_CODE 1413
#define FLPROG_CORE_NUCLEO_L452RE
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L4
#define FLPROG_CORE_STM32_L452
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_NUCLEO_L452RE_P) 
#define FLPROG_CORE_NAME "NUCLEO L452RE P"
#define FLPROG_CORE_CODE 1414
#define FLPROG_CORE_NUCLEO_L452RE_P
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L4
#define FLPROG_CORE_STM32_L452
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L462REIX) 
#define FLPROG_CORE_NAME "GENERIC L462REIX"
#define FLPROG_CORE_CODE 1271
#define FLPROG_CORE_GENERIC_L462REIX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L4
#define FLPROG_CORE_STM32_L462
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L462RETX) 
#define FLPROG_CORE_NAME "GENERIC L462RETX"
#define FLPROG_CORE_CODE 1272
#define FLPROG_CORE_GENERIC_L462RETX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L4
#define FLPROG_CORE_STM32_L462
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L462REYX) 
#define FLPROG_CORE_NAME "GENERIC L462REYX"
#define FLPROG_CORE_CODE 1273
#define FLPROG_CORE_GENERIC_L462REYX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L4
#define FLPROG_CORE_STM32_L462
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_B_L475E_IOT01A) 
#define FLPROG_CORE_NAME "B L475E IOT01A"
#define FLPROG_CORE_CODE 342
#define FLPROG_CORE_B_L475E_IOT01A
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L4
#define FLPROG_CORE_STM32_L475
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L475RCTX) 
#define FLPROG_CORE_NAME "GENERIC L475RCTX"
#define FLPROG_CORE_CODE 1274
#define FLPROG_CORE_GENERIC_L475RCTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L4
#define FLPROG_CORE_STM32_L475
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L475RETX) 
#define FLPROG_CORE_NAME "GENERIC L475RETX"
#define FLPROG_CORE_CODE 1275
#define FLPROG_CORE_GENERIC_L475RETX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L4
#define FLPROG_CORE_STM32_L475
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L475RGTX) 
#define FLPROG_CORE_NAME "GENERIC L475RGTX"
#define FLPROG_CORE_CODE 1276
#define FLPROG_CORE_GENERIC_L475RGTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L4
#define FLPROG_CORE_STM32_L475
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L475VCTX) 
#define FLPROG_CORE_NAME "GENERIC L475VCTX"
#define FLPROG_CORE_CODE 1277
#define FLPROG_CORE_GENERIC_L475VCTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L4
#define FLPROG_CORE_STM32_L475
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L475VETX) 
#define FLPROG_CORE_NAME "GENERIC L475VETX"
#define FLPROG_CORE_CODE 1278
#define FLPROG_CORE_GENERIC_L475VETX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L4
#define FLPROG_CORE_STM32_L475
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L475VGTX) 
#define FLPROG_CORE_NAME "GENERIC L475VGTX"
#define FLPROG_CORE_CODE 1279
#define FLPROG_CORE_GENERIC_L475VGTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L4
#define FLPROG_CORE_STM32_L475
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L476RCTX) 
#define FLPROG_CORE_NAME "GENERIC L476RCTX"
#define FLPROG_CORE_CODE 1280
#define FLPROG_CORE_GENERIC_L476RCTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L4
#define FLPROG_CORE_STM32_L476
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L476RETX) 
#define FLPROG_CORE_NAME "GENERIC L476RETX"
#define FLPROG_CORE_CODE 1281
#define FLPROG_CORE_GENERIC_L476RETX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L4
#define FLPROG_CORE_STM32_L476
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L476RGTX) 
#define FLPROG_CORE_NAME "GENERIC L476RGTX"
#define FLPROG_CORE_CODE 1282
#define FLPROG_CORE_GENERIC_L476RGTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L4
#define FLPROG_CORE_STM32_L476
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L476VCTX) 
#define FLPROG_CORE_NAME "GENERIC L476VCTX"
#define FLPROG_CORE_CODE 1283
#define FLPROG_CORE_GENERIC_L476VCTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L4
#define FLPROG_CORE_STM32_L476
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L476VETX) 
#define FLPROG_CORE_NAME "GENERIC L476VETX"
#define FLPROG_CORE_CODE 1284
#define FLPROG_CORE_GENERIC_L476VETX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L4
#define FLPROG_CORE_STM32_L476
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L476VGTX) 
#define FLPROG_CORE_NAME "GENERIC L476VGTX"
#define FLPROG_CORE_CODE 1285
#define FLPROG_CORE_GENERIC_L476VGTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L4
#define FLPROG_CORE_STM32_L476
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_NUCLEO_L476RG) 
#define FLPROG_CORE_NAME "NUCLEO L476RG"
#define FLPROG_CORE_CODE 1415
#define FLPROG_CORE_NUCLEO_L476RG
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L4
#define FLPROG_CORE_STM32_L476
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L486RGTX) 
#define FLPROG_CORE_NAME "GENERIC L486RGTX"
#define FLPROG_CORE_CODE 1286
#define FLPROG_CORE_GENERIC_L486RGTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L4
#define FLPROG_CORE_STM32_L486
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L486VGTX) 
#define FLPROG_CORE_NAME "GENERIC L486VGTX"
#define FLPROG_CORE_CODE 1287
#define FLPROG_CORE_GENERIC_L486VGTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L4
#define FLPROG_CORE_STM32_L486
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L496ZETX) 
#define FLPROG_CORE_NAME "GENERIC L496ZETX"
#define FLPROG_CORE_CODE 1288
#define FLPROG_CORE_GENERIC_L496ZETX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L4
#define FLPROG_CORE_STM32_L496
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L496ZGTX) 
#define FLPROG_CORE_NAME "GENERIC L496ZGTX"
#define FLPROG_CORE_CODE 1289
#define FLPROG_CORE_GENERIC_L496ZGTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L4
#define FLPROG_CORE_STM32_L496
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L496ZGTXP) 
#define FLPROG_CORE_NAME "GENERIC L496ZGTXP"
#define FLPROG_CORE_CODE 1290
#define FLPROG_CORE_GENERIC_L496ZGTXP
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L4
#define FLPROG_CORE_STM32_L496
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_NUCLEO_L496ZG) 
#define FLPROG_CORE_NAME "NUCLEO L496ZG"
#define FLPROG_CORE_CODE 1416
#define FLPROG_CORE_NUCLEO_L496ZG
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L4
#define FLPROG_CORE_STM32_L496
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_NUCLEO_L496ZG_P) 
#define FLPROG_CORE_NAME "NUCLEO L496ZG P"
#define FLPROG_CORE_CODE 1417
#define FLPROG_CORE_NUCLEO_L496ZG_P
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L4
#define FLPROG_CORE_STM32_L496
#endif
