Totuin/Flprog_Utilites/src/selectCore/flprogSelectCore_stm32.h
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L4A6ZGTX) 
#define FLPROG_CORE_NAME "GENERIC L4A6ZGTX"
#define FLPROG_CORE_CODE 1291
#define FLPROG_CORE_GENERIC_L4A6ZGTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L4
#define FLPROG_CORE_STM32_L4A6
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L4A6ZGTXP) 
#define FLPROG_CORE_NAME "GENERIC L4A6ZGTXP"
#define FLPROG_CORE_CODE 1292
#define FLPROG_CORE_GENERIC_L4A6ZGTXP
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L4
#define FLPROG_CORE_STM32_L4A6
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L4R5VGTX) 
#define FLPROG_CORE_NAME "GENERIC L4R5VGTX"
#define FLPROG_CORE_CODE 1293
#define FLPROG_CORE_GENERIC_L4R5VGTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L4
#define FLPROG_CORE_STM32_L4R5
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L4R5VITX) 
#define FLPROG_CORE_NAME "GENERIC L4R5VITX"
#define FLPROG_CORE_CODE 1294
#define FLPROG_CORE_GENERIC_L4R5VITX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L4
#define FLPROG_CORE_STM32_L4R5
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L4R5ZGTX) 
#define FLPROG_CORE_NAME "GENERIC L4R5ZGTX"
#define FLPROG_CORE_CODE 1295
#define FLPROG_CORE_GENERIC_L4R5ZGTX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L4
#define FLPROG_CORE_STM32_L4R5
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L4R5ZGYX) 
#define FLPROG_CORE_NAME "GENERIC L4R5ZGYX"
#define FLPROG_CORE_CODE 1296
#define FLPROG_CORE_GENERIC_L4R5ZGYX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L4
#define FLPROG_CORE_STM32_L4R5
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L4R5ZITX) 
#define FLPROG_CORE_NAME "GENERIC L4R5ZITX"
#define FLPROG_CORE_CODE 1297
#define FLPROG_CORE_GENERIC_L4R5ZITX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L4
#define FLPROG_CORE_STM32_L4R5
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L4R5ZITXP) 
#define FLPROG_CORE_NAME "GENERIC L4R5ZITXP"
#define FLPROG_CORE_CODE 1298
#define FLPROG_CORE_GENERIC_L4R5ZITXP
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L4
#define FLPROG_CORE_STM32_L4R5
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L4R5ZIYX) 
#define FLPROG_CORE_NAME "GENERIC L4R5ZIYX"
#define FLPROG_CORE_CODE 1299
#define FLPROG_CORE_GENERIC_L4R5ZIYX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L4
#define FLPROG_CORE_STM32_L4R5
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_NUCLEO_L4R5ZI) 
#define FLPROG_CORE_NAME "NUCLEO L4R5ZI"
#define FLPROG_CORE_CODE 1418
#define FLPROG_CORE_NUCLEO_L4R5ZI
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L4
#define FLPROG_CORE_STM32_L4R5
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_NUCLEO_L4R5ZI_P) 
#define FLPROG_CORE_NAME "NUCLEO L4R5ZI P"
#define FLPROG_CORE_CODE 1419
#define FLPROG_CORE_NUCLEO_L4R5ZI_P
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L4
#define FLPROG_CORE_STM32_L4R5
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_SWAN_R5) 
#define FLPROG_CORE_NAME "SWAN R5"
#define FLPROG_CORE_CODE 1450
#define FLPROG_CORE_SWAN_R5
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L4
#define FLPROG_CORE_STM32_L4R5
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L4R7VITX) 
#define FLPROG_CORE_NAME "GENERIC L4R7VITX"
#define FLPROG_CORE_CODE 1300
#define FLPROG_CORE_GENERIC_L4R7VITX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L4
#define FLPROG_CORE_STM32_L4R7
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L4R7ZITX) 
#define FLPROG_CORE_NAME "GENERIC L4R7ZITX"
#define FLPROG_CORE_CODE 1301
#define FLPROG_CORE_GENERIC_L4R7ZITX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L4
#define FLPROG_CORE_STM32_L4R7
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L4R9ZGJX) 
#define FLPROG_CORE_NAME "GENERIC L4R9ZGJX"
#define FLPROG_CORE_CODE 1302
#define FLPROG_CORE_GENERIC_L4R9ZGJX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L4
#define FLPROG_CORE_STM32_L4R9
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L4R9ZGYX) 
#define FLPROG_CORE_NAME "GENERIC L4R9ZGYX"
#define FLPROG_CORE_CODE 1303
#define FLPROG_CORE_GENERIC_L4R9ZGYX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L4
#define FLPROG_CORE_STM32_L4R9
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L4R9ZIJX) 
#define FLPROG_CORE_NAME "GENERIC L4R9ZIJX"
#define FLPROG_CORE_CODE 1304
#define FLPROG_CORE_GENERIC_L4R9ZIJX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L4
#define FLPROG_CORE_STM32_L4R9
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L4R9ZIYX) 
#define FLPROG_CORE_NAME "GENERIC L4R9ZIYX"
#define FLPROG_CORE_CODE 1305
#define FLPROG_CORE_GENERIC_L4R9ZIYX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L4
#define FLPROG_CORE_STM32_L4R9
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_STEVAL_MKSBOX1V1) 
#define FLPROG_CORE_NAME "STEVAL MKSBOX1V1"
#define FLPROG_CORE_CODE 1443
#define FLPROG_CORE_STEVAL_MKSBOX1V1
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L4
#define FLPROG_CORE_STM32_L4R9
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_B_L4S5I_IOT01A) 
#define FLPROG_CORE_NAME "B L4S5I IOT01A"
#define FLPROG_CORE_CODE 343
#define FLPROG_CORE_B_L4S5I_IOT01A
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L4
#define FLPROG_CORE_STM32_L4S5
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L4S5VITX) 
#define FLPROG_CORE_NAME "GENERIC L4S5VITX"
#define FLPROG_CORE_CODE 1306
#define FLPROG_CORE_GENERIC_L4S5VITX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L4
#define FLPROG_CORE_STM32_L4S5
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L4S5ZITX) 
#define FLPROG_CORE_NAME "GENERIC L4S5ZITX"
#define FLPROG_CORE_CODE 1307
#define FLPROG_CORE_GENERIC_L4S5ZITX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L4
#define FLPROG_CORE_STM32_L4S5
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L4S5ZIYX) 
#define FLPROG_CORE_NAME "GENERIC L4S5ZIYX"
#define FLPROG_CORE_CODE 1308
#define FLPROG_CORE_GENERIC_L4S5ZIYX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L4
#define FLPROG_CORE_STM32_L4S5
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L4S7VITX) 
#define FLPROG_CORE_NAME "GENERIC L4S7VITX"
#define FLPROG_CORE_CODE 1309
#define FLPROG_CORE_GENERIC_L4S7VITX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L4
#define FLPROG_CORE_STM32_L4S7
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L4S7ZITX) 
#define FLPROG_CORE_NAME "GENERIC L4S7ZITX"
#define FLPROG_CORE_CODE 1310
#define FLPROG_CORE_GENERIC_L4S7ZITX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L4
#define FLPROG_CORE_STM32_L4S7
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L4S9ZIJX) 
#define FLPROG_CORE_NAME "GENERIC L4S9ZIJX"
#define FLPROG_CORE_CODE 1311
#define FLPROG_CORE_GENERIC_L4S9ZIJX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L4
#define FLPROG_CORE_STM32_L4S9
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L4S9ZIYX) 
#define FLPROG_CORE_NAME "GENERIC L4S9ZIYX"
#define FLPROG_CORE_CODE 1312
#define FLPROG_CORE_GENERIC_L4S9ZIYX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L4
#define FLPROG_CORE_STM32_L4S9
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L552ZCTXQ) 
#define FLPROG_CORE_NAME "GENERIC L552ZCTXQ"
#define FLPROG_CORE_CODE 1313
#define FLPROG_CORE_GENERIC_L552ZCTXQ
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L5
#define FLPROG_CORE_STM32_L552
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L552ZETXQ) 
#define FLPROG_CORE_NAME "GENERIC L552ZETXQ"
#define FLPROG_CORE_CODE 1314
#define FLPROG_CORE_GENERIC_L552ZETXQ
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L5
#define FLPROG_CORE_STM32_L552
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_NUCLEO_L552ZE_Q) 
#define FLPROG_CORE_NAME "NUCLEO L552ZE Q"
#define FLPROG_CORE_CODE 1420
#define FLPROG_CORE_NUCLEO_L552ZE_Q
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L5
#define FLPROG_CORE_STM32_L552
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_L562ZETXQ) 
#define FLPROG_CORE_NAME "GENERIC L562ZETXQ"
#define FLPROG_CORE_CODE 1315
#define FLPROG_CORE_GENERIC_L562ZETXQ
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_L5
#define FLPROG_CORE_STM32_L562
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_STM32MP1) 
#define FLPROG_CORE_NAME "STM32MP1 series coprocessor"
#define FLPROG_CORE_CODE 1445
#define FLPROG_CORE_STM32MP1
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_MP
#define FLPROG_CORE_STM32_MP1
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_STM32MP157A_DK1) 
#define FLPROG_CORE_NAME "STM32MP157A DK1"
#define FLPROG_CORE_CODE 1446
#define FLPROG_CORE_STM32MP157A_DK1
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_MP
#define FLPROG_CORE_STM32_MP157
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_STM32MP157C_DK2) 
#define FLPROG_CORE_NAME "STM32MP157C DK2"
#define FLPROG_CORE_CODE 1447
#define FLPROG_CORE_STM32MP157C_DK2
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_MP
#define FLPROG_CORE_STM32_MP157
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_U575AGIXQ) 
#define FLPROG_CORE_NAME "GENERIC U575AGIXQ"
#define FLPROG_CORE_CODE 1317
#define FLPROG_CORE_GENERIC_U575AGIXQ
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_U5
#define FLPROG_CORE_STM32_U575
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_U575AIIXQ) 
#define FLPROG_CORE_NAME "GENERIC U575AIIXQ"
#define FLPROG_CORE_CODE 1318
#define FLPROG_CORE_GENERIC_U575AIIXQ
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_U5
#define FLPROG_CORE_STM32_U575
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_U575ZGTXQ) 
#define FLPROG_CORE_NAME "GENERIC U575ZGTXQ"
#define FLPROG_CORE_CODE 1319
#define FLPROG_CORE_GENERIC_U575ZGTXQ
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_U5
#define FLPROG_CORE_STM32_U575
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_U575ZITXQ) 
#define FLPROG_CORE_NAME "GENERIC U575ZITXQ"
#define FLPROG_CORE_CODE 1320
#define FLPROG_CORE_GENERIC_U575ZITXQ
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_U5
#define FLPROG_CORE_STM32_U575
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_NUCLEO_U575ZI_Q) 
#define FLPROG_CORE_NAME "NUCLEO U575ZI Q"
#define FLPROG_CORE_CODE 1421
#define FLPROG_CORE_NUCLEO_U575ZI_Q
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_U5
#define FLPROG_CORE_STM32_U575
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_B_U585I_IOT02A) 
#define FLPROG_CORE_NAME "B U585I IOT02A"
#define FLPROG_CORE_CODE 344
#define FLPROG_CORE_B_U585I_IOT02A
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_U5
#define FLPROG_CORE_STM32_U585
#endif
