Totuin/Flprog_Utilites/src/selectCore/flprogSelectCore_stm32.h
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_U585AIIXQ) 
#define FLPROG_CORE_NAME "GENERIC U585AIIXQ"
#define FLPROG_CORE_CODE 1321
#define FLPROG_CORE_GENERIC_U585AIIXQ
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_U5
#define FLPROG_CORE_STM32_U585
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_U585ZITXQ) 
#define FLPROG_CORE_NAME "GENERIC U585ZITXQ"
#define FLPROG_CORE_CODE 1322
#define FLPROG_CORE_GENERIC_U585ZITXQ
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_U5
#define FLPROG_CORE_STM32_U585
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_WB15CCUX) 
#define FLPROG_CORE_NAME "GENERIC WB15CCUX"
#define FLPROG_CORE_CODE 1323
#define FLPROG_CORE_GENERIC_WB15CCUX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_WB
#define FLPROG_CORE_STM32_WB15
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_NUCLEO_WB15CC) 
#define FLPROG_CORE_NAME "NUCLEO WB15CC"
#define FLPROG_CORE_CODE 1422
#define FLPROG_CORE_NUCLEO_WB15CC
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_WB
#define FLPROG_CORE_STM32_WB15
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_WB55CCUX) 
#define FLPROG_CORE_NAME "GENERIC WB55CCUX"
#define FLPROG_CORE_CODE 1324
#define FLPROG_CORE_GENERIC_WB55CCUX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_WB
#define FLPROG_CORE_STM32_WB55
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_WB55CEUX) 
#define FLPROG_CORE_NAME "GENERIC WB55CEUX"
#define FLPROG_CORE_CODE 1325
#define FLPROG_CORE_GENERIC_WB55CEUX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_WB
#define FLPROG_CORE_STM32_WB55
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_WB55CGUX) 
#define FLPROG_CORE_NAME "GENERIC WB55CGUX"
#define FLPROG_CORE_CODE 1326
#define FLPROG_CORE_GENERIC_WB55CGUX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_WB
#define FLPROG_CORE_STM32_WB55
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_WB55RCVX) 
#define FLPROG_CORE_NAME "GENERIC WB55RCVX"
#define FLPROG_CORE_CODE 1327
#define FLPROG_CORE_GENERIC_WB55RCVX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_WB
#define FLPROG_CORE_STM32_WB55
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_WB55REVX) 
#define FLPROG_CORE_NAME "GENERIC WB55REVX"
#define FLPROG_CORE_CODE 1328
#define FLPROG_CORE_GENERIC_WB55REVX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_WB
#define FLPROG_CORE_STM32_WB55
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_WB55RGVX) 
#define FLPROG_CORE_NAME "GENERIC WB55RGVX"
#define FLPROG_CORE_CODE 1329
#define FLPROG_CORE_GENERIC_WB55RGVX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_WB
#define FLPROG_CORE_STM32_WB55
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_MKR_SHARKY) 
#define FLPROG_CORE_NAME "MKR SHARKY"
#define FLPROG_CORE_CODE 1373
#define FLPROG_CORE_MKR_SHARKY
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_WB
#define FLPROG_CORE_STM32_WB55
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_P_NUCLEO_WB55RG) 
#define FLPROG_CORE_NAME "P NUCLEO WB55RG"
#define FLPROG_CORE_CODE 1435
#define FLPROG_CORE_P_NUCLEO_WB55RG
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_WB
#define FLPROG_CORE_STM32_WB55
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_P_NUCLEO_WB55_USB_DONGLE) 
#define FLPROG_CORE_NAME "P NUCLEO WB55 USB DONGLE"
#define FLPROG_CORE_CODE 1436
#define FLPROG_CORE_P_NUCLEO_WB55_USB_DONGLE
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_WB
#define FLPROG_CORE_STM32_WB55
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_WB5MMGHX) 
#define FLPROG_CORE_NAME "GENERIC WB5MMGHX"
#define FLPROG_CORE_CODE 1330
#define FLPROG_CORE_GENERIC_WB5MMGHX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_WB
#define FLPROG_CORE_STM32_WB5M
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_STM32WB5MM_DK) 
#define FLPROG_CORE_NAME "STM32WB5MM DK"
#define FLPROG_CORE_CODE 1448
#define FLPROG_CORE_STM32WB5MM_DK
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_WB
#define FLPROG_CORE_STM32_WB5M
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_WL54CCUX) 
#define FLPROG_CORE_NAME "GENERIC WL54CCUX"
#define FLPROG_CORE_CODE 1331
#define FLPROG_CORE_GENERIC_WL54CCUX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_WL
#define FLPROG_CORE_STM32_WL54
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_WL54JCIX) 
#define FLPROG_CORE_NAME "GENERIC WL54JCIX"
#define FLPROG_CORE_CODE 1332
#define FLPROG_CORE_GENERIC_WL54JCIX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_WL
#define FLPROG_CORE_STM32_WL54
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_NODE_SE_TTI) 
#define FLPROG_CORE_NAME "GENERIC NODE SE TTI"
#define FLPROG_CORE_CODE 1316
#define FLPROG_CORE_GENERIC_NODE_SE_TTI
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_WL
#define FLPROG_CORE_STM32_WL55
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_WL55CCUX) 
#define FLPROG_CORE_NAME "GENERIC WL55CCUX"
#define FLPROG_CORE_CODE 1333
#define FLPROG_CORE_GENERIC_WL55CCUX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_WL
#define FLPROG_CORE_STM32_WL55
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_WL55JCIX) 
#define FLPROG_CORE_NAME "GENERIC WL55JCIX"
#define FLPROG_CORE_CODE 1334
#define FLPROG_CORE_GENERIC_WL55JCIX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_WL
#define FLPROG_CORE_STM32_WL55
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_NUCLEO_WL55JC1) 
#define FLPROG_CORE_NAME "NUCLEO WL55JC1"
#define FLPROG_CORE_CODE 1423
#define FLPROG_CORE_NUCLEO_WL55JC1
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_WL
#define FLPROG_CORE_STM32_WL55
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_WLE4C8UX) 
#define FLPROG_CORE_NAME "GENERIC WLE4C8UX"
#define FLPROG_CORE_CODE 1335
#define FLPROG_CORE_GENERIC_WLE4C8UX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_WL
#define FLPROG_CORE_STM32_WLE4
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_WLE4CBUX) 
#define FLPROG_CORE_NAME "GENERIC WLE4CBUX"
#define FLPROG_CORE_CODE 1336
#define FLPROG_CORE_GENERIC_WLE4CBUX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_WL
#define FLPROG_CORE_STM32_WLE4
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_WLE4CCUX) 
#define FLPROG_CORE_NAME "GENERIC WLE4CCUX"
#define FLPROG_CORE_CODE 1337
#define FLPROG_CORE_GENERIC_WLE4CCUX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_WL
#define FLPROG_CORE_STM32_WLE4
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_WLE4J8IX) 
#define FLPROG_CORE_NAME "GENERIC WLE4J8IX"
#define FLPROG_CORE_CODE 1338
#define FLPROG_CORE_GENERIC_WLE4J8IX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_WL
#define FLPROG_CORE_STM32_WLE4
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_WLE4JBIX) 
#define FLPROG_CORE_NAME "GENERIC WLE4JBIX"
#define FLPROG_CORE_CODE 1339
#define FLPROG_CORE_GENERIC_WLE4JBIX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_WL
#define FLPROG_CORE_STM32_WLE4
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_WLE4JCIX) 
#define FLPROG_CORE_NAME "GENERIC WLE4JCIX"
#define FLPROG_CORE_CODE 1340
#define FLPROG_CORE_GENERIC_WLE4JCIX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_WL
#define FLPROG_CORE_STM32_WLE4
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_WLE5C8UX) 
#define FLPROG_CORE_NAME "GENERIC WLE5C8UX"
#define FLPROG_CORE_CODE 1341
#define FLPROG_CORE_GENERIC_WLE5C8UX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_WL
#define FLPROG_CORE_STM32_WLE5
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_WLE5CBUX) 
#define FLPROG_CORE_NAME "GENERIC WLE5CBUX"
#define FLPROG_CORE_CODE 1342
#define FLPROG_CORE_GENERIC_WLE5CBUX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_WL
#define FLPROG_CORE_STM32_WLE5
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_WLE5CCUX) 
#define FLPROG_CORE_NAME "GENERIC WLE5CCUX"
#define FLPROG_CORE_CODE 1343
#define FLPROG_CORE_GENERIC_WLE5CCUX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_WL
#define FLPROG_CORE_STM32_WLE5
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_WLE5J8IX) 
#define FLPROG_CORE_NAME "GENERIC WLE5J8IX"
#define FLPROG_CORE_CODE 1344
#define FLPROG_CORE_GENERIC_WLE5J8IX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_WL
#define FLPROG_CORE_STM32_WLE5
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_WLE5JBIX) 
#define FLPROG_CORE_NAME "GENERIC WLE5JBIX"
#define FLPROG_CORE_CODE 1345
#define FLPROG_CORE_GENERIC_WLE5JBIX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_WL
#define FLPROG_CORE_STM32_WLE5
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_GENERIC_WLE5JCIX) 
#define FLPROG_CORE_NAME "GENERIC WLE5JCIX"
#define FLPROG_CORE_CODE 1346
#define FLPROG_CORE_GENERIC_WLE5JCIX
#define FLPROG_CORE_STM
#define FLPROG_CORE_STM32                                         
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_CORE_STM32_WL
#define FLPROG_CORE_STM32_WLE5
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
